[
   {
      "park_latitude": 44.659645,
      "park_narrative": "
\n\tDiggers, this park's for you! Razor clamming is a favorite activity as well as surfing. If you plan to visit prime Newport attractions like the Oregon Coast Aquarium and Hatfield Marine Science Center, you must stop in for a refreshing picnic at Agate Beach.

\n
\n\tAgate Beach Wayside is situated between the new and old highway 101. There is a large parking lot with room for trailer parking. The beach access trail consists of a tunnel that goes underneath the old highway 101 to a large sandy beach area.

\n",
      "park_name": "Agate Beach State Recreation Site",
      "park_id": 152,
      "park_longitude": -124.056381
   },
   {
      "park_latitude": 45.59844,
      "park_narrative": "
\n\t                         Ainsworth Campground is OPEN for the 2015 camping season.

\n
\n\tAinsworth campground is now on the reservation system.  Please click green 'Reserve Online' link in the upper left or call (800) 452-5687 for reservations.

\n
\n\tNestled in the awe-inspiring Columbia River Gorge, Ainsworth is equal parts waterfall wonderland, hiker's playground and camper's delight.Situated at the eastern end of Historic Highway 30, from Ainsworth to Crown Point to the west, you'll find the world's greatest concentration of high waterfalls (like Multnomah Falls).

\n
\n\tBy leaving the park on Nesmith Point trail, you'll end up with a splendid view of St. Peter's Dome, a majestic basalt monolith rising 2,000 feet above the mighty Columbia River. Hiking is definitely something you'll want to do while camping at Ainsworth State Park.

\n
\n\tAinsworth is located in close proximity to Interstate 84 for ease of access as well as close to a working rail line that runs through the entire Columbia River Gorge.

\n
\n\tCampground info

\n
\n\tThis is a classic campground ... the smell of a campfire is your constant companion.

\n
\n\t
\n\t\tApproximately 40 full-hookup sites canopied in a laid-back, tree-filled setting
\n\t
\n\t\tSix walk-in tent sites
\n\t
\n\t\tDesignated bike-in camp area
\n\t
\n\t\tFlush toilets/showers
\n\t
\n\t\tFirewood
\n\t
\n\t\tInterpretive programs
\n
\n\n\tUniversal Access\n\tOne campsite accessible to campers with disabilities.
\n\n\tPlease secure your valuable when enjoying our parks.  Thank you!
\n",
      "park_name": "Ainsworth State Park",
      "park_id": 105,
      "park_longitude": -122.048974
   },
   {
      "park_latitude": 44.152158,
      "park_narrative": "
\n\tLarge trees characterize this forested park along Hwy 36 between Junction City and Triangle Lake. There's a picnic area, restroom, and short trail along the Long Tom River. Bring a lunch and relax!

\n",
      "park_name": "Alderwood State Wayside",
      "park_id": 59,
      "park_longitude": -123.425833
   },
   {
      "park_latitude": 42.112971,
      "park_narrative": "
\n\tYour first impression of Loeb may well be the fresh scent of the myrtlewood forest ... a crisp, eucalyptus-like fragrance.  The park is nestled in a grove of these lovely trees, many of which are well over 200 years old.  The pristine Chetco River runs clean and clear along the southeast edge of the park.

\n
\n\tSeveral campsites and three rental cabins face this scenic river.  During the year, you can fish, swim and raft, or walk the self-guided Riverview nature trail. The river offers some of the finest fall and winter salmon and steelhead fishing on the south coast.  You can plunk from the bank or try your luck on a drift boat. Throughout spring and summer you may see scampering squirrels, soaring osprey, or a family of river otters frolicking in the water.

\n
\n\tThe northern-most redwood grove in the U.S. can be found at the end of the Riverview Trail by crossing the North Bank Road and hiking the 1-mile U.S. Forest Service Redwood loop.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 45 electrical sites with water
\n\t
\n\t\tThree reservable rustic log cabins
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRiver and gravel bar access for fishing
\n\t
\n\t\tFirewood for sale
\n
\n\n\tUniversal Access\n\tOne campsite and one cabin are accessible to campers with disabilities.
\n",
      "park_name": "Alfred A. Loeb State Park",
      "park_id": 51,
      "park_longitude": -124.188543
   },
   {
      "park_latitude": 44.427349,
      "park_narrative": "
\n\tThe Historic Alsea Bay Bridge Interpretive Center in Waldport was constructed by the Oregon Department of Transportation as part of the bridge replacement project. It's operated by the Oregon Parks and Recreation Department with help from the Waldport Chamber of Commerce.

\n
\n\tClamming and crabbing demonstrations are led by guides from the Oregon Parks and Recreation Department during the summer months. Check out the events calendar for program days and times.

\n
\n\tSummer hours for the Alsea Bay Bridge Interpretive Center are 9:00 AM - 5:00 PM, seven days a week.

\n",
      "park_name": "Alsea Bay Historic Interpretive Center",
      "park_id": 143,
      "park_longitude": -124.067866
   },
   {
      "park_latitude": 45.846666,
      "park_narrative": "
\n\tA shady grove just off the highway and a few feet from the sandy ocean beach below, Arcadia State Recreation Site is located a mile south of Cannon Beach.   Take a lunch break on your way north or south, or plan for a day at the beach.  Bring your blanket, kick off your shoes and feel the waves lapping at your ankles.  Explore the beach and its tidepool areas to the north and south.  Or watch for surfers just off shore.  Please remember to keep an eye on the ocean, know if the tide is coming in or going out and explore tidepool areas gently and safely. 

\n
\n\tArcadia’s beach stretches for more than a mile between two headlands.  Just a short distance to the north is Humbug Point, with Lion Rock just off the point.  To the south is Hug Point.  Both headlands can only be passed at low tide.  Humbug Point was named by pioneers because it was often confused with Hug Point, the next headland south and the most difficult headland to round when traveling south along this stretch of coast.  If you have the luck to explore during low tide, .6 mile further north, past an off shore rock called Jockey Cap, is Silver Point, so named for the color of the weathered spruce trees on the bluff. 

\n
\n\tNotice the sandstone bluffs to the east and in cut-away places off the bluffs.  These sandstone areas were once underwater and only recently uplifted.  The pressures exerted on them from the uplift can be observed in the tilted and twisted patterns of layered rock.  In addition, wind, sea and rain have eroded the landscape and continue to do so today.

\n
\n\t 

\n",
      "park_name": "Arcadia Beach State Recreation Site",
      "park_id": 135,
      "park_longitude": -123.961111
   },
   {
      "park_latitude": 42.614301,
      "park_narrative": "
\n\tArizona Beach is a two-third mile stretch of sand bookended by two rocky headlands. The headlands shelter the beach from prevailing winds, creating temperatures warm enough to give the site its name.\n\t\n\tMussel and Myrtle creeks flow through the park east of U.S. 101. The wetlands attract elk and a variety of waterfowl.

\n
\n\tThe Arizona Pond at Arizona Beach is available for youth fishing only. That means kids up to 17 years old. We have an agreement with ODF&W that states that as long as we stay within those guidelines they will stock it with catchable rainbow trout. All ODF&W regulations apply to the pond, juvenile licenses are required for kids 14 thru 17.  The pond and surrounding area is also used for school groups and OPRD programs on fishing and environmental education.

\n",
      "park_name": "Arizona Beach State Recreation Site",
      "park_id": 188,
      "park_longitude": -124.396195
   },
   {
      "park_latitude": 45.394722,
      "park_narrative": "\n
\n\tBald Peak (1,629' elev.) is located where the worlds of high-tech and rural Oregon meet. Restaurants, shops, nightlife and a fast pace abound in nearby Hillsboro. Farms, wineries, fruit stands and a slower pace of life can be found in Newberg. Take a relaxing, scenic drive through the Chehalem hills from Hillsboro to Newberg. Along the way, take a break at Bald Peak State Park.\n\t\n\tThere's a nice grassy hillside perfect for a picnic (there's no drinking water at the park, though). Afterward, go for a short stroll through a Douglas fir woodland.

\n",
      "park_name": "Bald Peak State Scenic Viewpoint",
      "park_id": 77,
      "park_longitude": -123.053888
   },
   {
      "park_latitude": 43.098323,
      "park_narrative": "
\n\tBandon awaits the beachcomber, the explorer, the artist and the dreamer. Located along Bandon's Beach Loop Road, there are several locations with beach access, picnicking and unsurpassed views. Parking is ample at all locations.\n\t\n\tNo beach camping from Bandon to Floras Lake.

\n",
      "park_name": "Bandon State Natural Area",
      "park_id": 45,
      "park_longitude": -124.430483
   },
   {
      "park_latitude": 45.857362,
      "park_narrative": "
\n\tWhere the railroad once was king, the woods now reign again. A century ago, this railway made life better and easier for early Oregonians and the burgeoning lumber industry that fueled their prosperity in the northwest corner of the state. But while the trains are long gone and their tracks dismantled, the path they carved through the wilderness remains, having since been put to splendid use. The Banks-Vernonia State Trail (BVT) stands today as Oregon’s first rail-to-trail, and the space once allotted for the Industrial Age’s biggest, most propulsive machines has been handed back over to nature – and to you.

\n
\n\tThe Banks-Vernonia Trail, a multi-use trail paved over a decades-old train bed, allows the walker, jogger, biker or mounted rider the chance to catch a whiff of Oregon history while delighting in the forest’s renewed splendor. 21 miles of tree-lined, easy-grade pathway conducts you through sun-dappled glades and across swift, clear streams, filling your nose with wildflower scents and your ears with the songs of birds. 13 old bridges, wooden trestles rise up to acquaint you with days of the past. And at a mere 26 miles west of Portland, all this peaceful, quiet, natural beauty awaits you right down the road.

\n
\n\tThe Banks-Vernonia Trail can be accessed at any of 6 points along its progression – including trailheads at Manning, Buxton, Tophill, and Beaver Creek, as well as at Banks and Vernonia themselves – and permits only non-motorized use at a safe, slow speed. Precisely the opposite, ironically, of the trains that once ran there. Nature has a way of making things come full circle, a theory proved in lovely, pastoral abundance by a rail-to-trail like the BVT. Visit today and see just how much good those old railroads are still doing – for Oregon, for the forest itself and (especially) for you.

\n
\n\t 

\n",
      "park_name": "Banks-Vernonia State Trail",
      "park_id": 104,
      "park_longitude": -123.185809
   },
   {
      "park_latitude": 44.592492,
      "park_narrative": "
\n\tBates State Park was once the site of a thriving lumber mill and an adjacent company town set in a lush valley in the Blue Mountains. The mill closed in the mid-1970s. Families--and in some instances their houses--moved to nearby Prairie City and John Day. The mill buildings and town were dismantled; the land sat empty for more than 35 years.

\n
\n\tThe memory of Bates lives on in many of its community members, and the site is now a state park, thanks in large part to their efforts. When you visit or stay at the park, look for the interpretive panels that describe Bates life in the early to mid 20th century and the steps taking place now to restore the land and waterways.\n\t\n\tYou can explore Bates on the more than three miles of hiking trails. Viewpoints along the trails overlook the park, old mill pond and valley. The 131-acre park lies along the Middle Fork John Day River, Bridge Creek and Clear Creek. Check the Oregon Department Fish & Wildlife website for fishing regulations.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 28 primitive sites for tents or self-contained RVs
\n\t
\n\t\tVault toilet
\n\t
\n\t\tPotable water
\n\t
\n\t\tHiker/Biker camp with six sites and electric plug-in
\n
\n\n\tUniversal Access\n\tThree campsites are accessible to campers with disabilities.\n\t 
\n",
      "park_name": "Bates State Park",
      "park_id": 109,
      "park_longitude": -118.509841
   },
   {
      "park_latitude": 45.283702,
      "park_narrative": "
\n\t\n\t 

\n
\n\tBattle Mountain Forest State Scenic Corridor -- located on U.S. 395 nine miles north of Ukiah -- was purchased to protect the forest of ponderosa pine, larch, Douglas fir and spruce. It provides prime habitat for all kinds of wildlife. The name commemorates one of the last battles between native Americans and settlers in eastern Oregon. This confrontation took place near the park.\n\t\n\tThe park also served as a Civilian Conservation Corps camp, whose members constructed the water system, installed picnic tables and built the large granite stone fireplace still available for use in the park. The park offers a convenient place to gather for summer visitors. Spring brings with it the beauty of abundant wildflowers and wildlife. Many people enjoy the many species of birds in the park throughout the spring and summer.\n\t\n\tWhether you are traveling the highway and need a place to stretch your legs, or are looking for a place to have a family reunion or get together for a large group, be sure and consider Battle Mountain.

\n",
      "park_name": "Battle Mountain Forest State Scenic Corridor",
      "park_id": 173,
      "park_longitude": -118.967558
   },
   {
      "park_latitude": 44.381474,
      "park_narrative": "
\n\tA few miles south of Waldport and north of Yachats on the central coast, this small, exquisite destination campground is right alongside miles of broad, sandy beach that makes the park perfect for kite flying and whale watching. Every campsite is mere seconds from the beach, which makes the park perfect for watching storms and sunsets.

\n
\n\tBeachside is an excellent mid-point stop as you take a jaunt on the coast. Within 30 miles in either direction, you'll find visitor centers, tide pools, hiking and driving tours, three lighthouses, crabbing, clamming, fishing, aquarium and science centers.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 30 electrical sites with water (one vehicle per site)
\n\t
\n\t\tMore than 40 tent sites with water nearby (one vehicle per site)
\n\t
\n\t\tTwo yurts (one pet friendly)
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tHiker/biker camp
\n
\n\n\tUniversal Access\n\tTwo sites and both yurts are accessible to campers with disabilities.
\n
\n\t 

\n",
      "park_name": "Beachside State Recreation Site",
      "park_id": 84,
      "park_longitude": -124.088452
   },
   {
      "park_latitude": 45.57888,
      "park_narrative": "
\n\tSimon Benson was a lumber magnate, philanthropist, and one of the principal promoters of the Historic Columbia River Gorge Highway. Located one mile west of Multnomah Falls on I-84 at milepost 30 (eastbound access only), picnickers love this park; there's even a disc golf course and a reservable shelter for groups.

\n
\n\tTry your luck catching some of the thousands of rainbow trout stocked each month into the lake between March and October. This is a non-motorboat lake, (no boat launch) so it's perfect for rowboats and swimmers.

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Benson State Recreation Area",
      "park_id": 106,
      "park_longitude": -122.1275
   },
   {
      "park_latitude": 44.725503,
      "park_narrative": "
\n\tBeverly Beach is popular for a reason! Like magic, a well-known walkway goes under the highway and emerges to the long expanse of sandy beach extending from Yaquina Head (you can see the lighthouse from here) to the headlands of Otter Rock. When the weather cooperates, kites color the air and whip in the wind. Bring a bucket and build a sand castle! Surfers often head to the north beach, while folks looking for fossils head south.

\n
\n\tA few steps from the ocean you'll find the forest-sheltered campground. Giant, wind-sculpted trees and nurse logs surround the campsites strung along pebbly Spencer Creek. There is a Visitors Information Center located near the registration booth where you can also purchase firewood and a few souvenirs. The children's playground is located next to the program area. The day use picnic area is a grassy spot protected from summer winds. The day use also contains a yurt group meeting hall. It's hard to believe all this is a few minutes drive from the Oregon Coast Aquarium, Yaquina Head and other prime attractions.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 53 full hook up sites (27 of them have cable TV)
\n\t
\n\t\tApproximately 75 electrical sites with water (first come, first served October through March 14th)
\n\t
\n\t\tMore than 125 tent sites with water nearby
\n\t
\n\t\t21 yurts (two pet-friendly yurts)
\n\t
\n\t\tThree seasonal group tent camping areas
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRV dump station
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tYurt meeting hall
\n
\n\n\tUniversal Access\n\tThree campsites and six yurts are accessible to campers with disabilities.
\n",
      "park_name": "Beverly Beach State Park",
      "park_id": 164,
      "park_longitude": -124.058355
   },
   {
      "park_latitude": 45.434444,
      "park_narrative": "

Blue Mountain Forest State Scenic Corridor lies along the Old Oregon Trail Highway between Deadman's Pass and Spring Creek. The corridor protects one of the few examples of mature evergreen forests on I-84 between Ogden, Utah and The Dalles, Oregon.

Composed of intermittent stands of old-growth ponderosa pine, western larch, Engelmann spruce, lodgepole pine and grand fir, this corridor contains undisturbed examples of the native plants and animals. White- tailed deer, mule deer, Rocky Mountain elk, cougar and other wildlife inhabit the corridor. Spring explodes in a multi-hued kaleidoscope of flowers. The fall frost ends the season in a final flurry of color.

Take a break from the freeway and enjoy nature's beauty as you pass through this section of the Blue Mountains.",
      "park_name": "Blue Mountain Forest State Scenic Corridor",
      "park_id": 172,
      "park_longitude": -118.3925
   },
   {
      "park_latitude": 45.202309,
      "park_narrative": "
\n\tThis park is located in Pacific City and provides beach access, parking and restrooms. It's a nice place to go for a walk on the beach and explore the Nestucca sand spit. The Nestucca River is legendary for 50 pound Chinook salmon.

\n",
      "park_name": "Bob Straub State Park",
      "park_id": 133,
      "park_longitude": -123.965722
   },
   {
      "park_latitude": 44.827849,
      "park_narrative": "
\n\tA miraculous and rugged, basalt-rimmed bay, Boiler Bay is a great place to watch wild surf action on the rocky spurs. This splendid panoramic viewpoint presents a good opportunity to see gray whales year round. Take your binoculars -- this is one of the best sites in Oregon to see ocean-going birds (like shearwaters, jaegers, albatrosses, grebes, pelicans, loons, oystercatchers and murrelets). In 1910, an explosion sank the J. Marhoffer, and you can see the ship's boiler at low-tide.

\n",
      "park_name": "Boiler Bay State Scenic Viewpoint",
      "park_id": 153,
      "park_longitude": -124.066053
   },
   {
      "park_latitude": 43.712156,
      "park_narrative": "\n\n
\n\tThis park is a quiet place with a hiking trail that extends half way around the island. The shoreline along the Umpqua River side of the park has been home to hundreds of Double Crested Cormorants since 1988.  The birds nest close together, each pair building a platform of sticks in the trees.  Such rookeries are usually too remote for easy viewing, which makes Bolon Island Day Use area so unique! The trail also provides a nice view of the Umpqua River.

\n",
      "park_name": "Bolon Island Tideways State Scenic Corridor",
      "park_id": 80,
      "park_longitude": -124.099956
   },
   {
      "park_latitude": 45.350718,
      "park_narrative": "
\n\tIf you want to get off the beaten path, Bonnie Lure State Park along Eagle Creek provides a refreshing getaway. You may catch a rare glimpse of a pileated woodpecker or hook an elusive steelhead trout (otherwise known as a silver-sided freight train) on its way back to the hatchery. It could easily become your favorite day-trip destination.

\n
\n\tPlease note:  The correct location for entry to Bonnie Lure State Recreation Area is off Dowty Road, south of Eagle Creek.  Google has been contacted to correct the map.

\n",
      "park_name": "Bonnie Lure State Recreation Area",
      "park_id": 100,
      "park_longitude": -122.376587
   },
   {
      "park_latitude": 42.196117,
      "park_narrative": "\n\n
\n\tPicnic under a stand of old-growth ponderosa pine. You'll find all the conveniences: picnic tables, drinking water and modern restrooms. The mixed forest which borders the highway (through an area the locals call Drews Gap), is especially colorful in the fall thanks to stands of quaking aspen.\n\t\n\tKeep a watchful eye out for abundant wildlife -- mule deer, coyote and cougar drop by every once in a while.

\n",
      "park_name": "Booth State Scenic Corridor",
      "park_id": 37,
      "park_longitude": -120.591162
   },
   {
      "park_latitude": 46.170146,
      "park_narrative": "
\n\tThis park was one of the first parcels donated as park land to the Oregon Highway Commission in 1922. One of the few rest stops along Highway 30, you'll find a restroom, monument, and a wondrous Douglas fir forest overlooking the Columbia River.

\n
\n\t 

\n",
      "park_name": "Bradley State Scenic Viewpoint",
      "park_id": 127,
      "park_longitude": -123.435878
   },
   {
      "park_latitude": 44.518611,
      "park_narrative": "
\n\tBrian Booth State Park, also known as Ona Beach, was renamed by the Oregon State Parks and Recreation Commission in 2013 to honor the first chairperson of the original commission (1990-97). The park is a fine, forested ocean flat now developed for extensive daytime shore use. Easy access for beachcombing and great for large picnic gatherings.

\n
\n\tFrom the boat ramp on the east side of the highway, take a kayak tour up to the Beaver Creek wetland.

\n",
      "park_name": "Brian Booth State Park",
      "park_id": 146,
      "park_longitude": -124.071388
   },
   {
      "park_latitude": 44.514726,
      "park_narrative": "
\n\tOur welcome center is located 1 mile east of Ona Beach and Highway 101, where visitors can enjoy a relaxing walk, picnic, or take in the fantastic views of the marsh from the observation deck. The welcome center is open 7 days a week from 12:00 PM - 4:00 PM. Hours change to 10:00 AM - 4:00 PM during the months of June, July and August.

\n
\n\tThe upland trail area boasts over 5 miles of easy-to-moderate hiking trails and can be accessed by driving a mile down South Beaver Creek Road, or by crossing the seasonal Beaver Marsh trail.

\n
\n\tBeaver Creek is the perfect place to bring your canoe or kayak. Don't have a kayak? Guided kayak tours on Beaver Creek are offered seasonally, where kayaks, life preservers, and paddles are provided. Folks who register for the activity will launch from nearby Ona Beach and spend over two hours exploring the fascinating Beaver Creek area with park guides. Tours run from July through Labor Day weekend, and are offered 5 days a week (no tours on Tuesdays or Wednesdays). Please note: This year tours will begin at the Beaver Creek Welcome Center. For more information or to make a reservation, please call: (541) 563-6413 or visit the welcome center during normal business hours. Reservations are accepted beginning June 1, please call between 10 AM - 4 PM.

\n",
      "park_name": "Brian Booth State Park (Beaver Creek)",
      "park_id": 191,
      "park_longitude": -124.049162
   },
   {
      "park_latitude": 45.559167,
      "park_narrative": "
\n\tBridal Veil Falls State Park is located near milepost 28 on the Historic Columbia River Scenic Highway and is accessed off I-84 at Exit 28.

\n
\n\tTravel west on the Historic Columbia River Highway about 3/4 of a mile to the entrance of Bridal Veil Falls State Park. The park offers a nice parking area, picnic tables and restrooms all within easy walking distance from the parking area. Nice grassy areas afford visitors a chance to stretch a blanket in one of the laziest parts of the Columbia River Gorge

\n
\n\t\n\tThe park is situated in large timber stands; the area was a natural choice as a logging haven once upon a time. The park features two different trails: an upper walking/interpretive trail and a lower hiking trail to the falls (120' tall). Both are not to be missed

\n
\n\tThe upper trail takes visitors around the precipice of the cliffs of the Gorge. Sign boards along the trail point out distinctive native wild plants that grow abundantly in this area such as camas, lupine, bead lilly, trillium and bleeding heart. The trail is fenced beautifully with logged beams and wire to protect visitors along the viewpoint while maximizing every vantage point of the magnificent view of the Gorge. The famous geologic edifice known as the Pillars of Hercules, a 120-foot basalt tower once used as a training site for mountain climbing, can be seen best from the upper trail at Bridal Veil.

\n
\n\t\n\tThe lower trail at Bridal Veil takes the visitor downhill to the base of Bridal Veil Falls and is about a mile round trip to the falls and back. Although short, this is a steep little trail full of switchbacks and is not wheelchair accessible. Along the way are a few unwanted wild plants of this area -- such as poison oak -- so keep on the path. Do not attempt to walk along the bridge over the Historic Highway to view the falls. The road here is a narrow two-lane passage with absolutely no sidewalk. PLEASE view the falls from the trail.

\n
\n\t\n\tBeautiful Bridal Veil Falls is an elegant and graceful lady that can be fully appreciated from the deck of a viewing platform rebuilt in 1996. The creek hustles down from the top of nearby Larch Mountain, tumbles over the cliff and eventually flows into the mighty Columbia River. No visit to the Columbia Gorge should be considered complete without a tour of the area of Bridal Veil and a visit to Bridal Veil Falls State Park.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Bridal Veil Falls State Scenic Viewpoint",
      "park_id": 107,
      "park_longitude": -122.174167
   },
   {
      "park_latitude": 43.151951,
      "park_narrative": "
\n\tBullards Beach is a large, family-oriented park located just two miles north of Bandon. The campground is nestled among shore pines and well protected from the strong ocean breezes. Besides three loops of campsites, the park boasts 13 yurts, making year-round camping a very popular choice.

\n
\n\tThe horse camp features easy access to the beach and dunes for our equestrian campers. Well known for excellent fishing and crabbing opportunities on the Coquille River, our boat launch facilities are well-used during the summer and fall seasons.

\n
\n\tFrom the registration booth in the campground, take a walk or bike ride on the mostly paved pathway to the beach (a little more than a mile). The path weaves through the open, grassy fields and lowland forest across a plain to the sandy dunes. All along the path are views of the beautiful Coquille River. Across the river is Bandon Marsh National Wildlife Refuge, sporting a variety of resident and migrating wildlife. Be sure to bring your binoculars!\n\t\n\tThe historic Coquille River Lighthouse is located at the end of the beach access road in the park. It's staffed from mid-May through mid-October with park volunteers who interpret the history of the area. From this point, there are 4.5 miles of open beach to explore. Bring your mountain bike to ride along the hard-packed sand along the edge of the surf, or just enjoy a leisurely stroll along the ocean shore.\n\tAnd there's more nearby. Across the river is Bandon by the Sea. Visit a variety of shops, galleries, and restaurants in the town that is called "The Cranberry Capitol of the World," as well as the "The Storm Watching Capitol of the World." Learn the legend of Face Rock and access miles of shoreline at our day-use state parks on Beach Loop Drive. For more information on the local area, visit the Tourist Information Center in Old Town.\n\t\n\tCoquille River Lighthouse \n\tHours are 11 a.m. to 5 p.m. daily from mid-May through mid-October. If you would like to go into the lantern room (up the tower) please bring closed-toe-shoes. Call the park office at 541-347-2209 for current information.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 100 full-hookup sites
\n\t
\n\t\tMore than 82 electrical sites with water
\n\t
\n\t\t13 yurts (three pet-friendly as of 12/1/2014)
\n\t
\n\t\tHorse camp with eight primitive sites
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tYurt meeting hall
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tSix campsites and three yurts are accessible to campers with disabilities.
\n",
      "park_name": "Bullards Beach State Park",
      "park_id": 50,
      "park_longitude": -124.395277
   },
   {
      "park_latitude": 43.306782,
      "park_narrative": "
\n\tCape Arago may be the end of the road (the road out of Coos Bay goes no further), but it's really only the beginning if you want to explore the southern Oregon coast.\n\t\n\tLocated at the end of Cape Arago Highway about 15 miles southwest of Coos Bay, Cape Arago is a scenic headland jutting into the Pacific Ocean. Long used by native Americans, Cape Arago was first sighted by Europeans during one of Sir Francis Drake's expeditions in the late 1500s. Modern visitors can scan the horizon for migrating whales and other marine mammals, as well as fishing boats and ships entering and leaving nearby Coos Bay.\n\t\n\tThe south cove trail leads down to a sandy beach and superior tidepools where you can visit intertidal plants and animals (but please enjoy them with your eyes only). The north cove trail provides access for fishing, beachcombing, and viewing the off-shore colonies of seals and sea lions at Shell Island -- a designated National Wildlife Refuge. The trail is closed March 1- June 30 to protect seal pups. Picnic tables, restrooms and a gazebo shelter are available for daytime use.

\n",
      "park_name": "Cape Arago State Park",
      "park_id": 66,
      "park_longitude": -124.397894
   },
   {
      "park_latitude": 42.83576,
      "park_narrative": "
\n\tUse our extra-large, private, sheltered campsites as your base of operations while you enjoy the Cape Blanco lighthouse and historic Hughes House tours.\n\t\n\tThe lighthouse and historic home are open from April to October. The lighthouse tour, managed by the Bureau of Land Management, costs $2/adult (16 and older), free for youth 15 and under. The Hughes House tour is conducted by knowledgeable volunteers and is free, but donations are gratefully accepted and help fund restoration and maintenance of the house.\n\t\n\tLighthouse Tours\n\tApril-Oct. 31, Wednesday - Monday, 10 a.m. - 3:30 p.m. Last tour ticket sold at 3:15 p.m. Gates close at 3:30 p.m. (Closed Tuesdays)\n\tHughes House Tours\n\tApril-Oct. 31, Wednesday-Monday, 10 a.m. - 3:30 p.m. (Closed Tuesdays)

\n
\n\tCape Blanco Heritage Society\n\t\n\tCape Blanco is the most southern of Oregon's lighthouses, and is the westernmost point in Oregon. Proposed in 1864, it was the first lighthouse in the state outfitted with a first-order Fresnel lens in 1870.\n\t\n\tThe first-order lens was replaced with a second-order lens in 1936.\n\t\n\tWork off your picnic lunch by hiking over eight miles of trails with many spectacular ocean vistas, woodland and wetland settings. Bring your horse and enjoy 7 miles of horse trails and the facilities in our horse camp. The group camp holds a maximum of 50 people, and can accommodate up to 24 vehicles. This total may include five or more self-contained RVs. If you expect to have more than five RVs or 24 total vehicles, call the park 541-332-2973. The group camp has four fire rings, four picnic tables, four water spigots and vault toilets. Showers are located in main campground 1/4 mi. away.\n\t\n\tNo matter how you camp with us, don't forget a sunset walk along the headland beaches to finish out your day.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 50 electrical sites with water
\n\t
\n\t\tFour standard cabins (one pet friendly)
\n\t
\n\t\tHorse camp with eight primitive sites
\n\t
\n\t\tReservable group camp
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tFlush toilets and hot showers
\n
\n\n\tUniversal Access\n\t7 sites and 1 cabin are accessible to campers with disabilities.
\n",
      "park_name": "Cape Blanco State Park",
      "park_id": 44,
      "park_longitude": -124.560783
   },
   {
      "park_latitude": 45.21559,
      "park_narrative": "
\n\tCape Kiwanda is part of the Three Capes Scenic Route (along with Cape Meares and Cape Lookout). Kiwanda is the smallest of the three, but it is one of the best places to experience spectacular wave action. Pacific City is the home of the Pacific Dory Fleet. South of Cape Kiwanda is the dory boat launching area. North of Cape Kiwanda to Tierra Del Mar is a stretch of beach popular with picnickers. Kiwanda provides great hang gliding and kite flying opportunities.

\n",
      "park_name": "Cape Kiwanda State Natural Area",
      "park_id": 130,
      "park_longitude": -123.9697
   },
   {
      "park_latitude": 45.36682,
      "park_narrative": "
\n\tCape Lookout State Park can be reached by traveling an hour and a half west of Portland through the scenic Wilson River pass. Along the way stop and enjoy waterfalls, scenic views and some great fishing.\n\t\n\tA popular campground and day-use area, Cape Lookout is located on a sand spit between Netarts Bay and the ocean, giving you a terrific view of the ocean with easy access to the beach. Beachcombing is popular here, and the park is reputedly a good place to find glass floats. More than eight miles of hiking and walking trails wind through a lush old-growth forest. The Cape Lookout trail follows the headland for more than two miles. A bench is located at the end of the trail. Enjoy the view! You might see a whale or two along with other wildlife.\n\t\n\tOne walking trail -- the nature trail -- is perfect for a shorter jaunt. The nature trail gives you a close-up view of native trees and other plants. Numbered markers are keyed to a trail guide. The beach which runs for more than three miles from the base of Cape Lookout to the end of the Netarts sand spit provides another great option for walking at Cape Lookout. Be sure to be aware of incoming tides, as some areas of the beach will completely disappear during high tide.\n\t\n\tBe sure to look up when you visit this park ... hang gliders and paragliders fill the air with colorful wings as they catch thermals and rise to dizzying heights. Along with Cape Kiwanda and Cape Meares, Lookout is part of the Three Capes Scenic Route.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 35 full-hookup sites
\n\t
\n\t\tMore than 170 tent sites with water nearby
\n\t
\n\t\tOne electrical site with water
\n\t
\n\t\t13 yurts (one pet-friendly)
\n\t
\n\t\tSix deluxe cabins (one pet-friendly)
\n\t
\n\t\tTwo group tent camping areas
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tMeeting hall
\n\t
\n\t\tHot showers & flush toilets
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tRV dump station (closed in winter)
\n
\n\n\tUniversal Access
\n\n\tTwo campsites and one cabin are accessible to campers with disabilities. Nine yurts and one cabin  have ramp access, but are not ADA-compliant.
\n",
      "park_name": "Cape Lookout State Park",
      "park_id": 134,
      "park_longitude": -123.962148
   },
   {
      "park_latitude": 45.469878,
      "park_narrative": "
\n\tA must-see when driving the Three Capes Scenic route, Cape Meares State Scenic Viewpoint is situated on a headland over 200 feet above the ocean. Cape Lookout and Cape Kiwanda are the other two capes on this route. Cape Meares provides an excellent view of the largest colony of nesting common murres. The site is one of the most populous colonies of nesting sea birds on the continent. Bald eagles are frequently seen in this area, and peregrine falcons have also been known to nest near here.\n\t\n\tThe park features tours of an 1890s lighthouse, the Sallie Jacobson Interpretive Kiosk, and interpretive panels at key viewpoints.  Cape Meares has over three miles of hiking trails and a mile-long walking trail that winds through old-growth spruce trees, including the uniquely-shaped "Octopus Tree". A short quarter mile hike from a turn-off at the park entrance will bring you to the largest Sitka spruce tree in the state of Oregon. In winter and spring, this park is an excellent location for viewing whale migrations. During the summer, resident whales can be seen from Cape Meares along with seals and sea lions that are often seen and heard.\n\t\n\tCape Meares Lighthouse\n\tThe inside of the lighthouse is open Starting in April from 11:00 a.m. - 4:00 p.m.  For the month of April the lighthouse will be open to the public on Thursdays through Sundays only. During the summer months the lighthouse is open 7 days a week. Days may be reduced in the fall before closing in October depending on staffing. Admission is free. The base of the lighthouse tower, including a small gift shop, is fully open during these hours. The lighthouse tower is also open for tours, no backpacks, or children being carried are allowed up the tower for the safety of visitors and the tower.

\n",
      "park_name": "Cape Meares State Scenic Viewpoint",
      "park_id": 131,
      "park_longitude": -123.968901
   },
   {
      "park_latitude": 42.357743,
      "park_narrative": "
\n\tCape Sebastian ... the very name invokes images of early Spanish explorers and long journeys.  The cape was named in honor of Saint Sebastian in 1603 by the Spanish navigator Sebastian Vizcaino.  The most striking feature of this park is the panoramic view, both parking lots are over 200 feet above sea level.  At the south parking vista, you can see up to 43 miles to the north with Humbug Mountain filling the view.  Looking south, you can see nearly 50 miles toward Crescent City, California and Point St. George Lighthouse.

\n
\n\tA deep forest of Sitka spruce covers most of the park and a 1.5 mile walking trail takes you out to the lower levels of the cape.  If you're lucky, the trail will give you a chance to enjoy awe-inspiring views of the gray whales on their bi-annual migrations.

\n",
      "park_name": "Cape Sebastian State Scenic Corridor",
      "park_id": 52,
      "park_longitude": -124.41271
   },
   {
      "park_latitude": 44.160252,
      "park_narrative": "
\n\tWashburne is located on the east side of Highway 101 with a buffer of native plants and trees between you and the highway. The campsites are spacious and are available on a first come first served basis except for the two yurts which are reservable. There are several trails of varying difficulty leading from the campsites to the beach, wildlife viewing areas, and second-growth forests.\n\t\n\tA walking trail leads you under the highway to a five-mile sandy beach and a day-use area, where you'll find space to watch whales, hunt agates, beachcomb, and picnic. Another trail connects you to the Heceta Head trail, which you can use to reach the historic Heceta Head lighthouse.\n\t\n\tIn the campground at night, you can hear the pounding surf. There is a creek running through the campground, and elk have been known to wander through. Wild rhododendrons bloom in spring.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 50 full-hookup sites
\n\t
\n\t\tMore than five electrical sites (with water)
\n\t
\n\t\tSeven walk-in tent sites (closes seasonally October - April)
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tTwo yurts
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRV dump station in day-use area
\n\t
\n\t\tFirewood for sale
\n
\n\n\tUniversal Access\n\tSite #30 is accessible to campers with disabilities.
\n",
      "park_name": "Carl G. Washburne Memorial State Park",
      "park_id": 85,
      "park_longitude": -124.115074
   },
   {
      "park_latitude": 44.39731,
      "park_narrative": "
\n\tThe first thing that strikes you when you arrive at Cascadia is the tranquility. While the park is quite large, there are barely two dozen first-come first-served campsites, making this a great spot for an intimate getaway. The campground, group tent sites and east picnic area are open May 1-September 30. The west picnic area is open year-round.\n\t\n\tA pair of hiking trails give you a chance to explore the area. A three-quarter mile trail leads to the spectacular Soda Creek Falls. A newer trail ushers you through historic Douglas-fir trees along the South Santiam River (a good place to fish and swim). Ruts from the historic Santiam Wagon Road are visible in the park (the trail was used as a military route in the 1800s).

\n
\n\tCampground info

\n
\n\t
\n\t\t25 tent sites with water nearby (maximum site length 35 feet)
\n\t
\n\t\tTwo reservable group tent areas
\n\t
\n\t\tTwo reservable group picnic areas with covered kitchen shelters and electricity
\n\t
\n\t\tLarge open play meadow
\n\t
\n\t\tOff-leash area for pets
\n
\n",
      "park_name": "Cascadia State Park",
      "park_id": 150,
      "park_longitude": -122.481099
   },
   {
      "park_latitude": 42.659722,
      "park_narrative": "
\n\tPicture yourself reeling in a salmon, steelhead or trout at Casey State Park. Cradled in the arms of the wild and scenic Rogue River, bring your family and have a picnic on the lush, tree-ringed lawns or raft down the river. Casey Park is a relaxing and fun spot for everyone to enjoy. No drinking water at this site.

\n",
      "park_name": "Casey State Recreation Site",
      "park_id": 21,
      "park_longitude": -122.701944
   },
   {
      "park_latitude": 45.152676,
      "park_narrative": "
\n\tTranquil, crystal-clear waters and towering ponderosa pines frame the landscape at Catherine Creek State Park. Cradled in a canyon created by the creek, the park provides visitors a cool, quiet and peaceful setting for outdoor activities. Camp in the campground next to Catherine Creek and enjoy the thrill of landing a rainbow trout or simply cool your heels in its icy waters.\n\t\n\tBring your friends or family and enjoy a day in our picnic area: play a game of horseshoes, take a leisurely hike along the trail between the campground and picnic area for views of picturesque canyon scenery, or simply kick back under a tree and enjoy the summer breeze through the pines.\n\t\n\tWhile staying at the park, explore nearby attractions such as the Union County Museum in the town of Union, take a drive to Eagle Creek to do some fishing or visit any of the many pioneer graveyards. Drive to the Oregon Trail Interpretive Center near Baker City, or head east to the Hells Canyon National Recreation Area and the Wallowa-Whitman National Forest. The towns of Union and La Grande offer visitors full-service shopping, restaurants, community events and emergency services. Whether you are looking for a quiet, out-of-the-way location to spend a night or a week, Catherine Creek State Park can accommodate you.

\n
\n\tCampground info

\n
\n\t
\n\t\t20 primitive sites with water nearby
\n\t
\n\t\tParking at all sites (can accommodate self-contained RVs)
\n\t
\n\t\tRestrooms with flush toilets
\n\t
\n\t\t2 picnic areas
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tHorseshoe pits
\n\t
\n\t\t3-mile hiking trail
\n
\n\n\tUniversal access\n\tOne campsite accessible for campers with disabilities.\n\t 
\n",
      "park_name": "Catherine Creek State Park",
      "park_id": 11,
      "park_longitude": -117.743438
   },
   {
      "park_latitude": 45.248159,
      "park_narrative": "
\n\tChampoeg features a unique combination of history, nature, and recreation. This is the site where Oregon's first provisional government was formed by a historical vote in 1843.  Situated on the south bank of the scenic Willamette River, Champoeg's acres of forest, fields, and wetlands recreate the landscape of a bygone era. Tour the park's visitor center, Newell House, and Pioneer Mothers Log Cabin museums to discover pioneer life at Champoeg. Take a guided walk to learn what happened to the bustling pioneer town of Champoeg, and how the Donald Manson Barn was built. An 1860s-style garden lies next to the visitor center.\n\t\n\tThe park also includes the Historic Butteville Store founded in 1863. It is considered the oldest operating store in Oregon. The store is the last commercial vestige of the once thriving Willamette River community of Butteville. The store will open for the season on June 5th and will close for the season August 30th, 2015.  Hours will be Friday through Sunday from 10:30 AM - 6:00 PM.  The store will be closed Monday through Thursday.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately eight full-hookup sites
\n\t
\n\t\tMore than 67 electric sites with water
\n\t
\n\t\tSix walk-in tent sites
\n\t
\n\t\tSix yurts (three pet friendly)
\n\t
\n\t\tSix cabins (three pet friendly)
\n\t
\n\t\tThree group tent camping areas
\n\t
\n\t\tRV group camping loop with meeting hall
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRV dump station
\n\t
\n\t\tFirewood and ice sales
\n
\n\n\tUniversal Access\n\tAll of the cabins, one yurt, five campsites and one walk-in tent site are accessible to campers with disabilities.
\n",
      "park_name": "Champoeg State Heritage Area",
      "park_id": 79,
      "park_longitude": -122.894285
   },
   {
      "park_latitude": 42.4101,
      "park_narrative": "\n\n
\n\tTake a break from the open road and pull into this uncharacteristically wooded area. Have a spot of lunch alongside a cool stream or rest in the shade of large ponderosa pine. The park has picnic tables, drinking water, flush toilets, and access to Crooked Creek, home to rainbow trout and crayfish.

\n",
      "park_name": "Chandler State Wayside",
      "park_id": 38,
      "park_longitude": -120.2905
   },
   {
      "park_latitude": 45.273055,
      "park_narrative": "
\n\tThe Clay Myers State Natural Area at Whalen Island is a remarkable place. A virtually untouched coastal estuarine ecosystem, it is bounded by the Sand Creek estuary. This is critically valuable habitat for adult salmon moving upstream to spawn and for smolt leaving the inland fresh waters for their marine journey. The area is a ecological potpourri, including mixed woodlands, grasslands, fresh and saltwater wetlands (the Lillian Parker Craft Wetland) and a rare native dune sedgeland. Species run the gamut from salmon and steelhead to shorebirds to deer, otter, and even bear and cougar.

\n
\n\t\n\tNamed after Clay Myers (Oregon Secretary of State 1967-77 and State Treasurer 1977-84), the site joined Oregon's park system in 2000, thanks to a $2.8 million dollar partnership between the Oregon Parks and Recreation Department (OPRD), Oregon Watershed Enhancement Board, Federal Highway Administration, National Park Service, Tillamook County Board of Commissioners, and the Trust for Public Lands. For the first time, OPRD relied on the state lottery-backed Parks & Natural Resource Fund to pay for a major addition to the state park system. The site was purchased from sisters Kathleen Craft Shaw and Karen Derungs, who worked with the Trust for Public Lands to assure permanent protection of the area in honor of their mother Lillian Parker Craft.\n\t 

\n",
      "park_name": "Clay Myers State Natural Area at Whalen Island",
      "park_id": 168,
      "park_longitude": -123.948611
   },
   {
      "park_latitude": 44.273114,
      "park_narrative": "
\n\tOn the banks of the Deschutes River lies a quaint rest area that provides plenty of shade for picnickers. An ideal place to stop for a break, lunch or simply to relax in the warm sun. The park provides fishing access to the river.

\n",
      "park_name": "Cline Falls State Scenic Viewpoint",
      "park_id": 30,
      "park_longitude": -121.257421
   },
   {
      "park_latitude": 44.41645951443,
      "park_narrative": "
\n\tThink of Clyde Holliday State Recreation Site as an oasis. Its tall, willowy cottonwood trees provide shade and serenity. Each campsite is clothed with a variety of trees and other plants to give you that private, secluded feeling. The park borders the beautiful John Day River and is surrounded on all sides by some of Oregon's most pristine wilderness areas. You're as likely to have wildlife neighbors as human ones: the majestic Rocky Mountain elk and mule deer are frequent visitors. You can experience the thrill of seeing steelhead rush upriver to spawn. The park lies in the shadow of the Strawberry Mountain Range just a short drive away.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 30 electrical sites with water(first come, first serve basis - no reservations for campsites)
\n\t
\n\t\t2 reservable tepees (open mid-April through late September)
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tFirewood and ice sales
\n\t
\n\t\tRV dump station
\n\t
\n\t\tHorseshoe pits
\n\t
\n\t\tOutdoor amphitheater with interpretive programs in summer
\n
\n
\n\t*Note for teepee campers with reservations* If you will be arriving after 9:00 p.m., please do not disturb the Campground Host.  The teepee will be unlocked and the key will be inside.

\n
\n\t 

\n",
      "park_name": "Clyde Holliday State Recreation Site",
      "park_id": 8,
      "park_longitude": -119.0880042314
   },
   {
      "park_latitude": 42.646223,
      "park_narrative": "
\n\tCollier Memorial State Park features a campground; outdoor museum of historic logging equipment; relocated pioneer village; and a new four-corral, primitive horse camp and trailhead. At the state's finest logging museum, you'll see rare and antique logging equipment dating to the 1880s, as well as more recent pieces.

\n
\n\tRailroad buffs will enjoy learning about the role the railroad played in logging. You can imagine the rugged woodsmen and the immense task of moving raw timber with innovation and brute force. The pioneer village gives you another insight into how these families once lived.\n\t\n\tThe Williamson River and crystal-clear Spring Creek converge in the park. The Williamson River is regionally famous for its quality trout fishery and consistently produces trophy fish. Spring Creek gushes dramatically out of a nearby spring, and then paints a picture-perfect scene as it flows through the park.\n\t\n\tIn the summer, movies about old-time logging and other topics are shown at 9 p.m. every Friday, Saturday, and Sunday. The series continues right through Labor Day. During the day, the park naturalist schedules short hikes along the Williamson River. Check the park when you arrive for a list of times.\n\t\n\tFrom the equestrian trailhead, you can ride north from the park across national forest land to the Jackson F. Kimball State Recreation Site and beyond.\n\t\n\tWhether you come for the day to visit the logging museum, the pioneer village, or play along Spring Creek or even camp amongst the pines along the Williamson River - you'll discover a grand adventure at Collier.

\n
\n\tCampground info

\n
\n\tA Loop (first-come, first-served)

\n
\n\t
\n\t\tMore than 10 full-hookup sites
\n\t
\n\t\tMore than 15 tent sites with water nearby
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tLaundry facilities
\n
\n
\n\tB Loop (reservable)

\n
\n\t
\n\t\tApproximately 40 full-hookup sites
\n
\n\n\tUniversal Access\n\tCampsite A30 is accessible to campers with disabilities.
\n",
      "park_name": "Collier Memorial State Park",
      "park_id": 165,
      "park_longitude": -121.879573
   },
   {
      "park_latitude": 42.955555,
      "park_narrative": "
\n\tCoquille Myrtle Grove will bring out the Huckleberry Finn in you. Located along the Powers Highway, this secluded swimming hole has a shaded myrtlewood grove near the parking area and a sandy beach along the Coquille River just a short way down the hill. Bring your innertube and float along with the river's gentle current. No drinking water at site.

\n",
      "park_name": "Coquille Myrtle Grove State Natural Site",
      "park_id": 46,
      "park_longitude": -124.10555
   },
   {
      "park_latitude": 45.478371,
      "park_narrative": "
\n\tCottonwood Canyon State Park is rugged and vast, from the vertical cliffs carved by the John Day River to deep side canyons and arid, rocky grasslands that extend for miles in all directions. The park’s 8,000-plus acres are open for exploring, stargazing and contemplating the elemental forces that carved this unique landscape.

\n
\n\tThe Pinnacles Trail and the Lost Corral Trail, each 4.3 miles one way, follow either side of the John Day River downstream. The Lost Corral Trail, leaving from JS Burres, is open to both hikers, bikers and equestrians. The Pinnacles Trail, leaving from the end of the campground, is open to bikers and hikers.

\n
\n\tUpstream, the Hard Stone Trail travels 1.5 miles one way and open to foot traffic only. Or, you can strike out on your own along old, unmaintained ranching roads that lead into the back country. The J.S. Burres day-use area is a popular boat launch for rafts, kayaks, canoes and drift boats.

\n
\n\tIf you’re an angler, the John Day River has steelhead, catfish, carp and smallmouth bass. As an added bonus, there’s another 10,000 acres of public land surrounding the park managed by the U.S. Bureau of Land Management.

\n
\n\tWhether you come to Cottonwood Canyon for hiking, camping, boating, horseback riding, fishing or hunting, consider a few basic steps to stay safe. Carry plenty of water; potable water is available only at the developed day-use area and in the campground. Have a plan for your day, and tell someone about it. The park doesn’t have cell phone coverage anywhere, so you can’t rely on your phone in an emergency. Take a look at Frequently Asked Questions for more park information.

\n\n\tDriving directions: The park is located on Highway 206 between Condon and Wasco. Because the park is new, online mapping services may not show the park name or location. On the left of this page you’ll see a Driving Directions link that takes you to Google Maps. When you’re on the map page, you’ll see a green pin that represents the latitude and longitude coordinates for the park entrance road. Enter your location to see driving directions to the main park entrance.
\n
\n\tLone Tree Campground info:

\n
\n\t
\n\t\t21 primitive sites for tents and self-contained RV's (max site size is 75 feet). Available first-come, first-served.
\n\t
\n\t\tGroup tent camp for up to 25 people.
\n\t
\n\t\tPotable water.
\n\t
\n\t\tVault toilets.
\n\t
\n\t\tHiker/Biker camp with 7 sites.
\n
\n
\n\t 

\n",
      "park_name": "Cottonwood Canyon State Park",
      "park_id": 195,
      "park_longitude": -120.47233
   },
   {
      "park_latitude": 42.004587,
      "park_narrative": "
\n\tPerched between the California border and the Winchuck River, this 40-acre park features a sandy beach, wetlands, and a small stand of mature trees.  It's also home to a new 4,500 sq. ft. Welcome Center that displays Oregon's finest virtues:  effective green technology, a warm welcome for traveler's, plus service and beach access to thousands of area residents from Gold Beach, OR  to Crescent City, CA.   Solar panels send power - as much as 20,000 kilowatt hours per year - back to Coos-Curry Electric Co-op as well as heating the water.  The Earth itself warms the building in the winter and cools it in the summer.  Water and lights are precisely timed to provide for needed services with minimal waste.

\n",
      "park_name": "Crissey Field State Recreation Site",
      "park_id": 53,
      "park_longitude": -124.210162
   },
   {
      "park_latitude": 45.537843,
      "park_narrative": "
\n\t                                                            Vista House Current Hours

\n
\n\t                                      Open 7 days a week 9 am - 6 pm, weather permitting

\n
\n\tMillions of visitors driving from Portland through the Columbia River Gorge don't realize the full impact of its beauty until they come around the bend near Corbett at exit 22 and see the famous building on the top of the cliff to the right. This is Crown Point and the building is the Vista House.

\n
\n\tThe Vista House was built in 1916 at the same time as Highway 30 (what is now the Historic Columbia River Gorge Highway, and the only way to reach Crown Point). The building was designed to be a place of refreshment and enjoyment of the Columbia Gorge.\n\tThe octagonal building with its green ceramic tile roof houses a museum, gift shop and interpretive display of historic and geologic points of interest in the Gorge.

\n
\n\tFriends of Vista House

\n
\n\tLink to Vista House's weather station here

\n
\n\tVista House Current Hours

\n
\n\t Vista House is open 7 days a week 9 am - 6 pm, weather permitting.

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n
\n\t 

\n",
      "park_name": "Crown Point State Scenic Corridor",
      "park_id": 108,
      "park_longitude": -122.246813
   },
   {
      "park_latitude": 44.966973,
      "park_narrative": "
\n\tBilled as the shortest river in the world, D River flows a mere 120 feet from Devils Lake into the roaring ocean. The park is directly west of Highway 101, smack dab in the heart of Lincoln City. Paved parking, flush restrooms and easy access to a busy -- and reliably windy -- beach makes D River Wayside home to a pair of the world's largest kite festivals each June and October.  These festivals and beautiful, windswept beaches have made Lincoln City the self-proclaimed "Kite Capital of the World."

\n
\n\tLincoln City is home to Finders Keepers. From mid-October to Memorial Day hand-crafted glass floats are placed along the 7-1/2 miles (12 km) of public beach in Lincoln City from the Roads End area to Siletz Bay. The number of floats placed reflect the year – so, 2015 floats crafted and placed for the year 2015 and so on. D River is a very popular location to hunt . . . and discover . . . your very own glass float. Remember - you find it, you keep it!

\n
\n\tClick the events tab above left for more information about the next kite festival. Visit www.oregoncoast.org for information about kites, glass floats and other activities in Lincoln City.

\n",
      "park_name": "D River State Recreation Site",
      "park_id": 154,
      "park_longitude": -124.017147
   },
   {
      "park_latitude": 45.517659,
      "park_narrative": "
\n\tDabney State Park offers 138 acres of active and passive recreation on the outskirts of the Portland metropolitan area, and has been a popular swimming and picnic spot for over 50 years.  Activities include fishing, boating, rafting, tubing, sun-tanning on the beach, picnicking, bird watching, and nature walks.  Bicyclists frequently begin or end their trips on the Historic Columbia River Highway at Dabney.  Fishermen like the deep turns and cobbled bottoms of the Sandy River, going after salmon and steelhead. 

\n
\n\tThe main picnic area at Dabney is shaded, has BBQ grills, and located near the beach.  The picnic and beach areas are extremely popular in the summer months.  Other picnic tables and grills are located throughout the park.  The park has one reserve able picnic shelter, with electricity, to accommodate events up to 50 people.  The disc golf course at Dabney is popular year-round, and remains one of the most technical and challenging courses in the Northwest.  No pets are permitted in the park which is enforced.  Alcohol is allowed in the park, but not below the Stark Street Bridge.

\n
\n\t\n\tPARK HOURS 6 am -10 pm

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n
\n\t 

\n",
      "park_name": "Dabney State Recreation Area",
      "park_id": 110,
      "park_longitude": -122.352222
   },
   {
      "park_latitude": 44.047709,
      "park_narrative": "
\n\tDarlingtonia State Natural Site is the only Oregon state park property dedicated to the protection of a single plant species. Concurrently, the plants it protects are the only carnivorous flora in the system.\n\t\n\tThis 18-acre botanical park provides parking and a boardwalk trail out into a fen that is home to Darlingtonia californica. Also called a cobra lily, the rare, strangely-shaped plant is the only member of the pitcher plant family (Sarraceniaceae) in Oregon.\n\t\n\tWhat visitors see in this little garden of multi-colored horrors (for insects), is a plant with yellowish green hooded leaves that form erect, 10 to 20-inch-high hollow tubes. On top, the leaves are often purplish to reddish mottled with transparent areas. A hidden opening into the stalk is bordered by a large, green, mustache-shaped appendage beneath the curved hood of the leaf. Nectar inside the plant's hidden opening attracts the insects. Once inside, an insect becomes confused by the transparent areas that appear like exits. It's all "downhill" for the insect from that point as it eventually drops into the lower part of the tube, is trapped by downward-pointed hairs and falls into a pool of water at the bottom of the stalk. Bacteria in the water decompose it into nitrogen that is then absorbed by the plant.\n\t\n\tDarlingtonia californica has flowers with five purple petals (surrounded by yellow sepals) that bloom in the spring. Associated species include an orchid, California lady's slipper, and two lilies, Tofieldia and Narthecium.\n\t\n\tDarlingtonia plants are found in serpentine soils and sphagnum fens arising from wet sands on coastal plains. Collecting Darlingtonia samples is illegal in Oregon.\n\t\n\tBesides its parking area and boardwalk, Darlingtonia State Natural Site offers a small picnic area. Nearby scenery includes a lush assortment of vegetation that includes rhododendron, spruce, cedar and shore pine.

\n",
      "park_name": "Darlingtonia State Natural Site",
      "park_id": 81,
      "park_longitude": -124.097332
   },
   {
      "park_latitude": 46.04444444,
      "park_narrative": "
\n\tThe ocean is a just a short walk from Del Rey's quiet, secluded parking area. If ever there was a place to play, fly a kite, build a sand castle or picnic, this is it. The sunsets can be spectacular, too.

\n",
      "park_name": "Del Rey Beach State Recreation Site",
      "park_id": 128,
      "park_longitude": -123.923611
   },
   {
      "park_latitude": 45.634315,
      "park_narrative": "
\n\tThe Deschutes River State Recreation Area is a tree-shaded, overnight oasis for campers. The sparkle-laden, swift, green rush of the Deschutes converges with the Columbia here, and there's no better place for family outing activities like hiking, mountain biking, camping, rafting, world-class steelhead and trout fishing, and reservation only equestrian trail riding (March - June).

\n
\n\tSpring comes early in the Deschutes canyon, painting the walls of the canyon green for a few months each year, before heat begins to build in June, turning the vegetation a golden shade of brown. The canyon is sheltered and warmer than you might think; the first wildflowers break from winter's grip in late February. What a great escape from the rainy weather!

\n
\n\tThe Atiyeh Deschutes River Trail at river level is a favorite jaunt for hikers on hot summer days. You just can't beat the cool river and the shade of white alder trees (and while you're resting, look for the hanging basket-type nests built by the orioles).

\n
\n\tThe Deschutes, which is both a national and state scenic waterway, drops about a quarter of a mile in its final 100 miles as it twists through canyons 700 to 2,200 feet deep - great for days of fun whitewater rafting, kayaking, and inner-tubing.

\n
\n\tHeritage Landing is a popular jetboaters launch. It provides access to the Deschutes and Columbia Rivers. This is where river guides meet their clients, families gather to head out onto the Columbia River for salmon fishing or water skiing, and everyone collects to share the excitement of their big catch. Jetboating is allowed on the lower segment of the Deschutes River all year 'round except alternating weekends from June - September; boaters passes are required for all flotation devices.

\n
\n\tThe lower two miles of the Deschutes River is a PASS THROUGH zone for boaters. This provides fishing access for the many hike-up anglers that depart from Heritage Landing and use the river trails.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproimately 34 electrical sites with water (water shut off in winter)
\n\t
\n\t\tApproximately 25 primitive sites with drinking water and restrooms nearby**
\n\t
\n\t\tFour group RV/tent camping areas**
\n\t
\n\t\tFlush toilets and hot showers**
\n
\n
\n\t** Closed in winter

\n",
      "park_name": "Deschutes River State Recreation Area",
      "park_id": 29,
      "park_longitude": -120.908132
   },
   {
      "park_latitude": 44.729984,
      "park_narrative": "
\n\tDetroit Lake's campground offers nearly 300 sites on the shore of a forest-ringed canyon reservoir in the Cascade Mountains. The nine-mile-long lake is a popular destination for fishing, boating, and other water sports. Sightseers enjoy views of snow-capped Mt. Jefferson in the distance.

\n
\n\tThe campground has horseshoe pits, a basketball court, a volleyball area, and a playground. There are two courtesy boat ramps, two reservable boat moorages, and a fishing dock.

\n
\n\tThere is also a Visitor Center that has park and area information along with gifts, ice, soft drinks, firewood, souvenirs and educational toys that can be purchased.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 105 full-hookup sites
\n\t
\n\t\tApproximately 69 electrical sites with water
\n\t
\n\t\tApproximately 98 tent sites with water nearby
\n\t
\n\t\tShowers and flush toilets
\n\t
\n\t\tSwimming areas
\n\t
\n\t\tFirewood for sale
\n
\n\n\tUniversal Access\n\tThree campsites are accessible to campers with disabilities.
\n\n\tFor more information about the local area and events go to www.detroitlakeoregon.org
\n",
      "park_name": "Detroit Lake State Recreation Area",
      "park_id": 65,
      "park_longitude": -122.176582
   },
   {
      "park_latitude": 44.97131,
      "park_narrative": "
\n\tWith downtown Lincoln City mere minutes away, you can glide quietly by canoe or kayak on the lake while you watch for coots, loons, ducks, cormorants, bald eagles, and grebes. As the only Oregon coast campground located in the midst of a city, the lake is a center of summertime activity. While none of the campsites are near the water, a hard-surfaced trail leads out of the campground to the shore of Devil's Lake. Boaters, skiers, swimmers, and personal watercraft users share the water. Kayak tours of the lake are scheduled in the summer, Memorial Day through Labor Day (we provide the kayak). Please call 541-994-2002 for information on pricing and availability.\n\t\n\tThe nearby outlet mall, one of the largest in Oregon, is a short drive away. You'll find the campground on the west shore (called Devils Lake State Park by Google Maps) - the address is 1452 NE 6th Drive. The East Devil's Lake day-use area (Google Maps calls this park Devils Lake State Recreation Area) is a short drive around the southern end of the lake at 205 NE East Devil’s Lake Road.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 25 full-hookup sites
\n\t
\n\t\tFive electrical sites
\n\t
\n\t\tMore than 50 tent sites with water nearby
\n\t
\n\t\t10 yurts (one pet-friendly)
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tMore than 10 boat moorage slips (no launch sites)
\n
\n\n\tUniversal Access\n\tTwo campsites and two yurts are accessible to campers with disabilities.
\n",
      "park_name": "Devil's Lake State Recreation Area",
      "park_id": 155,
      "park_longitude": -124.013795
   },
   {
      "park_latitude": 44.746866,
      "park_narrative": "
\n\tSurfers and surf watchers energize this area! During winter storms, water from the restless ocean slams with a thundering roar into a hollow rock formation shaped like a huge punch bowl. The surf churns, foams, and swirls as it mixes a violent brew. The punch bowl was probably created by the collapse of the roof over two sea caves, then shaped by wave action. The park is a popular whale watching site and displays an intriguing geology. This is a scenic picnic spot atop the undulating rocky shoreline. Don't forget to explore the tidepools on the north side of the punch bowl!

\n",
      "park_name": "Devils Punchbowl State Natural Area",
      "park_id": 156,
      "park_longitude": -124.064748
   },
   {
      "park_latitude": 43.91807,
      "park_narrative": "
\n\tDexter State Recreation Site, on the western edge of Dexter Reservoir, provides convenient access to the reservoir with docks and a two lane launch ramp.  A picnic area with bbq stands and fire rings overlooks the lake.  But the lake is not the only attraction!  A popular 18-hole disc golf course winds it way through oaks and Douglas fir trees and you can reach nearby Elijah Bristow State Park through a system of connecting trails that follow the Middle Fork of the Willamette River.

\n",
      "park_name": "Dexter State Recreation Site",
      "park_id": 179,
      "park_longitude": -122.815856
   },
   {
      "park_latitude": 44.463888,
      "park_narrative": "\n\n
\n\tDriftwood Beach State Wayside provides access to the ocean and picnic facilities scattered among the shore pine. The area offers a wide, flat, sandy beach. A great place for beachcombing and enjoying beautiful sunsets.

\n",
      "park_name": "Driftwood Beach State Recreation Site",
      "park_id": 144,
      "park_longitude": -124.077777
   },
   {
      "park_latitude": 45.923055,
      "park_narrative": "
\n\tWrapping around Tillamook Head, between Seaside and Cannon Beach, Ecola State Park stretches along 9 miles of coastline and offers outstanding sightseeing and recreation opportunities combined with a storied past.  Though the scenic and hiking opportunities may be the main allure, the diversity of outdoor recreation including picnicking, tidepooling, surfing and wildlife observation make Ecola State park a destination year round.

\n
\n\tSightseeing opportunities begin the moment you enter the park.  The entrance road meanders through a lush Sitka spruce forest, eventually opening up to a grassy bluff offering breathtaking views of the Pacific Ocean.  You may recognize the viewpoint south, a scene from many published photographs.  Sea stacks punctuate the long sweep of shoreline south, backed by the town of Cannon Beach and ridge of coastal mountains above. 

\n
\n\tEcola’s trails offer cliff side viewpoints of secluded coves, forested promontories and even a long abandoned lighthouse.  The park’s network of trails include an 8 mile segment of the Oregon Coast Trail, and a 2 1/2 mile historical interpretive route called the Clatsop Loop Trail.  Part of the Clatsop Loop Trail and the trail over Tillamook Head follow in the footsteps of the Corps of Discovery.  Captain William Clark and 12 members of the Corps of Discovery traveled through what is now the park in 1806 in search of a beached whale near present-day Cannon Beach.  After scaling the north slope of Tillamook Head and reaching one of its viewpoints, Clarke described the vista as “… the grandest and most pleasing prospects which my eyes ever surveyed…”

\n
\n\tStop for a picnic before taking to the many miles of trails.  Visit Indian Beach, a secluded sandy beach, popular with surfers and beach goers, offering tide pools and scenic splendor.  Keep a watchful eye open for the park’s wildlife, such as deer, elk or eagles soaring overhead.  You may even spot migrating gray whales throughout winter and spring.\n\t 

\n",
      "park_name": "Ecola State Park",
      "park_id": 136,
      "park_longitude": -123.96777
   },
   {
      "park_latitude": 43.936372,
      "park_narrative": "
\n\tElijah Bristow State Park is located on the Middle Fork of the Willamette River, and is easy to reach via State Highway 58 southeast of the Eugene. The park was named for one of the first pioneer settlers in Lane County and is comprised of 847 acres of scattered meadows, woodlands and wetlands.  2 reservable group picnic areas, and numerous first come, first serve picnic sites provide plenty of opportunity relax and enjoy nature.\n\t\n\tSalmon and steelhead trout abound during annual runs in one of the few stretches of the lower Willamette with fast-moving white water. Unique wildlife nesting and habitat areas fill the park's islands and sloughs.\n\tChannel Lake, a land-locked river channel that meanders through the park, eventually empties back into the Willamette and provides habitat for Osprey, great blue heron, bald eagles and beaver.  Elijah Bristow is also home to several threatened species, including the Western pond turtle and the Oregon chub.  A dense canopy of broadleaf and evergreen trees with a lush understory of shrubs and herbaceous plants provides an excellent area for nature study and outdoor education.

\n
\n\tElijah Bristow has more than 10 miles of trail for hikers, mountain bikers and equestrians. Part of the trail system includes a portion of the Eugene to Pacific Crest trail.  A separate equestrian staging area with a picnic shelter, bbq's, tables, water and a restroom make Bristow a favorite destination with local riding clubs.  Kayakers and canoeists will appreciate a new access trail to the river for the start of their journey on the Willamette River Water Trail.

\n",
      "park_name": "Elijah Bristow State Park",
      "park_id": 60,
      "park_longitude": -122.845031
   },
   {
      "park_latitude": 44.612813,
      "park_narrative": "
\n\tOn the highway between Newport and Corvallis, this land works equally well as a highway rest stop and tree preserve. Fruit trees are still found on the south side. Four picnic tables border a spacious, grassy meadow. A small stream flows from the northeast through the fir forest to join the Tumtum River.

\n",
      "park_name": "Ellmaker State Wayside",
      "park_id": 157,
      "park_longitude": -123.631128
   },
   {
      "park_latitude": 45.541366,
      "park_narrative": "
\n\tPerched near the summit of the Blue Mountains, Emigrant Springs State Heritage Area offers visitors an opportunity to camp and explore a popular pioneer stop over along the Oregon Trail. The park is nestled in an old-growth forest.  Camp in the campground, or bring your horse and camp in the reservable horse camp.  Picnic among towering trees or bring your group for overnight or daytime activities in our community building. For those that are not fully equipped for traditional camping, rent one of our cabins for a warm, dry and comfortable stay.\n\t\n\tVisit the Oregon Trail display in the park, take a stroll along the nature trail. Get your friends together and have a game at our full-size basketball court, baseball field and horseshoe pits or partake in an evening program at our amphitheater. Bring your inner tube for fun in the snow and enjoy a winter outing.\n\t\n\tUse Emigrant Springs as a base camp to explore nearby attractions such as the Blue Mountain Crossing Oregon Trail interpretive park or the Pendleton Woolen Mills. Experience the life of Chinese emigrants of the 1800's in the Pendleton underground tours. Other destinations within easy driving distance of the park include the Oregon Trail Interpretive Center near Baker City, the Union County Museum in Union, the Baker County Museum in Baker City, Hells Canyon National Recreation Area, and the Pendleton Roundup.  Enjoy winter recreation at the Blue Mountain Crossing Nordic Ski park or bring your snowmobile and visit one of the many snow parks which give you access to hundreds of miles of trails on two National Forests.

\n
\n\tCampground info

\n
\n\t
\n\t\t18 full hookup sites
\n\t
\n\t\tB17, B19, B21, B23 and B25 are open year round (water is available at restroom/shower building during winter)
\n\t
\n\t\t1 electrical site with water (closed in winter)
\n\t
\n\t\t32 tent sites with water nearby (closed in winter)
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tHorse camp with 7 sites (closed in winter)
\n\t
\n\t\t6 rustic log cabins and one cabin duplex (one pet friendly) (cabins are open year round)
\n\t
\n\t\tGroup tent camp
\n\t
\n\t\tRV dump station is located 7 miles west at Deadman’s Pass Rest Area
\n
\n\n\tUniversal Access\n\tOne tent site is accessible to campers with disabilities.
\n",
      "park_name": "Emigrant Springs State Heritage Area",
      "park_id": 16,
      "park_longitude": -118.461326
   },
   {
      "park_latitude": 45.136189,
      "park_narrative": "
\n\tThis 90-ton rock was deposited during an Ice Age flood. It floated over 500 miles in an iceberg 12,000 to 17,000 years ago,  by way of the Columbia River. When the ice melted, the rock was left behind. This is the largest glacial erratic found in the Willamette Valley. It is a type of rock not normally found in Oregon because it came from the Northern Rocky Mountains. Visitors at Erratic Rock can look out across the vast landscape and imagine the huge amount of water that filled the Willamette Valley during the Ice Age Floods.

\n",
      "park_name": "Erratic Rock State Natural Site",
      "park_id": 96,
      "park_longitude": -123.297173
   },
   {
      "park_latitude": 43.105531,
      "park_narrative": "
\n\tThere is an American Indian legend about this spot. Some say they hear a maiden's voice on the wind, and standing on the cliff overlooking the ocean you can easily pick out the face on Face Rock. There is a well-kept trail to the beach, and several rocky intertidal areas to explore at low tide.

\n",
      "park_name": "Face Rock State Scenic Viewpoint",
      "park_id": 47,
      "park_longitude": -124.433049
   },
   {
      "park_latitude": 43.971443,
      "park_narrative": "
\n\tFall Creek Reservoir is a prime recreation area surrounded by day-use parks and a campground.\n\t\n\tCascara campground, on the upper end of the Fall Creek Arm of the lake, is tucked away amid towering Douglas fir trees. This rustic campground offers 39 campsites, vault toilets, potable water, a launch ramp and swim area.  The first come, first served campsites are private, with many having views of the lake.  Looking for a place to camp with your group? A lake front reservable RV group camp, Fisherman's Point, is just across the road from Cascara campground.\n\t\n\tAnd if you want to get out on the reservoir for the day, check out one of the five day-use areas. Winberry, with its two-lane boat ramp and parking for more than 100 cars and 150 boat trailers, is the largest.  It features flush restrooms, a swim dock and swim beach, and picnic areas with bbqs and fire rings.  There is a day use fee at Winberry.\n\t\n\tThere are four other small, free, day-use sites on North side of the lake. North Shore has both a high water and low-water ramp, vault toilets and is open April - September.

\n
\n\tCampground info

\n
\n\tCascara campground

\n
\n\t
\n\t\t39 primitive sites
\n\t
\n\t\tVault toilets
\n\t
\n\t\tPotable water
\n
\n
\n\tFisherman's Point

\n
\n\t
\n\t\tGroup camp
\n\t
\n\t\tPotable water
\n\t
\n\t\tEight sites, maximum eight people per site for a total of 64
\n\t
\n\t\tPortable toilets
\n
\n
\n\t 

\n",
      "park_name": "Fall Creek State Recreation Area",
      "park_id": 176,
      "park_longitude": -122.665898
   },
   {
      "park_latitude": 44.303559,
      "park_narrative": "
\n\tHistoric Farewell Bend State Recreation Area, located on the Oregon/Idaho border northwest of Ontario, offers a beautiful desert experience on the banks of the Snake River's Brownlee Reservoir. Settlers traveling on the historic Oregon Trail once rested and enjoyed one last look at the river.  Historic markers and interpretive displays provide visitors with information on Farewell Bend's significance on the Oregon Trail. The RV and tent campgrounds make excellent base camps as you explore the region. Oregon Trail wagon ruts are visible just up the road. Firewood and ice are available for sale.\n\t\n\tIf history isn't your game, come for the sports! Brownlee Reservoir offers fishing, waterskiing and boating. Check current water levels at the Idaho Power website. There are horseshoe pits, basketball hoops and a sand volleyball court for you to enjoy. Best of all, while resting from the day's activities, you can enjoy the scenery and amenities. Picnic on the cool grass, roast marshmallows over your campfire.  If you are lucky, you'll see wildlife like deer, pronghorn, geese, eagles, chukars, and Quail.   Evening interpretive programs are presented from Memorial Day through Labor Day.  See events for dates and times. 

\n
\n\tParking permits are needed all year to use the park's large, shaded day-use area and boat ramp.  Display a daily permit, a 12 or 24 month pass, or your camping receipt.  A camping receipt is equal to a daily permit for those days registered if displayed on the driver's side of your vehicle's dashboard. Purchase a daily permit at the registration booth or at a day-use fee station.  The 12 or 24 month permits are sold at the registration booth.  You can also call 1-800-551-6949. 

\n
\n\tCampground info

\n
\n\tAntelope Loop is open for camping on a first-come, first-served basis.  Brownlee and Catfish Loops are both open to camping. Reservations for both Brownlee and Catfish loops begin May 1st. Cabins are available for reservations year-round.

\n
\n\t
\n\t\tMore than 90 electrical sites with water
\n\t
\n\t\tApproximately 30 tent sites with water nearby
\n\t
\n\t\tHiker/biker sites
\n\t
\n\t\tTwo log cabins (open year-round)
\n\t
\n\t\tGroup tent camp
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tFirewood and ice sales
\n\t
\n\t\tRV dump station
\n\t
\n\t\tHorseshoe pits, basketball hoops, and volleyball court
\n
\n\n\tUniversal Access\n\tBoth cabins and electrical site are accessible to campers with disabilities.
\n",
      "park_name": "Farewell Bend State Recreation Area",
      "park_id": 4,
      "park_longitude": -117.227563
   },
   {
      "park_latitude": 44.841388,
      "park_narrative": "
\n\tWhere the creek and ocean meet, you'll find ingredients that make the spirit soar. Discover this park's perfect wind-sheltered picnic areas. In case of rain, head for the covered picnic shelter. Walk the wooden footbridges arching through the Sitka spruce, western hemlock, shore pine and alder forest. At the cliff-rimmed beach, a lazy creek flows into the sea, cutting through an enchanting scenic ocean cove. This park has some great birdwatching and tidepooling opportunities.

\n",
      "park_name": "Fogarty Creek State Recreation Area",
      "park_id": 158,
      "park_longitude": -124.049378
   },
   {
      "park_latitude": 43.372761,
      "park_narrative": "
\n\tThe Fort Rock Basin has served as a vital part of the Native American lifestyle. Fort Rock Cave is near Fort Rock State Natural Area, and is the site of an archaeological discovery of several 9,000 to 11,000 year-old sagebrush sandals. This property serves as a reminder of the rich cultural heritage that has shaped so much of Oregon's history. The story of the Fort Rock Basin is told by the artifacts left behind and by the rich oral tradition of the tribes who claim the area as home. Fort Rock Cave is a National Heritage site and is open only by a state park guided tour (see below). The location is not available here on the website.\n\t\n\t2015 Cave Tours

\n
\n\tReservations now accepted. Please call 1-800-452-5687 to reserve your tour. An $8 reservation fee applies. Tours are limited to 10 people. For large, group tours, call (541) 923-7551, ext. 21 for additional information.\n\t\n\tSchedule \n\tReserve one of two sessions daily:\n\t9 a.m.-11 a.m. or 11:30 a.m.-1:30 p.m.

\n
\n\tAlert:  Tours from mid-July through August are subject to possible cancelation during conditions of high fire danger.

\n
\n\tAvailable tour dates for 2015:

\n
\n\tJune - 4th, 12th, 20th

\n
\n\tJuly - 2nd, 10th, 18th

\n
\n\tAugust - 6th, 14th, 22nd

\n
\n\t 

\n",
      "park_name": "Fort Rock Cave",
      "park_id": 170,
      "park_longitude": -121.0659641
   },
   {
      "park_latitude": 43.370761,
      "park_narrative": "\n
\n\tLike a desert mirage, this National Natural Landmark rises huge out of the barren, immense flatness of Oregon's high desert. An enormous near-circle of towering jagged rock walls make it seem like a fort. Hike around and you'll soon realize it's even bigger than it looks! It's an old tuff ring set in what was a shallow sea in prehistoric times. As you walk around inside, imagine the early American Indians who canoed to and from what was then an island. Sandals found in a nearby cave are the oldest ever discovered, dating back around 9,000-13,000 years Visit the Fort Rock Cave web page tour information.

\n",
      "park_name": "Fort Rock State Natural Area",
      "park_id": 31,
      "park_longitude": -121.0659641
   },
   {
      "park_latitude": 46.18422,
      "park_narrative": "
\n\tFort Stevens was once the primary military defense installation in the three-fort, Harbor Defense System at the mouth of the Columbia River (Forts Canby and Columbia in Washington were the other two). The fort was in service for 84 years, beginning during the Civil War and closing at the end of World War II. Today, Fort Stevens has grown into a 4,200 acre park offering exploration of history, nature, and many recreational opportunities.

\n
\n\tCamping, beach-combing, freshwater lake swimming, trails, wildlife viewing, a historic shipwreck, and a historic military fort make Fort Stevens a uniquely diverse park. The park also boasts a network of nine miles of paved bicycle trails and six miles of hiking trails that allow you to explore a variety of habitats including spruce and hemlock forests, wetlands, dunes, and shore pine areas.\n\t\n\tCoffenbury Lake has two swimming areas, a picnic area, restrooms, and a boat ramp. Two neighboring, smaller lakes are great for fishing and canoeing.\n\t\n\tThroughout the year, you can browse through displays ranging from the Civil War to World War II at the military museum and information center, walk through the only Civil War era earthen fort on the west coast, or explore the many turn-of-the-century, concrete coast artillery gun batteries.\n\t\n\tDuring the summer, take a tour underground through a rare gun battery that also served as a World War II command center, ride in the back of a period military transport truck and see the fortifications from a whole new perspective, or get a feel for what the inside of a military jail was like as you walk through one of the last brick constructed guard houses in the country.  For more information regarding these tours, please contact the Friends Of Old Fort Stevens at 503-861-2000.

\n
\n\tThe park continues to have the longest running partnership with a friends group in the state of Oregon. The Friends Of Old Fort Stevens is a 501(C)3, nonprofit group dedicated to preserving, restoring, and interpreting historic Fort Stevens. Funds earned by the Friends Of Old Fort Stevens are utilized to further enhance the historic areas of Fort Stevens State Park for future generations.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 170 full-hookup sites
\n\t
\n\t\tMore than 300 electrical sites with water 
\n\t
\n\t\tSix tent sites with water nearby
\n\t
\n\t\t15 yurts (one pet-friendly)
\n\t
\n\t\t11 deluxe cabins (one pet-friendly)
\n\t
\n\t\tHiker/biker sites
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tFour campsites, eight cabins, and 10 yurts are accessible to campers with disabilities.
\n",
      "park_name": "Fort Stevens State Park",
      "park_id": 129,
      "park_longitude": -123.95682
   },
   {
      "park_latitude": 45.0741,
      "park_narrative": "
\n\tBuilt in 1856 to regulate the eastern border of the Grand Ronde Indian Reservation, Fort Yamhill represented a time of transition for the people of the Northwest. The fort served to ease tension between settlers and natives, protect both populations and control traffic between them. Fort Yamhill is one of the best archaeologically preserved forts in the Northwest from the mid 19th century. 

\n
\n\tTimes were hard for all. Native Americans from 27 tribes of Western Oregon were moved from their homes to the reservation - a confinement that imposed a new spoken language and white man's rules. Enlisted soldiers fought hunger, rain, isolation and monotony. Desertion was common, but the rough country usually drove deserters back to duty.\n\t\n\tVisiting Fort Yamhill today offers an insight into the physical and emotional hardships endured by all the people involved, as well as the emotional tone of the state from 1856-1866. Exhibits and cultural restoration are provided in partnership with the Confederated Tribes of the Grand Ronde.

\n",
      "park_name": "Fort Yamhill State Heritage Area",
      "park_id": 185,
      "park_longitude": -123.5765
   },
   {
      "park_latitude": 42.82638,
      "park_narrative": "
\n\tFrenchglen Hotel is a small slice of peace and quiet in southeastern Oregon at the gateway to the mighty Steens Mountain. You don't need to drive to the Sierra Nevada or Montana to get that glorious wide-open sky feeling. Come and enjoy the history and unique beauty of this timeless piece of Oregon history.

\n
\n\tRooms for rent

\n
\n\tMuch like stagecoach travelers of the early 20th Century, you can stay in one of the hotel's rustic rooms. The dining room and lobby are great places to meet and get to know your fellow travelers. And like the olden days, the restrooms are down the hall.

\n
\n\tTo make reservations for rooms or meals, call (541) 493-2825 or e-mail fghotel@yahoo.com

\n
\n\t2015 Room Rates & Restaurant Prices

\n
\n\tFull-size bed --  $75\n\tFull-size bed & single -- $82\n\t(Televisions and telephones not available. Limited cell phone reception.)

\n
\n\tBreakfast 7:30 a.m. - 9:30 a.m. Prices $5.50 to $10.50\n\tLunch 11:30 a.m.  - 2:30 p.m. Prices $6 to $11\n\tFamily Style Dinner 6:30 p.m. (by reservation). Prices $22 to $25.\n\t\n\tA sampling of dinners include herb baked chicken, down-home pot roast served with "garlicky" roasted potatoes, or honey-glazed pork chops. Top it off with a great home-made dessert. A local favorite is marionberry cobbler with a big scoop of ice cream.

\n",
      "park_name": "Frenchglen Hotel State Heritage Site",
      "park_id": 2,
      "park_longitude": -118.913888
   },
   {
      "park_latitude": 42.490005,
      "park_narrative": "
\n\tWithin this historic site of a Rogue Indian war skirmish, the park contains the grave sites of the Geisel family. It is a peaceful, secluded picnic area to enjoy, while traveling along Highway 101.

\n",
      "park_name": "Geisel Monument State Heritage Site",
      "park_id": 39,
      "park_longitude": -124.415396
   },
   {
      "park_latitude": 45.530277,
      "park_narrative": "
\n\tAccess to George Joseph State Park is possible by using the trail from Latourell Falls and Guy Talbot State Park. A trail leads from the parking lot to the top of lower Latourell Falls. Beyond this point on the trail, you've entered the enchanted forest of George Joseph State Park where sword fern, moss and lichens are barely illuminated through the dense stands of timber. Continue on the trail to a rarely visited wonder which is upper Latourell Falls.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "George W. Joseph  State Natural Area",
      "park_id": 111,
      "park_longitude": -122.22
   },
   {
      "park_latitude": 44.876165,
      "park_narrative": "
\n\tIt's not your imagination ... those really are seal heads peering at you from the surf! A short paved trail descends from the parking and picnic area through the shore pine forest to a soft sand beach flanked by crumbling orange sandstone bluffs. Wetsuit-clad surfers often catch waves here in the mornings. As you hike to the right along the beach, the horizon is dominated by the dark green cape of Cascade Head. In case you decide to venture onward, please don't disturb the sea lions found at the tip of the four mile Salishan Spit.

\n",
      "park_name": "Gleneden Beach State Recreation Site",
      "park_id": 159,
      "park_longitude": -124.038634
   },
   {
      "park_latitude": 43.482427,
      "park_narrative": "
\n\tA hidden gem in the dense coastal forests of southwest Oregon, Golden and Silver Falls State Natural Area may be hard to find, but it's well worth the 24-mile drive from Highway 101. The final 3-miles narrow to a one lane gravel road. The small parking and picnic area are located along the banks of Glenn and Silver Creeks and is shaded by large maple, alder, and Oregon myrtle trees. Hiking trails wind through scenic canyons to each of the waterfalls that plunge over sheer rock cliffs to moss covered boulders 100 feet below.\n\t\n\tHike 1.4 miles to the top of Golden Falls to get an eagle's-eye view of the cascading waterfall and giant old-growth firs and cedars.

\n",
      "park_name": "Golden and Silver Falls State Natural Area",
      "park_id": 67,
      "park_longitude": -123.933062
   },
   {
      "park_latitude": 42.6846,
      "park_narrative": "
\n\tAt its peak, the 19th century mining town of Golden, now a ghost town, was home to 100 people and served as a hub for many others who worked the land in more remote locations. The 1850s mining camp eventually gave way to a town established around 1890. Golden was distinguished by its lack of saloons in the town center, its two active churches and the large orchard established by its founding families. Today, visitors can explore the remaining settlements perched above the valley where miners once toiled.\n\t\n\tGolden's remains include four buildings: a church, a former residence, a shed and a structure that once housed a post office and store. The entire property is in the National Register of Historic Places.

\n",
      "park_name": "Golden State Heritage Site",
      "park_id": 189,
      "park_longitude": -123.3394
   },
   {
      "park_latitude": 41.993065,
      "park_narrative": "
\n\tGoose Lake State Recreation Area is a green and shady destination of wildlife and wildlife watchers on the Oregon-California border. Its grassy expanse also makes it an inviting place to camp. It is home to many species of birds and other wildlife including a large herd of mule deer which spend much of the time in the 48-site campground.

\n
\n\tThe park provides hot showers, grassy areas suitable for tents, paved sites, shade trees, fireplaces, electrical hookups, telephone and a dump station. Brochures are available at the campground  that provide information about things to see and do in the area.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 45 electrical sites with water
\n\t
\n\t\tHiker/Biker camp
\n\t
\n\t\tGrassy area for tents
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tRV dump station
\n
\n
\n\t 

\n",
      "park_name": "Goose Lake State Recreation Area",
      "park_id": 1,
      "park_longitude": -120.29608
   },
   {
      "park_latitude": 45.57,
      "park_narrative": "
\n\tGovernment Island (in the Columbia River northeast of Portland) is a series of islands accessible by boat only. There are two docks and a floating tie-up on the north side of the main island. Although restrooms are located throughout, rules signs and restrooms also are located at West Lemon Island, SE Lemon, Commodore (near I-205 north), Government Island Landing (west dock), Bartlett Landing (east dock), SE McGuire, and about two miles east of south I-205 (South Beach)

\n
\n\tWith 15 miles of shoreline, the park is popular with anglers. Camping is permitted below the vegetation line around the perimeter and in a few upland areas where picnic tables and a shelter have been installed.\n\tThere are trails along the north side of Lemon and Government Islands. The interior is accessible by permit only. The interior of the island is still used as a cattle ranch and also contains protected natural areas.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Government Island State Recreation Area",
      "park_id": 169,
      "park_longitude": -122.50833
   },
   {
      "park_latitude": 44.407462,
      "park_narrative": "\n\n
\n\tGovernor Patterson State Park is a beachcomber's delight ... miles of flat, sandy beach and just a short hike from the mouth of Alsea Bay where you can windsurf, crab, or just watch the seals. Excellent whale and storm watching. Sunsets are beautiful here and it's a great place to take photos.

\n",
      "park_name": "Governor Patterson Memorial State Recreation Site",
      "park_id": 82,
      "park_longitude": -124.085148
   },
   {
      "park_latitude": 45.537324,
      "park_narrative": "
\n\tGuy Webster Talbot and his family used this property as a summer estate until 1929 when they donated it to the state. Today, it's a beautiful picnic park. A modern picnic shelter is available for rent (and is reservable).While the park is terrific for a group or family picnic, the park is often uncrowded even on the best days because of its seclusion. A gently sloping grassy hill dotted with Port Orford cedars, Douglas firs, alders and maples invites frisbee tossing and quiet relaxation.

\n
\n\tThe tiny town of Latourell borders the north side of the park. Homeowners ask that visitors please respect their privacy. A trail underneath the Historic Columbia River Highway bridge leads directly to Latourelle Falls (250' tall), only a few minutes away by foot.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Guy  W. Talbot State Park",
      "park_id": 112,
      "park_longitude": -122.227212
   },
   {
      "park_latitude": 45.029099,
      "park_narrative": "
\n\tEnjoy your drive through this scenic corridor surrounding Highway 18. Along the way, there's a place to pull off, stretch your legs and enjoy a spot of lunch amid a captivating ancient forest. If the time is right, get ready for some exciting wildlife viewing. A weekday would be the most peaceful, and give you a chance to discover the old growth Douglas-fir trees along the Salmon River. Stay alert for salmon, deer and Roosevelt elk. Exactly one mile east of the park entrance is a pull-out with a short trail leading to a swimming hole beneath more ancient trees.

\n",
      "park_name": "H.B. Van Duzer Forest State Scenic Corridor",
      "park_id": 160,
      "park_longitude": -123.817134
   },
   {
      "park_latitude": 42.064968,
      "park_narrative": "
\n\tHarris Beach was named after the Scottish pioneer George Harris who settled here in the late 1880s to raise sheep and cattle.  The park boasts the largest island off the Oregon coast.  Bird Island (also called Goat Island) is a National Wildlife Sanctuary and breeding site for such rare birds as the tufted puffin.  The park offers sandy beaches interspersed with rocky outcroppings harboring interesting tidepools with their wide variety of life.  Sea stacks dot the ocean just off shore.

\n
\n\tThe park's beauty changes with the seasons.  Many people are drawn to the powerful and dramatic winter storms; others seek the green and fragrant spring.  Summer is the time to bring your kites, shovels and pails with dry days of sun and occasional fog.  Fall is often the best time of year with clearer, warm days and gorgeous sunsets.  Wildlife viewing opportunities are abundant, with gray whales on their winter and spring migrations, Harbor seals, California sea lions, sea birds and the rich marine gardens.  All-in-all making this park a fascinating stop for camping or beachcombing.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 35 full-hookup sites 
\n\t
\n\t\tApproximately 50 electrical sites with water
\n\t
\n\t\tMore than 60 tent sites with water nearby
\n\t
\n\t\tSix yurts (one pet friendly)
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tPlayground
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\t1 campsite and 1 yurt are accessible to campers with disabilities.
\n",
      "park_name": "Harris Beach State Park",
      "park_id": 58,
      "park_longitude": -124.303407
   },
   {
      "park_latitude": 45.906128,
      "park_narrative": "\n\n
\n\tHat Rock State Park, located off U.S. Highway 730 nine miles east of Umatilla, lies on the south shore of Lake Wallula behind McNary Dam on the Columbia River. Hat Rock was the first distinctive landmark passed by the Lewis and Clark Expedition on their journey down the Columbia, and is one of the few remaining sites not underwater.\n\t\n\tThe park is a desert oasis surrounded by rolling sagebrush hills and outcroppings of basalt. The park offers visitors a chance to escape the summer heat under the shelter of cottonwood and black locust ringed by acres of green grass. A boat ramp provides access to the lake, which is noted for walleye, sturgeon, and other fish. Water skiing, jet skiing, swimming, and boating are popular here. The park has its own pond stocked with rainbow trout and provides year-round habitat for waterfowl.\n\t\n\tBring the kids, enjoy a day on the water, fish in the pond, or play volleyball in the sand court. Hat Rock offers the opportunity to get out and enjoy nature with spacious, well-maintained grounds that offer lots of room for your family or large group to get together for outdoor recreation and fun.

\n",
      "park_name": "Hat Rock State Park",
      "park_id": 12,
      "park_longitude": -119.159296
   },
   {
      "park_latitude": 44.136505,
      "park_narrative": "
\n\tLighthouse tours are available 7 days a week from 11:00 a.m. to 3 p.m., weather and staff permitting.  Tour groups, school groups, and other groups please e-mail us to schedule a tour at Heceta.h.lighthouse@oregon.gov. 

\n
\n\tRestoration of the tower finished in mid-2013. Because of ongoing maintenance and inspections of the upper levels, tours currently only cover the outdoor area around the base of the lighthouse, and the ground floor of the tower. A new schedule will be announced when tours of the upper levels resume.

\n
\n\tHead Lighthouse State Scenic Viewpoint is located in a cove at the mouth of Cape Creek. There are picnic tables sheltered from the wind and a great view of the ocean. A short trail leads to the historic Heceta Head lighthouse and assistant keeper's house.\n\t\n\tHeceta Head trail is part of a 7-mile network. Trails of varying difficulty feature beach and wildlife viewing areas. Wildlife refuge islands feature a view of common murres, cormorants, gulls, and other bird nesting areas. Sea lions and whales can be seen from the beach and cliff-top lighthouse.\n\t\n\tOn the west side of 1,000-foot-high Heceta Head, 205 feet above the ocean, the lighthouse is one of the most photographed on the coast. The light at top of 56-foot tower was illuminated in 1894; the automated beacon, seen 21 miles from land, is rated as the strongest light on the Oregon coast. The historic assistant lighthouse keeper's house (Heceta House; built 1893) offers bed and breakfast rentals and facilities for group events.  The bed and breakfast is operated by a concessionaire of the U.S. Forest Service and can be reached at 1-866-547-3696 or http://hecetalighthouse.com/\n\t\n\tCommon murres, which lay their eggs on the bare rocks, can be easily seen by looking down, just over the railing near the lighthouse. Brown pelicans commonly fly by, as do bald eagles. Migrating gray whales can be seen as they travel to and from Alaska and Baja California. May is a great time to look right down on the migrating mothers and calves as they travel close to shore.\n\t\n\tThere are natural caves, tidepools, and a sandy beach for building sandcastles.

\n
\n\tDay-use parking permits are required year round at Heceta Head Lighthouse State Scenic Viewpoint.  A daily ($5), 12-month or 24-month permit, an Oregon Coast Passport, or a valid state park camping receipt is required.  Purchase daily permits from a machine at the park.  The 12-month and 24-month permits are sold at most major state park offices.

\n",
      "park_name": "Heceta Head Lighthouse State Scenic Viewpoint",
      "park_id": 86,
      "park_longitude": -124.121976
   },
   {
      "park_latitude": 45.633585,
      "park_narrative": "
\n\tHeritage Landing is a popular boat launch and day use area. It provides access to the Deschutes and Columbia Rivers. This is where river guides meet their clients, families gather to head out onto the Columbia River for salmon fishing or water skiing, and everyone collects to share the excitement of their big catch. Jetboating is allowed on the lower segment of the Deschutes River all year around except alternating weekends from June - September; boaters passes are required.\n\tThe lower 2 miles of the Deschutes River is a PASS THROUGH zone for boaters, which means that all floating craft, except float tubes, may not stop along or tie up to the riverbank except in an emergency. This provides fishing access for the many hike-up anglers that depart from Heritage Landing and use the river trails.

\n",
      "park_name": "Heritage Landing (Deschutes)",
      "park_id": 27,
      "park_longitude": -120.916101
   },
   {
      "park_latitude": 45.34027,
      "park_narrative": "
\n\tHilgard Junction State Park is next to Interstate 84 at its intersection with Highway 244 near the Grande Ronde River. The park offers camping and daytime activities amongst the cottonwood and ponderosa pine. The Grande Ronde River flows through the park, enticing anglers, rafters and swimmers. Beaver, mink, deer and a variety of birds inhabit the park area and can be viewed throughout the year.\n\t\n\tFall frosts gives birth to brightly colored fall foliage along the river corridor, and winter snows bring herds of elk and deer to the banks of the river. While camping at the park, you can see ruts of the historic Oregon Trail at the nearby Blue Mountain Crossing Interpretive park, explore miles of open road in the national forest, or hop over to La Grande and stock up on groceries, have a meal or partake in community events.\n\t\n\tIf you're going to be traveling Interstate 84, be sure to stop at Hilgard Junction and spend a night or two and explore the natural beauty of eastern Oregon.

\n
\n\tCampground info

\n
\n\t
\n\t\t18 primitive sites with water nearby
\n\t
\n\t\tPaved parking at all sites (can accommodate self-contained RVs)
\n\t
\n\t\tRestrooms with flush toilets
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tGrande Ronde River rafting access
\n\t
\n\t\tHorseshoe pits
\n\t
\n\t\tOregon Trail interpretive shelter
\n
\n\n\tUniversal Access\n\tOne campsite is accessible to campers with disabilities.
\n",
      "park_name": "Hilgard Junction State Park",
      "park_id": 13,
      "park_longitude": -118.238888
   },
   {
      "park_latitude": 45.684935,
      "park_narrative": "
\n\tWhere motorists on old U.S. Highway 30 once crept around curves high along the cliffs of the Columbia River Gorge, hikers, bicyclists and users of other muscle-driven forms of transportation leisurely enjoy the view from the Historic Columbia River Highway State Trail. The trail, three disconnected paved ribbons along abandoned stretches of the historic highway, give you more than 12 miles of sightseeing thrills.

\n
\n\tMark O. Hatfield Trailheads (east and west) \n\tBetween Mosier and Hood River, the five-mile Twin Tunnels segment passes through two climate zones. Starting at the east Mark O. Hatfield Trailhead near Mosier, the 1.5 mile trail leads through semi-arid terrain dotted with ponderosa pine for about a mile until you reach the Twin Tunnels. Spectacular geologic formations tell the story of the gorge's creation.\n\t\n\tAfter passing through the tunnels, you'll emerge into a forest of fir trees and other common western Oregon plants. Viewpoints along the 3.5-mile segment from the tunnels to the west Mark O. Hatfield Trailhead overlook the river.

\n
\n\tStarvation Creek Trailhead 

\n
\n\tThis 2-mile trail segment begins in Starvation Creek State Park and heads east ending at Viento State Park. 

\n
\n\tHistoric Columbia River Highway and State Trail bicycle and hiking map

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Historic Columbia River Highway State Trail",
      "park_id": 113,
      "park_longitude": -121.4046
   },
   {
      "park_latitude": 45.66168,
      "park_narrative": "
\n\tLush and green, this portion of the trail gets twice as much rainfall as the Twin Tunnels section. Ferns, moss-covered rocks and delicate, shaded wildflowers flank the 4-mile section from Cascade Locks west to the Tooth Rock Trailhead. Several U.S. Forest Service trails intersect this segment of the trail including the Pacific Crest Trail. Note: This segment has a staircase equipped with bikewheel grooves about 3 miles west of the trailhead. The trail leading up to the staircase is ADA accessible.

\n
\n\tPark for free at the small parking area near the bridge entrance. The trailhead is beneath the bridge.

\n
\n\tHistoric Columbia River Highway and State Trail bicycle and hiking map

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Historic Columbia River Highway State Trail - Bridge of the Gods Trailhead",
      "park_id": 197,
      "park_longitude": -121.89823
   },
   {
      "park_latitude": 45.63461,
      "park_narrative": "
\n\tStart your trek east or west along this section of paved trail. The eastbound 4-mile trail gradually climbs through dense woods, and then delivers majestic views of Bonneville Dam. The trail continues past the Eagle Creek trailhead (a U.S. Forest Service trail), Cascade Fish Hatchery and stops at the Bridge of the Gods Trailhead. Note: This segment has a staircase equipped with bikewheel grooves about 1 miles east of the trailhead. The trail leading up to the staircase is ADA accessible.

\n
\n\tThe 1-mile westbound portion of the trail crosses rushing Tanner Creek, passes breathtaking overlooks of the Columbia River and continues to the Historic Moffett Creek Bridge. End your hike on the newest segment of the trail—Moffett Creek Bridge to John Yeon State Park.

\n
\n\tHistoric Columbia River Highway and State Trail bicycle and hiking map

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n
\n\t 

\n",
      "park_name": "Historic Columbia River Highway State Trail - Tooth Rock Trailhead",
      "park_id": 198,
      "park_longitude": -121.94795
   },
   {
      "park_latitude": 43.036388,
      "park_narrative": "
\n\tHoffman Memorial Myrtle Grove is a shaded glen canopied with spectacular myrtlewood trees. There's no drinking water at the park. The myrtlewood tree is a relative of the bay laurel. Many people cook with myrtlewood leaves in place of bay leaves. Can you imagine the pungent aroma that will greet you as you enter this grove?

\n",
      "park_name": "Hoffman Memorial State Wayside",
      "park_id": 48,
      "park_longitude": -124.11666
   },
   {
      "park_latitude": 45.825325,
      "park_narrative": "
\n\tHug Point State Recreation Site offers an easy access to the beach, a peek at some interesting local history and loads of scenic beauty.  Just 5 miles south of Cannon Beach, this little wayside includes forested picnic areas, a restroom and a short walkway to the beach.

\n
\n\tThe lovely sandy cove beach just off the park is backed by hills vegetated by salal, ferns and sitka spruce.  Located between Austin Point to the south and Hug Point to the north, a short walk north reveals a seasonal waterfall, caves carved into sandstone cliffs and tidepools accessible during low tide. 

\n
\n\tImagine traveling by stagecoach along the beach.  Before the highway was built, the beach was the only way to travel along this stretch of coast.  North of the parking area at low tide you may walk along the original stagecoach road, still harboring the wheel ruts carved into the rock.  Pioneers traveling around this headland had to hug this particular point even at low tide and so the point and the park both take the name hug point.

\n
\n\tPlease be aware of the tide when exploring the beach and headlands of Hug Point State Recreation Site! It is possible to become stranded at high tide when exploring the point.  Take a look at the stagecoach trail, the view of Haystack Rock to the north and the two caves around the point, but please do so in a safe manner.

\n",
      "park_name": "Hug Point State Recreation Site",
      "park_id": 137,
      "park_longitude": -123.961106
   },
   {
      "park_latitude": 42.689036,
      "park_narrative": "
\n\tThe park and campground are dominated by Humbug Mountain (elevation 1,756 feet) and surrounded by forested hills. The campground enjoys some of the warmest weather on the Oregon coast as the surrounding mountains offer protection from cool ocean breezes. Many visitors enjoy windsurfing and scuba diving. Hiking to the top of Humbug Mountain is a major activity.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 40 electrical sites with water
\n\t
\n\t\tMore than 55 tent sites with water nearby
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFirewood for sale
\n
\n\n\tUniversal Access\n\tTwo electrical sites are accessible to campers with disabilities.
\n",
      "park_name": "Humbug Mountain State Park",
      "park_id": 40,
      "park_longitude": -124.43124
   },
   {
      "park_latitude": 42.15041,
      "park_narrative": "\n\n
\n\tHeading to or from the Oregon coast or the giant redwoods on Hwy. 199, you may want to stop for a picnic at this day-use park. Located at the confluence of the east and west forks of the Illinois River, the park offers picnic tables and restrooms. There is a short walking trail near the picnic area. The Illinois Valley is a unique geologic area with many rare plants. Visit here to enjoy the natural beauty of the area.

\n",
      "park_name": "Illinois River Forks State Park",
      "park_id": 71,
      "park_longitude": -123.652769
   },
   {
      "park_latitude": 45.341634,
      "park_narrative": "
\n\tSet amidst the stunning backdrop of the Wallowa Mountains, the entire area is part of the ancestral homeland of the Nez Perce Tribe, and is a sacred place to the Nez Perce Tribe, the Confederated Tribes of the Colville Reservation and the Confederated Tribes of the Umatilla Indian Reservation. "Iwetemlaykin" is the Nez Perce name for this area of the Wallowa Lake basin. Pronounced ee-weh-TEMM-lye-kinn, the name translates to "at the edge of the lake." The property is adjacent to a Nez Perce National Historical Park, site of Old Chief Joseph Gravesite and Cemetery.\n\t\n\tShort trails with spectacular views of the Wallowa Mountains pass Knight's Pond, a cool summer oasis and a peaceful respite for hikers. Look for spring and summer wildflowers during your walk. You also may catch glimpses of deer, fox, bear and raptors.

\n",
      "park_name": "Iwetemlaykin State Heritage Site",
      "park_id": 190,
      "park_longitude": " -117.223683"
   },
   {
      "park_latitude": 42.736405,
      "park_narrative": "
\n\tJ. F. Kimball State Park is a pristine site located at the headwaters of the Wood River. This stream flows from the pine forest into open meadow land laced with picturesque quaking aspen surrounded by the southern Cascade Mountains. Wood River offers fine fishing that can be accessed from the park by canoe. Kimball Park offers primitive camping next to a spring-fed lagoon at the beginning of this waterway.

\n
\n\tA walking trail connects the campground to the site where the clear spring bubbles from a rocky hillside. The park is a secluded place where you can contemplate the moment while relaxing in the whispering lodgepole pines.

\n
\n\tCampground info

\n
\n\t
\n\t\t10 primitive sites without water
\n\t
\n\t\tVault toilets
\n
\n",
      "park_name": "Jackson F. Kimball State Recreation Site",
      "park_id": 166,
      "park_longitude": -121.977087
   },
   {
      "park_latitude": 44.133706,
      "park_narrative": "
\n\tJasper Point campground is one of two developed campgrounds at Prineville Reservoir State Park.  It has 27 first-come, first-served campsites with electricity and water hook ups.  The lake is just a short walk from the campsites, with some having water front views.  There are flush toilets and hot showers available.  An RV dump station is on site.

\n
\n\tThe park also has a two lane boat ramp and courtesy dock for boat access to the lake.  A trail head for hiking into the State Wildlife area is located inside the camp.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 30 electrical sites with water
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tBoat ramp
\n\t
\n\t\tRV dump station
\n\t
\n\t\t1¾-mile lakeside hiking trail to main campground
\n
\n\n\tUniversal Access\n\tTwo Campsites accessible to campers with disabilities.
\n",
      "park_name": "Jasper Point (Prineville Reservoir)",
      "park_id": 25,
      "park_longitude": -120.694066
   },
   {
      "park_latitude": 43.989809,
      "park_narrative": "
\n\tJasper State Recreation Site is beautiful riverside park that is very popular for weddings, reunions, and large family picnics. There are 4 reservable group shelters with cooking areas, sinks, picnic tables and flush restrooms nearby.  Ball fields, playground, river access, volleyball and riverside trails provide for plenty of activities for kids and adults alike.

\n
\n\tThe upstream end of the park provides walking trails through a grand riparian forest, with the rush of the river a constant companion.  Angling is popular in this stretch of river, and there is easy access for launching canoes or kayaks to float the Willamette River Water Trail.\n\t 

\n",
      "park_name": "Jasper State Recreation Site",
      "park_id": 178,
      "park_longitude": -122.905264
   },
   {
      "park_latitude": 43.929946,
      "park_narrative": "
\n\tSituated half way up the Oregon coast and three miles south of Florence on scenic Highway 101 is the second largest overnight camp in the state. There are two miles of sand dunes between the park and the ocean. Two natural freshwater lakes are within the park. Cleawox -- which is great for swimming -- and Woahink, which has a public boat ramp, is used for all water sports. Rent a canoe and explore the lake.\n\t\n\tSpring brings out the pink rhododendrons. Come summertime, this is a great place for family reunions. The fall huckleberries and blackberries are ripe for the picking. This a camp for all seasons.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 45 full-hookup sites
\n\t
\n\t\tMore than 120 electrical sites with water
\n\t
\n\t\tMore than 185 tent sites with water nearby
\n\t
\n\t\t10 yurts (one pet-friendly)
\n\t
\n\t\tSix seasonal group tent camping areas
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tFour campsites and two yurts are accessible to campers with disabilities.
\n",
      "park_name": "Jessie M. Honeyman Memorial State Park",
      "park_id": 95,
      "park_longitude": -124.106904
   },
   {
      "park_latitude": 45.617205,
      "park_narrative": "
\n\tJohn B. Yeon Scenic Corridor honors a man who gave generously of his time and professional skills. He was one of the principal architects of the Historic Columbia River Highway (US 30); a major portion of the scenic highway joins I-84 westbound at Yeon State Park.Here is a hiker's paradise with a gentle rising trail that permits access to two of the most beautiful and secluded waterfalls in the Columbia River Gorge: (lower) Elowah Falls and (upper) McCord Creek falls. Elowah Falls is a 289 foot drop over basalt that must be seen to appreciate. The view of the falls and way the tall cliffs jut out at odd angles is nearly disorienting at the bottom of the trail. Most days, the trails are never crowded. The crisp air, easy access and accompanying scenery of this area offer some of the best hiking and viewing opportunities available in the Gorge.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "John B. Yeon State Scenic Corridor",
      "park_id": 114,
      "park_longitude": -121.993101
   },
   {
      "park_latitude": 42.68193,
      "park_narrative": "
\n\tPicture yourself in a campsite overlooking Lost Creek Reservoir with wildlife, large conifer trees, and mountains surrounding you. Take a hike or bike ride on our 11-mile trail system, through the forest with year-round streams and wildlife viewing. Take a swim in the cool, mountain water; rent a boat from the marina (call (541) 560-3646 for information), and troll the 10-mile lake for trout and bass ... an angler's dream. Or bring your own boat and water skis and spend a few days in the sun!\n\t\n\tThe park is about 40 miles from Crater Lake National Park, and makes an excellent jumping-off point for an exploration of Southern Oregon.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 150 electrical sites with water
\n\t
\n\t\tApproximately 50 tent sites with water
\n\t
\n\t\tTwo group tent camping areas
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tVolleyball court
\n\t
\n\t\tRV dump station
\n\t
\n\t\tHorseshoe pits
\n\t
\n\t\tFenced off-leash pet area
\n\t
\n\t\tPlayground
\n\t
\n\t\tEvening programs on Fridays and Saturdays during the summer
\n
\n
\n\t 

\n
\n\t 

\n",
      "park_name": "Joseph H. Stewart State Recreation Area",
      "park_id": 23,
      "park_longitude": -122.6156
   },
   {
      "park_latitude": 44.41866,
      "park_narrative": "
\n\tIf you haven’t seen this place, you need to go.  Originally a Chinese medical clinic, general store, community center and residence, Kam Wah Chung gives you an incomparable glimpse into the past. This remarkable site, a National Historic Landmark, is located in the town of John Day, and includes a museum and a separate interpretive center.

\n
\n\tThe museum was built in the 1870s, possibly as a trading post.  This tiny, unassuming building became home to two Chinese immigrants, Ing “Doc” Hay and Lung On.  Both became locally famous:  Lung On as a general store proprietor and businessman, and “Doc” Hay as a practitioner of herbal medicine.  For 50-some years, the building was a social, medical and religious center for the Oregon’s Chinese community.

\n
\n\tLearn more about Kam Wah Chung by watching an Emmy nominated documentary produced by Oregon Public broadcasting.

\n
\n\tAn ADA-accessible interpretive center across the street from the museum is open daily.  In 2011, the center opened a new exhibit, detailing the life and times of Doc Hay and Lung On.

\n
\n\tMuseum Tours

\n
\n\tOpen daily May 1 - October 31, 9 a.m. - Noon, 1 p.m. - 5 p.m.

\n
\n\tGuided tours only. Tours start at the top of each hour at the Interpretive Center and last about 45 minutes (last tour at 4 p.m.).  Free tickets for the tour can be picked up at the Interpretive Center.

\n",
      "park_name": "Kam Wah Chung State Heritage Site",
      "park_id": 5,
      "park_longitude": -118.95734
   },
   {
      "park_latitude": 45.701631,
      "park_narrative": "
\n\tOnce upon a time -- from about 1915 to about 1950 -- a giant wonderful dance hall and outdoor resort existed at Koberg Beach. When the town of Hood River wanted to cool off or go ballroom dancing to the sounds of a swing orchestra, they went to Koberg Beach. Eventually, the ballroom and the beach had to make way for the rising Columbia River when hydroelectric dams were constructed. For a complete view of the way it was, go see the Koberg Beach exhibit at the Hood River County Museum in Hood River.\n\t\n\tToday, Koberg Beach is a wayside that serves busy westbound motorists on I-84 with a restroom and a stretch break. An enjoyable beach lies behind the great rock which screens its recreational access from the busy freeway.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Koberg Beach State Recreation Site",
      "park_id": 115,
      "park_longitude": -121.474751
   },
   {
      "park_latitude": 45.73905,
      "park_narrative": "
\n\tJust 34 miles west of Portland, you’ve got the best backyard imaginable. Campers, hikers, cyclists or equestrians can spend their days exploring and adventuring across 1,800 acres of rolling hills, forest glades, gleaming streams and wildflowers, all crisscrossed with over 25 miles of trails.

\n
\n\tStub Stewart is close enough for a perfect day trip. Enjoy a family gathering before magnificent views of the Coast Range at Hilltop Day-use Area, or embark on a journey from either of two trailheads – Hilltop or Clayhill to the north, with its horse staging area – and spend a few wide-eyed hours discovering the forest. The multi-use trails, plus 6 miles of cross-country and free-ride mountain bike trails, range from easy and forgiving to robust and challenging, all with ample opportunity for wildlife viewing and immersion in the scenery.

\n
\n\tAn 18-hole disc golf course winds its way through the trees just east of Hilltop, and a 3-hole course is near the amphitheater. Buy discs at the Stub Stewart Welcome Center, where bike helmets, water bottles and more are for sale. Stop by the Discovery Depot, where information awaits on the area's flora, fauna, and park history.  The Discovery Depot is open daily from 11am-4pm. 

\n
\n\tCampground info

\n
\n\tFirewood for sale from 5-8pm, $5, exact change appreciated

\n
\n\tDairy Creek Camp West (year-round)

\n
\n\t
\n\t\t40+ full-hookup sites
\n\t
\n\t\t12 walk-in tent sites, water nearby
\n\t
\n\t\tFlush toilets & hot showers
\n\t
\n\t\tIce for sale from 5-8pm, $2 per bag
\n
\n
\n\tDairy Creek Camp East (March 1–Oct. 31)

\n
\n\t
\n\t\t~35 full-hookup sites
\n\t
\n\t\tFlush toilets & hot showers
\n\t
\n\t\tPlayground
\n
\n
\n\tHares Canyon Horse Camp (March 1–Oct. 31)

\n
\n\t
\n\t\t13 full-hookup sites/four-stall corrals
\n\t
\n\t\tTwo double-size full-hookup sites/six-stall corrals
\n\t
\n\t\tManure bins
\n\t
\n\t\tFlush toilets & hot showers
\n
\n
\n\tBrooke Creek Hike-in Camp (year-round)

\n
\n\t
\n\t\t23 primitive campsites, water nearby
\n\t
\n\t\tCommon areas with fire rings
\n\t
\n\t\tVault toilets
\n
\n
\n\tMountain Dale Cabin Village (year-round)

\n
\n\t
\n\t\t3 double-room cabins (cabin 6 is pet friendly)
\n\t
\n\t\t12 single-room cabins (cabins 7 & 8 are pet friendly)
\n\t
\n\t\tFlush toilets & hot showers in cabin village restroom
\n
\n\n\tUniversal Access\n\t3 sites at Dairy Creek West and 2 sites at Dairy Creek East designated as accessible to campers with disabilities. Thirteen cabins ADA accessible.
\n",
      "park_name": "L.L. Stub Stewart State Park",
      "park_id": 75,
      "park_longitude": -123.199461
   },
   {
      "park_latitude": 43.7939796,
      "park_narrative": "
\n\tCampgrounds Open, Day Use OPEN

\n
\n\tLake Owyhee State Park is a remote oasis catering to camping and boating on the shore of a scenic desert canyon reservoir. 

\n
\n\tOwyhee Reservoir is a 53-mile-long lake, filling a narrow, deep canyon brimming with colorful volcanic rock formations.  Many boaters return year after year to explore the desert canyon and rugged mountains. Some of the geology is visible only by boat.  Anglers are awarded with excellent warm water catches, especially for largemouth bass, white and black crappie.  The reservoir also has catfish and is occasionally stocked with rainbow trout.  The Indian Creek campground and the Gordon Gulch Day-use area have boat ramps.  Another ramp is near the dam.  Marine fuel, firewood and ice are available for sale.\n\t\n\tThe road to Lake Owyhee Reservoir is a very scenic and picturesque drive, but please drive cautiously. The roadway is narrow and moderately steep. Drive slowly and be prepared to yield to other campers and boats as you enter and leave this recreation area.

\n
\n\tFollow park rules and boating safety regulations.  The nearest emergency services are 33 miles away, in Nyssa. The closest hospital is in Ontario, and about an hour's drive from the park.

\n
\n\tCurrent boat ramp info - Updated 5-22-2015

\n
\n\tLake Owyhee is currently less than 22% full. 

\n
\n\t
\n\t\tMcCormack: CLOSED due to low water levels
\n\t
\n\t\tGordon Gulch: CLOSED due to low water levels
\n\t
\n\t\tIndian Creek: OPEN - ( this is the only boat launch available. The county boat ramp near the dam is also closed at this time)
\n
\n
\n\tCheck the Bureau of Reclamation website for current water levels, check current conditions at bottom of page

\n
\n\tCampground info

\n
\n\tCampgrounds are closed from November-April 15.

\n
\n\tMcCormack Campground

\n
\n\t
\n\t\tApproximately 29 electrical sites with water
\n\t
\n\t\tApproximately eight tent sites with water nearby
\n\t
\n\t\tTwo tepees (open May 1)
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tRV dump station
\n\t
\n\t\tFirewood for sale
\n
\n
\n\tIndian Creek Campground

\n
\n\t
\n\t\tMore than 25 electrical sites with water
\n\t
\n\t\tFive primitive tent sites with standing barbecues
\n\t
\n\t\tBoat ramp
\n\t
\n\t\tMarine fuel and ice
\n
\n\n\tUniversal Access\n\tMcCormack has two campsites and one tepee are accessible to campers with disabilities. Two campsites at Indian Creek are accessible to campers with disabilities.
\n",
      "park_name": "Lake Owyhee State Park",
      "park_id": 10,
      "park_longitude": -117.136734
   },
   {
      "park_latitude": 43.768452,
      "park_narrative": "
\n\tIf you want to immerse yourself in a subalpine pine forest where the air has that high-Cascades tang; to stay in a clean, quiet campground next to a twisting, cold river brimming with trout (and a nearby legendary fly fishing spot) and surrounded by miles of waiting-to-be-explored wilderness; to sit smack in the middle of dozens of high-mountain lakes (in winter, near some of the best ski-spots in the land); to see eagles or red-tailed hawks grabbing breakfast right in front of you; or, to just sit in a campsite pondering what you might do tomorrow ...

\n
\n\t... then LaPine State Park demands a visit.\n\t\n\tThe park is also home to Oregon's largest ponderosa pine. Nicknamed "Big Red," the tree is 162' tall, 28.9' around and may be in excess of 500 years old.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 80 full-hookup sites
\n\t
\n\t\tMore than 45 electrical sites with water
\n\t
\n\t\tFive rustic log cabins (one pet-friendly)
\n\t
\n\t\tFive deluxe log cabins (one pet-friendly)
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tLog cabin meeting hall
\n\t
\n\t\tPark store (seasonal)
\n\t
\n\t\tFirewood and ice sales (seasonal)
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tAll of the deluxe cabins and one rustic cabin are accessible to campers with disabilities (winter accessibility varies).
\n",
      "park_name": "LaPine State Park",
      "park_id": 32,
      "park_longitude": -121.513399
   },
   {
      "park_latitude": 45.540962,
      "park_narrative": "
\n\tLocated at the western gateway of the Columbia River Gorge, Lewis & Clark State Park appropriately honors its legendary namesakes who camped and explored here in November, 1805. The park is situated near the mouth of the Sandy River where it spills into the mighty Columbia River and at one of the entrances to the Historic Columbia River Highway. A flat, grassy, tree-dotted park invites blankets and sun-lovers to come spend a leisurely day.

\n
\n\tOne of the most popular swimming spots on the Sandy River is adjacent to the park, as well as a public boat launch. A trail climbs the cliffs to Broughton's Bluff, which serves as a geologic boundary between the foothills of the Cascade Mountain Range and the neighboring Willamette Valley to the west.

\n
\n\t 

\n
\n\tCurrent Park Hours 6 am -10 pm\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Lewis and Clark State Recreation Site",
      "park_id": 116,
      "park_longitude": -122.379713
   },
   {
      "park_latitude": 44.543802,
      "park_narrative": "\n
\n\tLost Creek State Park is located seven miles south of Newport, Oregon. The park is developed for picnicking and beach access. Great for beachcombing, whale watching and incredible sunsets.\n\t 

\n",
      "park_name": "Lost Creek State Recreation Site",
      "park_id": 145,
      "park_longitude": -124.073977
   },
   {
      "park_latitude": 43.923027,
      "park_narrative": "
\n\tLowell State Recreation Site sits on the North shore of Dexter Lake, next to the city of Lowell.  This day use park has it all!  A reservable picnic shelter overlooks the lake and a wooded picnic area.  A playground, basketball court, and flush restroom are all nearby.  Down by the water is a large lawn area with picnic tables and a swim beach.  For the boaters, there is a marina with rentable moorage, a large courtesy dock and a 4 lane launch ramp.

\n
\n\tSailboats, water skiers, anglers, paddlers and rowers take advantage of the full lake levels maintained year round.  Oregon Association of Rowers and the University of Oregon have boathouses at the park, and host Regattas (rowing races) each spring.  If you're looking for a bit more speed, check out the drag boat races at the park each summer!

\n
\n\tOn the quieter side, wildlife abounds at the lake with bald eagles frequently sighted in the park.  Migratory waterfowl are plentiful on the lake in the winter, and are a bird watcher's delight.

\n",
      "park_name": "Lowell State Recreation Site",
      "park_id": 177,
      "park_longitude": -122.796626
   },
   {
      "park_latitude": 44.715336,
      "park_narrative": "
\n\tRivers, paddles, ponds and trails - Luckiamute Landing is nature's water park.

\n
\n\tThe Luckiamute River meanders through the 615-acre north tract, flowing into the Willamette River from the west and just a stone's throw from the Santiam River confluence from the east. Travelers paddling the Willamette Water Trail can camp at the boater access only site. If you don't have a canoe or kayak, the North Trailhead opens nearly 3 miles of hiking trails along a meadow and through a riparian hardwood forest of Oregon ash and bigleaf maple.\n\t\n\tThe 300-acre south parcel is a great place for wildlife viewing and fishing (although the pond is not stocked). Park at the South Trailhead and make the 1/2 mile trek to the West Pond. See if you can catch a glimpse of Western Pond Turtles at the north end. The pond is an old gravel pit, but good habitat for turtles. An Oregon native, the turtle is dark green or brown with cream and brown flecks on its neck and head. The population of western pond turtles is declining because their native habitat is disappearing. The turtles are included on Oregon's Sensitive Species List.\n\t\n\tHabitat is a key reason why Luckiamute Landing exists. Low-impact activity like paddling and hiking complement the effort to restore natural flood plains. You might not see them, but the park has remnants of abandoned river channels and natural levees, wetlands and native animals and plants. Work is under way to restore how the floodplain functions and connects the habitats of native fish, reptiles, amphibians, birds and mammals.

\n
\n\tOregon Parks and Recreation Department has developed a great partnership with the Luckiamute Watershed Council for Habitat Restoration in Luckiamute Landing S.N.A.   As of March 2012, over 200 acres of noxious vegetation has been eradicated and 300,000 native shrubs and trees planted in conjunction with the Luckiamute Watershed Council.  To learn more, click on the following link: http://www.luckiamutelwc.org/

\n
\n\t\n\tPlease obey all restoration, habitat and private property signs.

\n",
      "park_name": "Luckiamute Landing State Natural Area",
      "park_id": 192,
      "park_longitude": -123.163006
   },
   {
      "park_latitude": 45.6430555,
      "park_narrative": "
\n\tYou'll find this day-use park just off of Highway 101 north of Rockaway. Picnic tables are nestled into small cul-de-sacs surrounded by shore pine to provide a break from the wind. After a leisurely lunch, kick off your shoes and take the short walk down the access trail to the ocean beach. A thoroughly relaxing spot.

\n",
      "park_name": "Manhattan Beach State Recreation Site",
      "park_id": 138,
      "park_longitude": -123.940277
   },
   {
      "park_latitude": 44.755555,
      "park_narrative": "
\n\tThe Maples Rest Area is the only rest area between Sisters, Oregon and Salem. It is a well- maintained rest stop with large grass lawns and a pet exercise area. There is plenty of parking for every type of vehicle including RVs. There are picnic tables for visitors convenience. There is easy access and egress to Highway 22, the main route through the Cascade Mountains.

\n",
      "park_name": "Maples Rest Area",
      "park_id": 62,
      "park_longitude": -122.3875
   },
   {
      "park_latitude": 45.095267,
      "park_narrative": "
\n\tMaud Williamson occupies a flat edge of cultivated Willamette Valley farm land on the west side of the Salem-Dayton highway. It's covered by a fine stand of second-growth Douglas fir. The park also includes a historic farm house once occupied by the person who donated the property as a park.

\n
\n\tThe park provides a covered picnic shelter which can be reserved for group picnics. Volleyball and horseshoes are available at this site. Large Douglas fir trees tower overhead providing excellent wildflower viewing in the early spring. Trilliums are abundant here.

\n",
      "park_name": "Maud Williamson State Recreation Site",
      "park_id": 97,
      "park_longitude": -123.067154
   },
   {
      "park_latitude": 45.674904,
      "park_narrative": "
\n\tIf you need an open invitation to go explore a peaceful tree-lined lake in the summertime, consider yourself invited. Go see lower Mayer State Park from the top of Rowena Crest and soak in a view of the most beautiful lake around. Both are actually within Mayer State Park, but few people know that.

\n
\n\t\n\tFrom the top of Rowena, Mayer can be fully appreciated for its many amenities, including swimming, boating, fishing and picnicking. When the spring wildflowers are in bloom, this is one of the most stunning vistas in the Columbia River Gorge. The timing of the bloom varies, but is normally in March/April.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Mayer State Park",
      "park_id": 117,
      "park_longitude": -121.273994
   },
   {
      "park_latitude": 42.01916,
      "park_narrative": "
\n\tMcVay is a well-hidden park noted for surf fishing, clamming, whale watching, and plenty of space to walk on the beach.  The large lawn area is great for blanket picnics and disc golf. The park is elevated above the ocean.  As you walk along the edge, you'll often have eye-to-eye encounters with the seabirds catching the updrafts from the beach.  McVay is also home to the only "off leash" dog park in the Brookings area.  Local scouts built the fenced-in area with oversight and guidance from State Park personnel.

\n",
      "park_name": "McVay Rock State Recreation Site",
      "park_id": 54,
      "park_longitude": -124.231914
   },
   {
      "park_latitude": 45.695222,
      "park_narrative": "
\n\tThe Chinook Indian tribes of the Columbia Gorge used to lay the bones of their dead on open pyres on Memaloose Island in the middle of the Columbia River near The Dalles. A granite monument visible from Memaloose State Park campground marks the resting place where a local pioneer named Victor Trevitt wished to chart his eternal course buried among honorable men.\n\t\n\tToday, Memaloose State Park is a virtual oasis of beauty in the hottest part of the Columbia River Gorge. Temperatures can top 110 F on a summer day, but Memaloose always manages to provide cool comfort, lush green grass and shade thanks to the tall maples and willows that loom large in the park. The sound of pulsating sprinklers provides a melodic nighttime rhythm to the counterpoint of chirping crickets and lonesome train whistles. Explore the nearby Historic Columbia River Highway State Trail. Historic Columbia River Highway and State Trail bicycle and hiking map\n\t\n\tOn summer nights, families select prime viewing spots on the cool grass and open meadows around the campground and observe the nightly celestial performances of shooting stars, wandering satellites and far away galaxies.

\n
\n\tPlease be aware that there is no safe or legal river access at Memaloose

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 40 full-hookup sites
\n\t
\n\t\tMore than 65 tent sites with water nearby
\n\t
\n\t\tFlush toilets/showers
\n\t
\n\t\tRV dump station
\n
\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Memaloose State Park",
      "park_id": 118,
      "park_longitude": -121.3362411
   },
   {
      "park_latitude": 45.298221,
      "park_narrative": "
\n\tSituated along the scenic Clackamas River, Milo McIver State Park is only 45 minutes from Portland. This beautiful park provides a variety of outstanding recreational opportunities.\n\t\n\tWithin this little-known gem, you can spend a day or a week exploring the river, forest and fields. River-lovers can challenge the sometimes wild (but always picturesque) Clackamas River with rafts, canoes or kayaks.

\n
\n\tDo you enjoy fishing?  The Estacada Lake offers a boat ramp and an ADA fishing dock, and the Clackamas River has Steelhead and Chinook runs.  The Clackamas Fish Hatchery is located at McIver Park, and self-guided tours of the hatchery guide visitors through the life-cycle of Chinook salmon and Steelhead.\n\t\n\tPrefer to stay dry? You can hike, or ride your horse. Still too sweaty for you? Spend a lazy afternoon playing the year-round, 27-hole disc golf course. Discs are available at the park office to rent or buy.\n\t\n\tIf you're planning a special gathering, reservable picnic sites with a shelter are available. If you just need to get away for a while, individual and group campsites are waiting for you. When staying at McIver during the summer, we have family-oriented interpretive programs -- from guided hikes to nature crafts.\n\t\n\tMcIver State Park offers something for everyone. See you there!

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 44 electrical sites with water
\n\t
\n\t\tNine tent sites with water nearby
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tThree group tent camping
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tOne campsite is accessible to campers with disabilities.
\n",
      "park_name": "Milo McIver State Park",
      "park_id": 102,
      "park_longitude": -122.382924
   },
   {
      "park_latitude": 45.621308,
      "park_narrative": "
\n\tThis park is located in a remote steep valley. Large pine trees dominate the landscape. The picturesque Wallowa River flows through the park and is noted for its fishing and rafting. Steelhead fishing in the spring and fall attracts many people. Wildlife is abundant; deer, bear, elk and an occasional cougar are seen in the area. Raft rentals are available at a nearby store and with a trip down the river, you could even see Rocky Mountain bighorn sheep. A wide variety of flowers bloom in the spring.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 20 primitive sites with water
\n\t
\n\t\tVault toilet
\n\t
\n\t\tRiver rafting access
\n\t
\n\t\tRiverside trail for anglers
\n
\n",
      "park_name": "Minam State Recreation Area",
      "park_id": 19,
      "park_longitude": -117.724854
   },
   {
      "park_latitude": 45.294863,
      "park_narrative": "
\n\tImagine combining a scenic drive, hiking, picnicking, fishing, boating, and wildlife viewing and a ferry ride all in one location. You can do it all at Molalla River State Park near Canby, Oregon.\n\t\n\tThis natural area sits at the confluence of the Willamette, Molalla and Pudding rivers. The flood plains of these rivers provide important habitat for waterfowl, wading birds, deer, small mammals, reptiles and amphibians. One of the largest blue heron rookeries in the Willamette Valley is located here.\n\t\n\tMolalla River State Park has grassy field areas for picnics and games and a pet exercise area where you can let your dog run off leash. Fishing is a popular activity, and a boat ramp gives you convenient river access. No boat? You can cross the river on the Canby Ferry, located a quarter mile downstream. It's one of three ferries still in operation on the Willamette River. Fruit, vegetable and flower stands abound seasonally in some of the finest farmland in Oregon.

\n",
      "park_name": "Molalla River State Park",
      "park_id": 78,
      "park_longitude": -122.696058
   },
   {
      "park_latitude": 44.710206,
      "park_narrative": "
\n\t\n\tMongold Day Use area is 1.5 miles west of Detroit Lake State Park. It's the only public boat launch facility on the lake featuring a swimming area, grass beach, picnic facilities and restrooms. Mongold is a year-round fee area.\n\t\n\tMongold has 58 single car parking spaces and three fully-accessible parking spaces near the swimming area, and another 25 single car parking spaces at the top of the parking lot. There are 120 vehicle/trailer parking spaces, and three that are accessible to people with disabilities.\n\t\n\tOvernight parking at Mongold is permitted only when the visitor is camping on Piety Island.

\n",
      "park_name": "Mongold (Detroit Lake)",
      "park_id": 63,
      "park_longitude": -122.198212
   },
   {
      "park_latitude": 45.365364,
      "park_narrative": "
\n\tThe park is home to ancient western red cedar and Sitka spruce. An important salmon spawning ground, Munson Creek Falls tumbles 319', making it the tallest waterfall in the Coast Range. A short trail winds along Munson creek to the waterfall. During the late fall through the winter watch the waters for spawning salmon.

\n",
      "park_name": "Munson Creek Falls State Natural Site",
      "park_id": 175,
      "park_longitude": -123.804079
   },
   {
      "park_latitude": 44.174217,
      "park_narrative": "
\n\tPicnicking with whale watching, beachcombing and a view of the beach. There are approximately five miles of sandy beach with China Creek to the south of the park. J.C Ponsler donated the land in 1938 in memory of his wife, Muriel.

\n",
      "park_name": "Muriel O. Ponsler Memorial State Scenic Viewpoint",
      "park_id": 87,
      "park_longitude": -124.1156
   },
   {
      "park_latitude": 45.70948,
      "park_narrative": "
\n\tApril 2015: Shorebirds are nesting on the spit south of the day-use area. Please let them nest in peace and follow the posted instructions. More Information

\n
\n\tNestled between the ocean and the bay, Nehalem Bay State Park is situated on a 4 mile long sand spit.  Located 86 miles west of Portland along the north Oregon Coast, Nehalem Bay State Park features a campground, two day-use areas and a variety of activities for the whole family.  

\n
\n\tSituated among a sea of shore pines, the campground borders rolling dunes that separate the campground from the beach.  A walk over the dunes and you’re at the beach building sand castles, flying a kite or relaxing to the sound of the ocean.  Beach-combing can produce special rewards – treasures that include agates, shells, and occasionally glass floats.  End the day with a sun set over the ocean in the shadow of Neah-kah-nie Mountain. 

\n
\n\tA forested 1.8 mile long bike path provides a breathtaking view of the bay for recreation and wildlife enthusiasts. Along this route, and in the campground, you may see deer grazing, a herd of elk, a coyote crossing the road and a variety of birds.  Kayaking, crabbing, fishing, and clamming are also popular past times. 

\n
\n\tPark features include a 2,400 foot airstrip that offers the unique opportunity of a fly-in camp.  A hiker-biker camp is ready for hikers and bikers traveling up and down the coast.  Yurts are available as an alternative camping experience. Primitive horse camp sites offer horse enthusiasts a place to camp with several miles of trails and beach to explore.  A horse concession is located in the beach-side day-use area during the summer months. 

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 265 electrical sites with water
\n\t
\n\t\t18 yurts (two pet friendly)
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tHorse camp with 17 primitive sites
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tAirport camp with primitive fly-in sites
\n\t
\n\t\tRV dump station
\n\t
\n\t\tMeeting hall
\n\t
\n\t\tCampsites A13, A30 & A44 and yurts are accessible to campers with disabilities.  Accessible restrooms are in loops A and F, the Meeting Hall and day-use areas.
\n
\n
\n\tDay-use Areas

\n
\n\tTwo day-use areas offer access to bay or ocean, restrooms and picnic areas that include tables and fire rings.  Bay-side day-use includes a boat ramp.  Docks are seasonal, so check with park ahead of time.  Ocean-side day-use offers a horse corral and a horse concession (website: http://oregonbeachrides.com, phone: 971-237-6653).

\n",
      "park_name": "Nehalem Bay State Park",
      "park_id": 142,
      "park_longitude": -123.936526
   },
   {
      "park_latitude": 44.254073,
      "park_narrative": "
\n\tNeptune State Scenic Viewpoint encompasses four pull offs from Highway 101. 

\n
\n\tThe northernmost does not have an official name but is located next to Gwynn Creek.  This spot offers access to a small isolated beach and plenty of grass for a picnic.

\n
\n\tThe next spot is labeled Neptune.  Benches set on a cliff above the beach give you an excellent view of Cummins Creek, wildlife and the rock-pounding waves. From this location, you can watch for whales, see a variety of birds, sea lions and the occasional deer in the creek. The creek is also a great place to look for agates. At low tide you can walk to the south to see a natural cave and tidepools.

\n
\n\tOne more stop to the south is Strawberry Hill.  This spot has excellent views of the ocean and a series of stairs that lead down to excellent tide pools and sandy beaches.  During sunny days, harbor seals can be seen sunning themselves on the rocks just off shore.

\n
\n\tThe final stop is Bob Creek.  This stop offers beach access and agate hunting.

\n",
      "park_name": "Neptune State Scenic Viewpoint",
      "park_id": 88,
      "park_longitude": -124.111421
   },
   {
      "park_latitude": 45.10024,
      "park_narrative": "
\n\tThe long beach and Cascade headland are delightfully pristine. In the town of Neskowin, you'll find a general store, restaurant and two golf courses amid the lovely ocean cottages. A bit north, you can canoe and kayak on the relatively undeveloped estuary of Nestucca Bay.

\n
\n\tThere are three stunning trails nearby on Cascade Head. The Nature Conservancy Trail #1435 is usually open year-round and can be easily accessed at Knight's Park (who knows ... you may catch a glimpse of some elk).

\n
\n\tThe next two are USFS trails in the Siuslaw National Forest. Hart's Cove Trail #1303 descends about 900 feet in elevation through a Sitka Spruce-Western Hemlock rain forest, crosses two seasonal creeks and ends at a prairie headland overlooking the Pacific Ocean. Chitwood Falls cascades off the backside cliff at Hart's Cove. An unseen cove to the south resounds with the barking of sea lions. This trail closes seasonally from January 1st through July 15th.

\n
\n\tCascade Head Trail #1310 runs north to south within the Cascade Head Scenic Research Area. The Sitka Spruce-Western Hemlock rain forest here has been studied by foresters since 1934.

\n
\n\tThis trail is less crowded than the other two popular trails in the area – it is entirely inland and has no view points. Mid-way on the trail near the headwaters of Calkins Creek there remains a grove of six-foot diameter Sitka spruce. Trail has a forested backdrop with large Sitka spruce, Western hemlock, Douglas fir and Red alder. The north end of the trail (north of Forest Service Road 1861) is closed for public safety due to tree hazards.

\n
\n\tCascade Head Trails Map (opens in PDF document)

\n
\n\tYou can also check out the Neskowin Farmers Market in the wayside, from Memorial Day through Labor Day. Visit their Facebook page for updates.

\n",
      "park_name": "Neskowin Beach State Recreation Site",
      "park_id": 161,
      "park_longitude": -123.981241
   },
   {
      "park_latitude": 44.77,
      "park_narrative": "
\n\tNorth Santiam State Park plays host to some of the most beautiful riverfront in the area. It is one of the finest steelhead fishing spots on the North Santiam River. North Santiam State Park is a primitive campground and day-use area with drinking fountain and restroom facilities. Picnic tables dot the grass, making North Santiam State Park a great place to stop to stretch and eat a picnic lunch. Hiking trails show the beauty of the large old-growth trees and the river.

\n
\n\tCampground info

\n
\n\t
\n\t\tNine walk-in, boat-in tent sites, one accessible to campers with disabilities
\n\t
\n\t\tEasy river access for boating/fishing
\n\t
\n\t\t2.4 miles of trails
\n\t
\n\t\tReservable group picnic area with shelter
\n\t
\n\t\tTen picnic sites
\n\t
\n\t\tHorseshoe pits
\n
\n",
      "park_name": "North Santiam State Recreation Area",
      "park_id": 64,
      "park_longitude": -122.563
   },
   {
      "park_latitude": 42.206592,
      "park_narrative": "
\n\tWelcome to the OC&E Woods Line State Trail -- Oregon's longest linear park! This 100-mile, rail-to-trail conversion is built on the old railbed of the Oregon, California, and Eastern Railroad. The trail is open for all non-motorized recreation, beginning in the heart of Klamath Falls, extending east to Bly and north to the lush Sycan Marsh. From its beginnings as a railroad carrying millions of board feet of timber and railcars loaded with cattle, to its present cargo of recreational trail users, this railroad line has always been on the move.

\n
\n\t\n\tThe OC&E Woods Line State Trail is paved from the Klamath Falls Trailhead to the small, rural community of Olene. This makes a total of 8 miles of paved trail surface where you can bike, jog, skate, and ride horseback. Here, you'll experience the historic 1898 steel bridge spanning the A Canal and imagine the feel of an old-time steam engine crossing its riveted beams.

\n
\n\tFrom Highway 39, an unpaved trail emerges into a wonderful mixture of ranch lands, rivers, and forested buttes. All the original trestles are still in place, as well as unique engineering feats such as the double switchback.This portion of the trail is more rugged and attracts mountain bikers, avid hikers, anglers, equestrian users, and wildlife watchers. From Beatty to the Sycan Marsh, trail users are in a national forest, with its lofty ponderosa pines, lively streams, and Horse Glade Trailhead camping. This section is host to the 400-foot-long Merritt Creek Trestle. Cross-country skiers will be delighted to find snowfall in the area is consistent. Sycan Marsh is an attraction for bird watchers.\n\t\n\tExploring the OC&E Woods Line State Trail is always an adventure.

\n",
      "park_name": "OC and E Woods Line State Trail",
      "park_id": 167,
      "park_longitude": -121.7516821
   },
   {
      "park_latitude": 44.636283,
      "park_narrative": "
\n\tOregon's shoreline is a geologic mix of sandy beaches, rocky shores and towering capes rising from the sea. All of it -- stretching from the Columbia River south to the Oregon/California border and between the vegetation line and extreme low tide -- is waiting for you to take a stunning walk along the edge of the Pacific Ocean. See the History/FAQ page to learn why Oregon's beaches are open to everyone to explore.

\n
\n\tTurn your walk on the beach into a hike on the Oregon Coast Trail. The trail spans 382 miles, mostly on the beach and through state parks. Whether you are on a through-hike or a casual beach walk, stop and explore the vibrant life in tidepools. Looking for a great tidepool area? Take a look at the map on our Oregon Tidepool website, which also includes a species guide and trip tips. Want to check out more photos of Oregon's ocean shoreline? Check out our Ocean Shore Scenery Flickr album.

\n
\n\tWhether you're picnicking, soaking up the sun or watching a spectacular sunset, make sure your trip is a safe one. Learn about sneaker waves, rip tides and drift logs on our Beach Safety pages.

\n",
      "park_name": "Ocean Shore State Recreation Area",
      "park_id": 193,
      "park_longitude": -124.06483
   },
   {
      "park_latitude": 45.461173,
      "park_narrative": "
\n\tLocated in the center of the community of Oceanside, this park offers some of the best agate hunting during the winter season when the sand is stripped away by ocean currents. During the summer season the park is a popular place to beachcomb, explore tidepools and surf.\n\t\n\tThe sky above the park is occasionally filled with colorful hang gliders, paragliders and kites.

\n",
      "park_name": "Oceanside Beach State Recreation Site",
      "park_id": 132,
      "park_longitude": -123.970468
   },
   {
      "park_latitude": 44.050557,
      "park_narrative": "\n\n
\n\tOntario State Recreation Site is a restful day-use park situated on the west bank of the historic Snake River just north of Ontario, Oregon. Green grass, clean grounds, and modern restrooms greet visitors stopping to boat, fish, swim or picnic for the day. Majestic cottonwood trees, sumac and fragrant junipers offer large splashes of shade to cool the hot summer days and provide startling color in the autumn.\n\t\n\tWhether you are a serious naturalist or a casual visitor, Ontario is a great place to enjoy bird watching and other wildlife. Blue heron, Canada geese, river otter, and muskrat are found in the reeds and grass along the shores of the Snake River. Deer feed on a nearby island and are sometimes visible in the early morning mist. Bring your binoculars, picnic basket, boat or fishing pole. Ontario State Recreation Site can be a day away from it all.

\n",
      "park_name": "Ontario State Recreation Site",
      "park_id": 3,
      "park_longitude": -116.975821
   },
   {
      "park_latitude": 45.775274,
      "park_narrative": "
\n\tStretching along four miles of coastline in dense, temperate rainforest, Oswald West State Park has a beautifully secluded sandy beach and miles of trails leading to breathtaking views of the Pacific Ocean.  This vast, scenic treasure is without a doubt one of the most spectacular parks in Oregon.  Located two hours west of Portland on the north Oregon Coast, Oswald West State Park is popular with surfers, hikers and beach goers and has much to offer in the way of recreation. 

\n
\n\tA popular beach that’s alive with activity on any weekend or summer day, Short Sand Beach lies sheltered in a cove blanketed by forests and edged with volcanic basalt and sandstone cliffs characteristic of the Oregon coastline.   Nicknamed “Shorty’s” by locals, the beach is just a half mile walk through the woods.  From the main parking lot, walk under Highway 101, and down the trail, following the contours of Short Sand Creek through the forest.  Cross the creek on a railroad-style bridge and you’ll find yourself at a beautiful picnic area overlooking the beach. 

\n
\n\tOswald West State Park offers miles of hiking trails in this 2,484 acre park.  A 13-mile stretch of the Oregon Coast Trail weaves its way through the entire park, starting at the community of Arch Cape and extending south towards the town of Manzanita.  Two prominent headlands, Cape Falcon and Neah-kah-nie Mountain are included in the park and offer great hikes.  Park in one of four parking lots along Highway 101 and enter one of the best preserved coastal rainforests in Oregon.  Low-growing ferns, salal and salmonberry are shaded by massive western red cedar, western hemlock and Sitka Spruce trees that form the basis of the temperate coastal rainforest ecosystem of the Northwest.  Oswald West does not offer camping.

\n",
      "park_name": "Oswald West State Park",
      "park_id": 139,
      "park_longitude": -123.945556
   },
   {
      "park_latitude": 44.760809,
      "park_narrative": "
\n\tCURRENT GIFT SHOP HOURS: Wednesday through Sunday from 10AM - 5 PM

\n
\n\tSoak in the view from 500' above the ocean on the breathtaking crescent sweep of white sandy beach stretching to the south. Cape Foulweather is stunning and inspirational with its picturesque panoramic views. This popular whale watching spot also provides a good view of the Devil's Punchbowl.

\n",
      "park_name": "Otter Crest State Scenic Viewpoint",
      "park_id": 162,
      "park_longitude": -124.065195
   },
   {
      "park_latitude": 42.461936,
      "park_narrative": "
\n\tExcellent walking and hiking trails overlooking pristine beaches and unusual sandstone rock formations sculpted by wind and waves.

\n",
      "park_name": "Otter Point State Recreation Site",
      "park_id": 41,
      "park_longitude": -124.418638
   },
   {
      "park_latitude": 42.760349,
      "park_narrative": "
\n\tA parking area with an expansive coastal vista stretching from Port Orford Heads to Orfords offshore reef and distant Cape Blanco and the lighthouse there. The beach is great for beachcombing; it's not unusual to find floats and agates here.

\n",
      "park_name": "Paradise Point State Recreation Site",
      "park_id": 42,
      "park_longitude": -124.516021
   },
   {
      "park_latitude": 44.391825,
      "park_narrative": "
\n\t\n\t 

\n
\n\tIf you enjoy vertical basalt cliffs and scenic river canyons, the Ogden Wayside is for you. The park is perched at the top of a striking canyon. Bring a camera!

\n",
      "park_name": "Peter Skene Ogden State Scenic Viewpoint",
      "park_id": 35,
      "park_longitude": -121.192778
   },
   {
      "park_latitude": 44.059712,
      "park_narrative": "
\n\tCome and explore an old cinder cone located just east of Bend. Hike up and around on one of three trails. The trails wind through stands of juniper and sage. All of the trails lead to the summit. Once at the top, get ready for a grand panoramic view of the high desert.

\n
\n\t\n\tTo the west at sunset, the glow of snowcapped Cascade mountains put on a spectacular show. Three Sisters, Mt. Jefferson, Black Butte and Mt. Hood are some of the highlights.

\n",
      "park_name": "Pilot Butte State Scenic Viewpoint",
      "park_id": 33,
      "park_longitude": -121.288275
   },
   {
      "park_latitude": 42.275341,
      "park_narrative": "
\n\tPistol River State Park is set in the dunes of the southern Oregon coast.  The river supposedly got its name when a militia soldier lost his pistol in the river during the infamous Rogue River Indian War.  In March of 1856, a decisive battle was fought here.

\n
\n\tThe dunes and the river system that feeds them are what make this area unique.  During the spring and summer months, the dunes actually grow.  The river has changed its course numerous times in recent history and pothole ponds attract waterfowl and shorebirds making this is an excellent birding locale.  Ocean windsurfing is so good here it has become the location for several national championships.\n\t 

\n",
      "park_name": "Pistol River State Scenic Viewpoint",
      "park_id": 55,
      "park_longitude": -124.40309
   },
   {
      "park_latitude": 42.73955,
      "park_narrative": "
\n\tThe Port Orford Lifeboat Station was constructed in 1934 by the Coast Guard to provide lifesaving service to the southern portion of the Oregon Coast until 1970. A museum, operated by the Cape Blanco Heritage Society, is now housed in the station. The museum is free (donations accepted, of course). A 36-foot motor lifeboat used at this station is on the premises and waiting to be restored.  The museum is open Wednesday - Monday 10 a.m.-3:30 p.m.

\n
\n\tThe park has excellent hiking trails on the headlands affording spectacular views up and down the Pacific Coast.\n\t\n\tThere's a large resident blacktail deer population; please treat them as the wild animals they are.

\n",
      "park_name": "Port Orford Heads State Park",
      "park_id": 43,
      "park_longitude": -124.510312
   },
   {
      "park_latitude": 45.533408,
      "park_narrative": "
\n\tThe view is absolutely breathtaking and it's one of the best spots to soak in a view of one of the most beautiful places on earth: the magnificent, awesome Columbia River Gorge. Any visit to the Gorge would be nearly perfect with Women's Forum as the starting place to a fun-filled day of adventure and discovery. With the scenic Vista House and the wide expanse of the Columbia Gorge in the background, more photographs of the Columbia Gorge are probably taken from this point than anywhere else (but don't let that stop you ... go ahead and take a few shots of your own).

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Portland Women's Forum State Scenic Viewpoint",
      "park_id": 119,
      "park_longitude": -122.260906
   },
   {
      "park_latitude": 44.146723,
      "park_narrative": "
\n\tScenic beauty, camping and water recreation at its finest in the High Desert.  Mountain waters flowing out of the Ochoco Mountain Range join to form the Crooked River. The river, confined by its canyon and the Bowman Dam, forms the 15-mile long, 3,000-acre Prineville Reservoir.  With two developed campgrounds and numerous primitive camps along its 43-mile shoreline, recreational opportunities are plentiful.\n\t\n\tThe fishing can be good anytime at Prineville Reservoir. The lake supports rainbow trout, small and largemouth bass, catfish, crappie, and crayfish. The trout fishing experience is year-round, with the biggest fish being caught during the winter months either by boat or from the shore.  The bass, catfish and crappie fishing is best between May and October.\n\t\n\tOther recreational activities include waterskiing, wakeboarding, windsurfing, paddle boarding, kayaking, hiking, star gazing and wildlife viewing.

\n
\n\tThere are numerous year round camping opportunities within the state park on the reservoir.  In the developed areas there are deluxe cabins with full amenities, full hook up RV sites and tent sites.  Flush toilets and hot showers are also available.  For those who like to rough it, there are many primitive drive in and boat in campsites around the reservoir as well. 

\n
\n\tThis oasis in the High Desert is waiting for you so come out and enjoy the fun!

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 22 full hookup sites
\n\t
\n\t\tMore than 20 electrical sites with water
\n\t
\n\t\tMore than 20 tent sites with water nearby
\n\t
\n\t\t5 deluxe log cabins (one pet friendly)
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\t32 boat moorages (summer only)
\n\t
\n\t\tAmphitheater
\n\t
\n\t\tUniversal Access: two campsites and two cabins are accessible to campers with disabilities.
\n
\n
\n\t 

\n",
      "park_name": "Prineville Reservoir State Park",
      "park_id": 26,
      "park_longitude": -120.73697
   },
   {
      "park_latitude": 42.74805555,
      "park_narrative": "
\n\t\n\tCome enjoy the beautiful, quiet secluded forest. This area has picnic tables and a hiking trail leading to Pearsony Falls, the amazing Rogue River gorge and Mill Creek Falls. No drinking water at this site.

\n",
      "park_name": "Prospect State Scenic Viewpoint",
      "park_id": 22,
      "park_longitude": -122.491666
   },
   {
      "park_latitude": 45.289672,
      "park_narrative": "
\n\tRed Bridge State Wayside lies along Oregon Highway 244 and offers visitors overnight camping and daytime opportunities. Situated along the banks of the Grande Ronde River, the park is forested with ponderosa pine and cottonwoods. Uncrowded, quiet summer evenings greet campers and day-users alike. Enjoy a day of fishing or cool off in the gentle waters of the river.

\n
\n\tLocated in the heart of the Blue Mountains, the park can serve your needs as a base camp for big game hunting, mushrooming or simply exploring the miles of national forest within easy driving distance of the park. Take a drive and partake in local activities in nearby La Grande.\n\t\n\tRed Bridge is conveniently close to the full services of La Grande, including emergency services, restaurants, shopping and many community events. Whether you need a place to picnic or camp in a forest setting, Red Bridge State Park can fulfill your needs.

\n
\n\tCampground info

\n
\n\t
\n\t\t10 primitive walk-in tent sites with water nearby
\n\t
\n\t\t10 primitive sites that accommodate self-contained RVs
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tRestrooms with flush toilets
\n\t
\n\t\tHorseshoe pits
\n
\n",
      "park_name": "Red Bridge State Wayside",
      "park_id": 14,
      "park_longitude": -118.331624
   },
   {
      "park_latitude": 45.008486,
      "park_narrative": "
\n\tA fine place for a romantic stroll with tidepools, islands, and the headland with its hidden cove. Sailboarders come from everywhere! When Lincoln City's beaches are crowded or over-windy, this sheltered spot just north of town is surprisingly quiet. A short path descends to the beach at the pebbly mouth of a lazy little creek. The north beach is topped by a jumble of quaint old cottages and other homes until the beach narrows to Roads End Point. Fragments of lava form ragged islands where comic, long-necked cormorants dry their black wings atop guano-stained roosts. At low tide it's possible to clamber around Roads End Point to a secret cove and beach. Don't linger too long or you'll have to wait hours until the next low tide to get out!

\n
\n\tLincoln City is home to Finders Keepers. From mid-October to Memorial Day hand-crafted glass floats are placed along the 7-1/2 miles (12 km) of public beach in Lincoln City from the Roads End area to Siletz Bay. The number of floats placed reflect the year – so, 2015 floats crafted and placed for the year 2015 and so on. Roads End State Recreation Site is a very popular location to hunt . . . and discover . . . your very own glass float. Remember - you find it, you keep it!

\n
\n\tFor more information about what's happening in Lincoln City, please visit www.oregoncoast.org.

\n",
      "park_name": "Roads End State Recreation Site",
      "park_id": 163,
      "park_longitude": -124.008028
   },
   {
      "park_latitude": 44.7849,
      "park_narrative": "
\n\tRocky Creek is a spectacular ocean-front park on a forested bluff overlooking the ocean. Offshore rocks provide spectacular wave action in storms and are nesting areas for birds and sea lions and harbor seals. The viewpoint is an official Whale Spoken Here site for watching gray whales.

\n",
      "park_name": "Rocky Creek State Scenic Viewpoint",
      "park_id": 184,
      "park_longitude": -124.0728
   },
   {
      "park_latitude": 45.544244,
      "park_narrative": "
\n\tSpring at Rooster Rock is where spring fever happens. Imagine the first warm, sunny days of spring where meadows of wild roses and the spicy scent of Oregon grape combine with an endless panorama of the Cascade mountains, blue sky and the deep blue waters of the Columbia River. During the first sunny days of spring, people suddenly call in sick at work or school. That's when our parking lot fills up!

\n
\n\tSummers and Rooster Rock are like peas and carrots; they just go together. Three miles of river access brings out the crowds (sorry, no dogs on the beach). The river swimming serves visitors who want a natural experience. It's even more natural the farther east you go at Rooster Rock (where you'll find one of Oregon's two designated clothing optional beaches). By design, the clothing optional beach area is completely separate and not visible from the clothing-required area of the large park. The two areas coexist in harmony.

\n
\n\t\n\tRooster Rock offers not one, but two disc golf courses. The west course is fun and challenging for all skill levels. Looking to test your skill? Try the more technical east course.\n\tOur covered picnic shelters and tables serve families and groups of all sizes. Rooster Rock's boat ramp is located in the scenic lagoon at the base of looming Rooster Rock. You'll find some of the best bass, steelhead and walleye fishing around here.

\n
\n\t\n\tFall colors blaze at Rooster Rock. For an easy hike, try the 2 mile Volkswalk trail at the east end of the park. The trails will be covered with huge maples and oaks as you take a flat hike above the Columbia River. Blacktail deer, swordgrass and mushrooms grow large in the beautiful forests and meadows along this trail.

\n
\n\t\n\tWintertime at Rooster Rock State Park can be challenging, but it's paradise to those who love life on the edge. Windsurfers know this -- they come here when others stay away. When east winds barge down the Columbia Gorge at 25 to 40 mph, windsurfers come out of the woodwork to ride the whitecaps on the Columbia River. Winter wind speeds at Rooster Rock have been measured at 110 mph. In the winter, Rooster Rock becomes the gateway to winter recreation in the Gorge and the Cascades.

\n
\n\tDue to fluctuation in river levels, access to the clothing optional beach by foot may be limited. To check on current river levels please follow this link to current Oregon River Levels http://levels.wkcc.org/?P=Oregon.html

\n
\n\tCurrent Park Hours 6 am - 10 pm\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Rooster Rock State Park",
      "park_id": 126,
      "park_longitude": -122.236095
   },
   {
      "park_latitude": 45.90623,
      "park_narrative": "
\n\tSaddle Mountain State Natural Area is cherished for its hiking trails, wildflowers and breathtaking scenery.  A small, seasonal campground, day-use picnic area, a two and a half mile trail to the summit and a short .16 mile side trail are the humble offerings at Saddle Mountain.  While it may not seem like much, be prepared to marvel at the sheer volume and quality of natural beauty packed into this park. From a mature forest setting with a variety of habitats; to fields of grassy open “balds” filled with wildflowers; to an open rocky summit; words cannot describe the beauty and wonder experienced on the trail.  If the trail’s natural beauty and wildflowers aren’t enough to entice you to the top, the panoramic view from the 3,290-foot summit will.  On a clear day you can see the sweep of the Columbia River as it enters the sea, miles of Pacific shoreline- and on the eastern horizon, the Cascade Mountains in Oregon and Washington. 

\n
\n\tThe main trail is steep and difficult in spots, with a 1,640 foot rise in elevation over 2.5 miles.  It begins at an elevation of approximately 1,650 feet at the park's parking lot and climbs to a viewing platform with an elevation of approximately 3,290 feet.  It is recommended for experienced hikers wearing proper footwear and clothing.  Weather conditions can change rapidly, bringing wind and rain year round and snow in winter.  Portions of the trail can be slick in wet conditions.  The challenge this popular trail provides is well worth the reward.  If you aren’t up for the rigorous climb of the main hike, try the short, 10 minute Humbug Mountain viewpoint trail that shoots off from the main trail a quarter mile from the trailhead.  For the safety of your dog and courtesy to others, please keep your dog on a leash.

\n
\n\tCampground info 

\n
\n\t
\n\t\t10 primitive campsites at the base of the mountain.
\n
\n",
      "park_name": "Saddle Mountain State Natural Area",
      "park_id": 140,
      "park_longitude": -123.745565
   },
   {
      "park_latitude": 42.089787,
      "park_narrative": "
\n\tThis corridor is a 12 mile, forested, linear park with a rugged, steep coastline interrupted by small sand beaches.  This park was named in honor of Samuel H. Boardman, the first Oregon Parks superintendent.  He and others of his generation felt this shining coastline should be saved for the public.  What gems they gave us: admire the 300-year old sitka spruce trees, gaze at the amazing Arch Rock and Natural Bridges, and walk the 27 miles of Oregon Coast Trail that weave through the giant forests.

\n
\n\tSeaside prairies, spectacular vistas, secluded cove beaches, rugged cliffs and forested sea stacks come one after the other throughout this park.  Stand and ponder the old shell middens and wonder what it was like to live in a Native American village by the Pacific Ocean.

\n",
      "park_name": "Samuel H. Boardman State Scenic Corridor",
      "park_id": 56,
      "park_longitude": -124.331212
   },
   {
      "park_latitude": 44.780998,
      "park_narrative": "
\n\tSarah Helmick is located six miles south of Monmouth off Highway 99W. Helmick lies along the floodplain of the Luckiamute River and is forested in Douglas fir, grand fir, maple, ash, Port Orford cedar and cottonwood. There are two reservation picnic areas for groups up to 150 people each. Electricity, water, picnic tables and restrooms are provided at each site. There is plenty of shade from the bigleaf maples that tower above you. It is a quiet spot to walk along the trails that border the Luckiamute River, with plenty of birds and native plant life to investigate.

\n",
      "park_name": "Sarah Helmick State Recreation Site",
      "park_id": 98,
      "park_longitude": -123.235723
   },
   {
      "park_latitude": 44.497357,
      "park_narrative": "\n\n
\n\tSeal Rock State Wayside has large off-shore rock formations which are the habitat of seals, sea lions, sea birds and other marine life. The wayside includes interesting tidepools as well as excellent ocean views and a sandy beach. Developed for day-use, the picnic area is in a pleasant stand of shore pine, spruce and salal.

\n",
      "park_name": "Seal Rock State Recreation Site",
      "park_id": 147,
      "park_longitude": -124.083111
   },
   {
      "park_latitude": 45.703021,
      "park_narrative": "\n\n
\n\tThis would be a great place for a convention if you were a bighorn sheep. In other words, the terrain is rocky, mountainous, desolate and beautiful. This is the third leg of state parks joined together at Mitchell Point (also see Wygant and Vinzenz Lausmann).

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Seneca Fouts Memorial State Natural Area",
      "park_id": 120,
      "park_longitude": -121.61863
   },
   {
      "park_latitude": 43.23527,
      "park_narrative": "
\n\tSeven Devils Wayside is the jumping-off point for sandy beach adventure. At this access point, you can travel several miles up and down the open beach. Agates are often the beachcombing goal of visitors to this out-of-the-way spot.

\n",
      "park_name": "Seven Devils State Recreation Site",
      "park_id": 49,
      "park_longitude": -124.38861
   },
   {
      "park_latitude": 45.546944,
      "park_narrative": "
\n\tIn 1915, a local dairy farmer named George Shepperd gave all that he had (this tract of land) to the City of Portland as a memorial to his wife. Today, thousands of visitors along the Historic Columbia River Highway visit this beautiful spot, with its roaring waterfall cascading down steep cliffs into Youngs Creek and out to the Columbia River far below. The upper fall is around 42' tall. The lower tier is around 50' tall.

\n
\n\tOne of the most beautiful and historic highway bridges crosses the canyon here, but you can't see or appreciate it unless you leave your car and take the short trail to the falls.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Shepperd's Dell State Natural Area",
      "park_id": 121,
      "park_longitude": -122.19583
   },
   {
      "park_latitude": 43.323672,
      "park_narrative": "
\n\tPerched on rugged sandstone cliffs high above the ocean, Shore Acres State Park is an exciting and unexpected combination of beautiful natural and constructed features. Once the grand estate of pioneer timber baron Louis Simpson, Shore Acres features lushly planted gardens with plants and flowers from all over the world. Something is in bloom almost every day of the year.\n\t\n\tIn the landscaped area you'll discover a formal garden, a Japanese-style garden with a lily pond, and two rose gardens which include All American Rose Selections. From Thanksgiving through New Year's Eve, the gardens are ablaze with thousands of colored lights and holiday decorations put up by community volunteers and The Friends of Shore Acres in cooperation with the Oregon Parks and Recreation Department.\n\t\n\tAfter seeing the garden, you can stroll down a trail to a secluded ocean cove at Simpson Beach or skirt the cliff's edge to see spectacular ocean vistas which often include towering waves crashing against the shoreline after a storm and migrating grey whales. On the site of Simpson's vanished mansion, a fully enclosed observation building will allow you to view the ocean and protect you from the weather. The observation building has interpretive panels describing the history of the Simpson estate.

\n
\n\tShore Acres Park is located on the Cape Arago Highway, 13 miles southwest of Coos Bay/North Bend and U.S. Highway 101. The park is open every day from 8 a.m. to dusk. Please check posted times at park entrance for exact closing times. A daily vehicle parking fee is charged. Annual day-use permits are available for purchase. An Oregon Pacific Coast Passport or your camping receipt from Sunset Bay State Park or any other Oregon state park campground are accepted as a daily permit. Please display the receipt on the driver's side of your dashboard. No animals permitted outside of vehicles, with the exception of service animals.\n\t\n\tThe Friends of Shore Acres operate an information and gift center at the entrance to the formal gardens where visitors can purchase items that relate to the historical and natural features of Shore Acres. The Friends also sponsor a variety of horticultural and cultural events at the garden throughout the year.\n\t\n\tA large Monterey Pine (pinus radiata) dates back to the historic Louis J. Simpson estate. A member of the national Big Tree Register, the pine is 95 feet tall with a 208-inch trunk circumference and a 74-foot crown spread. It shares co-champion honors with a Monterey Pine in Carmel, California, which has a smaller trunk, but a wider crown. It was probably planted around 1910.

\n",
      "park_name": "Shore Acres State Park",
      "park_id": 68,
      "park_longitude": -124.38192
   },
   {
      "park_latitude": 44.876667,
      "park_narrative": "
\n\tPeople call it the “crown jewel” of the Oregon State Parks system, and once you visit, you know why. Silver Falls State Park is the kind of standout scenic treasure that puts Oregon firmly onto the national—and international—stage. Its beauty, boundless recreational opportunities and historic presence keep it there. Nestled in the foothills of Oregon’s Cascade Mountains, less than an hour east of the state capital of Salem, Oregon, the sprawling 9,200 acre property is the largest state park in Oregon, and one of the most popular.

\n
\n\tWaterfalls:  Where else can you walk behind a waterfall? Check out the famous South Falls and see what a 177-foot curtain of water looks like from behind. It’s part of the Trail of Ten Falls, a spectacular, nationally recognized hiking trail that weaves through a dense forested landscape. The trail passes a series of breathtaking waterfalls along a rocky canyon, and descends to a winding creek at the forest floor. This nearly 9-mile loop is considered to be a moderate hike, with an overall elevation change of 800 feet.  Several connecting trails with separate access points make shorter routes. For everyone’s safety— absolutely no pets.

\n
\n\tBoots, bikes, paws, hooves: The park offers more than 25 miles of backcountry trails for mountain biking, hiking or horseback riding. The trails are lined with lush vegetation and remnants of old-growth forests. Wildlife is abundant. Bears and cougars live in the more remote park areas.

\n
\n\tDaytime activities: The South Falls Day-use area has spacious lawns, barbecue stands, picnic shelters, tables, a playground, horseshoe pits, an off lead area for dogs, and a charming creek.  Ever since the opening day in 1933, visitors have been using these grounds for potlucks, family reunions and weddings, all within a short walk to view the famous 177-foot South Falls.

\n
\n\tOvernight: The main campground has tent sites, RV spots and cabins. Bring your horse and stay in the horse campground.  If you need an area for many people, the park also has group tent and RV camps, dormitory-style bunkhouses (each Ranch sleeps 75) and the historic Youth Camp for up to 250 campers.   

\n
\n\tThe Silver Falls Lodge and Conference Center offers a variety of amenities for all visitors to the park.  Relax and enjoy comfortable lodging within the wooded setting, or feast at the many catered specialty events.  Enjoy a preordered meal at the historic dining hall or order a box lunch to take on a hike or to your campsite.  They also specialize in hosting special events!  For more information please visit silverfallslodge.com or call 866-575-8875.\n\t 

\n
\n\t\n\t 

\n
\n\t 

\n",
      "park_name": "Silver Falls State Park",
      "park_id": 151,
      "park_longitude": -122.64805
   },
   {
      "park_latitude": 44.32087,
      "park_narrative": "\n\n
\n\tAn excellent whale watching and photography viewpoint. Walk the historic 804 Trail (.75 miles one-way with resting benches scattered along the way). The park is known for tidepooling, rock fishing and the yearly smelt run (smelt are small, silvery relatives of salmon). Breathtaking sunsets.

\n",
      "park_name": "Smelt Sands State Recreation Site",
      "park_id": 89,
      "park_longitude": -124.10278
   },
   {
      "park_latitude": 44.365891,
      "park_narrative": "
\n\tIf you enjoy scenic views of deep river canyons or rock climbing, Smith Rock State Park is the place for you. There are several thousand climbs in the park. More than a thousand are bolted routes. We also offer miles of hiking and mountain biking trails. Along your trip through the canyon, you might see golden eagles, prairie falcons, mule deer, river otter and beaver.

\n
\n\tDue to the uniqueness and fragile aspect of the park, park rangers enforce the animal leash law and strongly encourage all park users to stay on trails.

\n
\n\tCamping info

\n
\n\t
\n\t\tWalk-in bivouac area for tents (No reservations)
\n\t
\n\t\tRV camping, sleeping in vehicles and open fires are not allowed
\n
\n
\n\t 

\n",
      "park_name": "Smith Rock State Park",
      "park_id": 36,
      "park_longitude": -121.137377
   },
   {
      "park_latitude": 44.5991216,
      "park_narrative": "
\n\tSituated next to the Yaquina Bay Bridge, South Beach State Park begins in south Newport and stretches several miles down the Oregon coast. This historic park offers a variety of recreational opportunities.

\n
\n\tThe paved jetty trail provides a perfect place to jog or ride a bicycle. Forgot your bike? The Hospitality Center rents out bikes daily during the summer months.

\n
\n\tOur equestrian trail to the beach begins at the South Jetty equestrian trailhead. Park next to the trailhead and enjoy a beautiful sunset by horseback!

\n
\n\tA playground area and horse-shoe pits are also provided within the campground area. Interested in plants? Stop by the Hospitality Center for a self-lead native plant hike brochure, a fun hike for all ages!

\n
\n\tWe also offer interpretive programs, guided hikes, and JR Ranger activities every day throughout the summer months. Check out the "events" calendar on our website for a detailed program schedule.

\n
\n\tKayak tours are offered 7 miles south on Beaver Creek during July through labor-day weekend. Paddles, kayaks, and PFDs are provided, and our interpretive guides take guests on a peaceful 2.5 hour expedition up the pristine freshwater marsh. Please note: This year tours will begin at the Beaver Creek Welcome Center, 1 mile east of Ona Beach. For more information or to make a reservation, please call: (541) 563-6413 or visit the Beaver Creek Welcome Center. Reservations accepted starting June 1, please call between 10 AM - 4 PM.

\n
\n\tOther activities around the park include fishing, crabbing, boating, surfing and beachcombing. Attractions nearby include the Yaquina Bay Lighthouse, marine life exhibits at the Hatfield Marine Science Center and the Oregon Coast Aquarium.

\n
\n\tThese are just a few of the opportunities you will encounter when you visit and explore the central Oregon coast.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 225 electrical sites with water
\n\t
\n\t\tApproximately 60 tent sites
\n\t
\n\t\t27 yurts (two pet-friendly)
\n\t
\n\t\tThree group tent camping areas
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood and ice available for purchase
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tFive campsites (two electrical, three tent) and 24 yurts are accessible to campers with disabilities.
\n",
      "park_name": "South Beach State Park",
      "park_id": 149,
      "park_longitude": -124.05934
   },
   {
      "park_latitude": 44.616559,
      "park_narrative": "\n
\n\tAdjacent to South Beach State Park, South Jetty offers horse access to the beach, fishing, clamming, surfing, scuba diving and (for the advanced) windsurfing when conditions permit.

\n",
      "park_name": "South Jetty (South Beach)",
      "park_id": 171,
      "park_longitude": -124.058118
   },
   {
      "park_latitude": 45.68833,
      "park_narrative": "
\n\tZooming down Interstate 84 eastbound, you might very well miss this tiny park. Nestled at the base of the sheer walls of the Columbia Gorge, Starvation Creek is much more than it appears. It is a feast for the eyes and feet.\n\t\n\tTrails spreading out from this day-use park lead onto adjacent National Forest Service land and connect to the Mt. Defiance and Starvation Ridge trails. Heading east, trek along a remnant of the Historic Columbia River Highway State Trail to Viento State Park and campground. Historic Columbia River Highway and State Trail bicycle and hiking map\n\t\n\tThe waterfall at Starvation Creek, one of the few in this area of the gorge, is an elegant cascade admired by gorge travelers for thousands of years.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n
\n\t 

\n
\n\t 

\n",
      "park_name": "Starvation Creek State Park",
      "park_id": 122,
      "park_longitude": -121.688055
   },
   {
      "park_latitude": 44.9387,
      "park_narrative": "
\n\tThe park features not only cherry trees and other plants favored by Oregonians, but tells a little history as well. Stone plaques set in the mall sidewalks list the county seat and establishment date for each of Oregon's counties. On the Willson Park side of the street, flags from every state in the union sit in a circle near the Moon Tree, a state heritage tree. The young Douglas-fir, just north of the flags along Court Street, was grown from a seed carried to the moon by Apollo 14 astronaut Stuart Roosa in 1971.\n\t\n\tThe grounds include three fountains; Waite Fountain (west of the capitol building in Willson Park), Wall of Water bordering Court Street across from the main capitol entrance, and Capitol Fountain, on Center Street at the north end of the Capitol Mall.

\n",
      "park_name": "State Capitol State Park",
      "park_id": 187,
      "park_longitude": -123.030449
   },
   {
      "park_latitude": 44.225,
      "park_narrative": "\n
\n\tStonefield has easy beach access. Tenmile Creek is just to the north. A great place to sit in the sun and watch for whales.

\n",
      "park_name": "Stonefield Beach State Recreation Site",
      "park_id": 91,
      "park_longitude": -124.11055
   },
   {
      "park_latitude": 43.453802,
      "park_narrative": "
\n\tSuccor Creek State Natural Area lies in a deep, rocky canyon and is a remote haven for rock hounds and wildlife watchers. Limited souvenir collecting by rock hounds is permitted in the park.  A rough 15 mile dirt road leads from Oregon 201 to the park, which has a walk-in primitive camping and day-use areas on the east side of the creek.  You will find eight primitive sites on the west side of the creek.  No water is available.\n\t\n\tThe Succor Creek Bridge in Succor Creek State Natural Area is open to pedestrians. The bridge is not open to vehicles or ATVs.

\n
\n\tCampground info

\n
\n\t
\n\t\tEight primitive sites on the west side of the creek
\n\t
\n\t\t15 primitive walk-in campsites on the east side of the creek
\n\t
\n\t\tVault toilet
\n\t
\n\t\tNo water available
\n
\n",
      "park_name": "Succor Creek State Natural Area",
      "park_id": 9,
      "park_longitude": -117.120235
   },
   {
      "park_latitude": 44.740749,
      "park_narrative": "\n\n
\n\tThe Sumpter Valley Dredge is nestled at the base of the majestic granite peaks of the Elkhorn Mountain Range. The Powder River is born deep within the range and picks up speed as it spills down the Sumpter Valley, traveling through the park before reaching Phillips Reservoir.\n\t\n\tThis waterway was the vein of life during the boom days of the gold rush. The landscape still bears the scars. Miles of tailings line the banks of the river, a remembrance from the prosperous days of mining. The Sumpter Valley Dredge -- the centerpiece of our park -- left much of the rocky footprint that you'll see on your trek along Highway 7. The dredge is an important link to Oregon's pioneering past and development. It is one of the largest and most accessible gold dredges in the U.S.\n\t\n\tA half a century after the last dripping bucket load was lifted, the dredge stands silent. If you listen carefully, you can almost hear whispers of the hope, sweat and dreams of the people who worked on it. After visiting the dredge you may continue on the Elkhorn Scenic Byway to continue your trip into history.\n\t\n\tThe dredge in the park is the last of three built on the Powder River. Built in 1935, it ran until 1954. It dug up more than four million dollars worth by a simple, but dramatic method.\n\t\n\tSticking out from the dredge's hull is a massive boom bearing 72 1-ton buckets. The buckets, moving like the chain of a chainsaw, would bore into the riverbank and carry the loose rock back into the dredge interior.\n\t\n\tOnce inside, the rock would pass through a series of steel cylinders to separate the material by size, sending the smaller material deeper into the dredge. Using water and sluices, the gold would be separated from the sediment. The spoils from this process and larger rock pass through the back of the dredge and are deposited behind it via another boom.

\n
\n\tFriends of Sumpter Valley Dredge Website;

\n
\n\twww.friendsofthedredge.com

\n",
      "park_name": "Sumpter Valley Dredge State Heritage Area",
      "park_id": 174,
      "park_longitude": -118.202339
   },
   {
      "park_latitude": 43.330784,
      "park_narrative": "
\n\tSituated in one of the most scenic areas on the Oregon coast, Sunset Bay State Park features beautiful sandy beaches protected by towering sea cliffs. Only a short walk from the beach, the campground has sites for tent camping and RV's, as well as cozy and comfortable yurts. Day-use and picnic facilities are located along the bay to allow easy access for beachcombing, fishing, swimming, and boating.

\n
\n\tA network of hiking trails connects Sunset Bay with nearby Shore Acres and Cape Arago State Parks. Hiking these trails will give you a chance to experience pristine coastal forests, seasonal wildflowers and spectacular ocean vistas from atop the rugged cliffs and headlands. From points along the trail, you'll be treated to views of Gregory Point and the Cape Arago lighthouse.\n\t\n\tA public golf course is located next to the park and the nearby fishing village of Charleston provides opportunities for crabbing, clamming and fishing. In fact, there are plenty of secret treasures in the Sunset Bay area.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 30 full-hookup sites
\n\t
\n\t\tApproximately 35 electrical sites with water
\n\t
\n\t\tMore than 65 tent sites with water nearby
\n\t
\n\t\tEight yurts (one pet friendly)
\n\t
\n\t\tTwo group tent camping areas
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n
\n\n\tUniversal Access\n\tThree campsites and three yurts are accessible to campers with disabilities.
\n",
      "park_name": "Sunset Bay State Park",
      "park_id": 70,
      "park_longitude": -124.3714041
   },
   {
      "park_latitude": 46.0991,
      "park_narrative": "
\n\tSunset Beach State Recreation Site comes with a very famous past. The park marks the west trailhead of the historic Fort-to-Sea Trail - a 6.5 mile route that recreates the experience Lewis and Clark and the Corps of Discovery encountered as they traveled between Fort Clatsop and the Pacific Ocean during the famous winter of 1805-6.

\n
\n\tSunset Beach provides visitors with direct access to the Pacific Ocean with expansive views from Cape Disappointment to the north and Ecola State Park to the south.\n\t\n\tThis 120-acre park offers paved parking for 21 vehicles; an information station and an ADA accessible boardwalk leading to the beach.

\n",
      "park_name": "Sunset Beach State Recreation Site",
      "park_id": 182,
      "park_longitude": -123.9391
   },
   {
      "park_latitude": 44.54565,
      "park_narrative": "
\n\tThe Cove Palisades State Park is a year-round recreational destination for the entire family. Located in our high desert region, the weather is sunny and warm in the summer months and chilly but generally mild in the winter. The park is situated among towering cliffs that surround beautiful Lake Billy Chinook.\n\t\n\tThe park features myriad water recreational opportunities, a full-service campground, store, restaurant, marina and rental services. Not interested in camping? Deluxe lakeshore log cabins are available. Nature lovers will find nearly 10 miles of hiking trails that give access to areas rich in wildlife and splendid scenery.\n\t\n\tThe park is home to the popular Eagle Watch event.\n\t\n\tLearn about the unusual and unique attributes of this premier recreational and natural resource area ... at water level!  Lake Billy Chinook is home to The Cove Palisades Resort and Marina, Central Oregon’s mecca houseboating, water skiing, fishing, and other rentals.  For further information: http://www.covepalisadesresort.com/ or call toll-free 1 (877) 546-7171.

\n
\n\tCampground info

\n
\n\tCrooked River Campground (open all year)

\n
\n\t
\n\t\tMore than 85 electrical sites with water
\n\t
\n\t\tRV dump station
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tOutdoor amphitheater
\n\t
\n\t\tFenced, off-leash pet exercise area
\n
\n
\n\tDeschutes Campground (open mid-May to mid-September)

\n
\n\t
\n\t\tApproximately 85 full-hookup sites
\n\t
\n\t\tMore than 90 tent sites with water nearby
\n\t
\n\t\tThree group tent camping areas
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tCamp store
\n\t
\n\t\t21 reservable boat moorages
\n\t
\n\t\tFish cleaning station
\n\t
\n\t\tOutdoor amphitheater
\n\t
\n\t\tFenced, off-leash pet exercise area
\n
\n\n\tUniversal Access\n\tSix campsites are accessible to campers with disabilities
\n
\n\t 

\n",
      "park_name": "The Cove Palisades State Park",
      "park_id": 24,
      "park_longitude": -121.2465
   },
   {
      "park_latitude": 44.460792778,
      "park_narrative": "
\n\tThompson's Mills is a unique survivor of times past, chronicling 150 years of Oregon rural life and honoring the owners who adapted the mill to the changing world around it.  It is the oldest water-powered mill in the state and its turbines can be seen in action on guided tours. A water right that predates statehood produces the water flow that still runs the milling machines for demonstrations today.

\n
\n\tThe Mill and grounds are open daily from 9:00 - 4:00. Free guided tours are offered every day at 10:00, 12:00 and 2:00 and last about one hour. The Mill and grounds are closed on Thanksgiving Day, Christmas Day and New Years Day. There are no fees to visit. The main tour of the Mill is ADA compliant.

\n
\n\tDo you know any 8-12 year olds who might want to be a pioneer kid ?!  Well check this out: every Saturday all summer we're offering our new free kids program, "Be A Pioneer Kid!"  Call for more information!

\n",
      "park_name": "Thompson's Mills State Heritage Site",
      "park_id": 186,
      "park_longitude": -123.081935278
   },
   {
      "park_latitude": 44.208333,
      "park_narrative": "
\n\tTokatee Klootchman sits a few feet above the ocean with an excellent view. A great place to watch for whales.

\n",
      "park_name": "Tokatee Klootchman State Natural Site",
      "park_id": 90,
      "park_longitude": -124.11388
   },
   {
      "park_latitude": 45.873611,
      "park_narrative": "
\n\tTolovana State Recreation Site is conveniently located on the ocean front of one of Oregon's most scenic beaches, Cannon Beach.  Situated at the south end of Cannon Beach, Tolovana offers a place to play, fly a kite, build a sand castle, picnic or take in a sunset.  Less than a mile away to the north you won't miss Haystack Rock, the icon of Cannon Beach.  Haystack Rock is a towering 235 foot basalt sea stack that is home to tidepool creatures and nesting seabirds, such as the Tufted Puffin.  Enjoy this protected area with care.  Cannon Beach is known for its miles of sandy shoreline and breathtaking scenery.  Don't miss the town's boutiques and local eateries, found in the nearby areas of Tolovana Park and Cannon Beach's midtown and downtown.  In addition to providing access to the ocean shore, Tolovana State Recreation Site has a playground located on the north side of the parking lot. 

\n",
      "park_name": "Tolovana Beach State Recreation Site",
      "park_id": 141,
      "park_longitude": -123.96111
   },
   {
      "park_latitude": 42.438923,
      "park_narrative": "
\n\tThis is a beautiful day-use park located on the bank of the Rogue River and at the foot of the geologically prominent Table Rocks. You can fish, swim, hike, watch wildlife and experience nature at its finest. An ideal spot for family gatherings or group picnics, the site has a large picnic shelter with cooking utilities. There's a smaller picnic kitchen and three sites with water and electricity. Denman Wildlife Refuge is next to this park and teems with local and migratory wildlife -- a bird viewing paradise. Salmon and steelhead pass through seasonally on treks to and from the ocean. Rainbow trout are stocked by the Oregon Department of Fish and Wildlife. A boat ramp with toilet facilities provides excellent access to the river.

\n",
      "park_name": "TouVelle State Recreation Site",
      "park_id": 72,
      "park_longitude": -122.891084
   },
   {
      "park_latitude": 45.44425,
      "park_narrative": "
\n\tNew -- Tryon Creek Checklist of Vascular Plants

\n
\n\tImagine stepping into a lush forest, where woodpeckers forage, squirrels leap from limb to limb, owlets wait quietly for their next meal, beavers work busily by the creek, bats bury deep within the creviced bark of a Douglas-fir tree, and wildflowers paint the understory as the seasons change. Discover it all, here at Tryon Creek State Natural Area, your oasis in the city. Where you can explore 658 acres of second-growth forests, walk along the meandering Tryon Creek, and connect with the flora and fauna that call this special place home.

\n
\n\tLocated about 15 minutes from downtown Portland is Oregon's only state park within a major metropolitan area. What will you explore today?

\n
\n\t\n\t• 8-miles of hiking trails, 3.5 miles of horse trail, 3-mile paved bicycle trail, and a paved all abilities trail\n\t• 8 bridges and a wetland boardwalk\n\t• Nature Center with interpretive exhibits and store\n\t• Glenn Jackson Shelter \n\t• Guided hikes, Summer Day Camp, Junior Ranger Program, School Field Trips, Special Events and many more.

\n
\n\t\n\tSupported by a partnership between Oregon State Parks and the Friends of Tryon Creek, this park offers something for everyone. Want to learn more about the Friends of Tryon Creek? Be sure to  check out their website, Friends of Tryon Creek.

\n
\n\t 

\n",
      "park_name": "Tryon Creek State Natural Area",
      "park_id": 103,
      "park_longitude": -122.6744721
   },
   {
      "park_latitude": 42.745659,
      "park_narrative": "
\n\tTseriadun (pronounced serry-AH-dun) is popular with visitors stretching their legs on the miles-long beach, agate collectors (there's a reason the community calls it Agate Beach) and photographers intent on capturing the perfect shots of offshore rocks and headlands. Long ago, Native Americans lived at the site in cedar plank houses and hunted and fished in the mountains and rivers. Now, you can fish for rainbow trout and native cutthroat trout in Garrison Lake. Check the Oregon Department of Fish and Wildlife web site for fishing regulations and reports.

\n
\n\tTseriadun is one of three state parks in Port Orford. The other parks are Port Orford Heads and Paradise State Point State Recreation Site .

\n
\n\t 

\n
\n\t 

\n",
      "park_name": "Tseriadun State Recreation Site",
      "park_id": 200,
      "park_longitude": -124.507949
   },
   {
      "park_latitude": 42.114613,
      "park_narrative": "\n\n
\n\tIn 1846, a wagon train led by Jesse Applegate traversed southern Oregon along what became known as the Applegate Trail. Tub Springs Wayside is one of the stopping points before you head down the mountain pass into Ashland. Take a moment to stop here amid the towering fir and sense what it was like 150 years ago. Breathe in the fresh mountain air. There's an interpretive panel at the wayside describing the difficulties faced by these pioneers.\n\t\n\tThe name Tub Springs is derived from the tubs that were installed in the 1930s to provide spring water for travelers. The tubs have been renovated and are still functional today. The same springs that provided early settlers with plentiful fresh water still flow.

\n",
      "park_name": "Tub Springs State Wayside",
      "park_id": 73,
      "park_longitude": -122.4391
   },
   {
      "park_latitude": 44.128935,
      "park_narrative": "
\n\tNestled in the heart of sunny central Oregon, Tumalo rests along Oregon's spectacular Deschutes River. The campground is simultaneously close enough to the town of Bend to make an quick jaunt to the grocery store, but far enough away to escape the commotion. Its location makes it an ideal stepping stone for any type of outdoor activity you could possibly dream of: lush green golf courses, clear blue-ribbon trout steams, pristine alpine lakes, miles upon miles of challenging yet scenic hiking and mountain bike trails, and of course the Cascade Mountains are all within easy reach.

\n
\n\tWinter recreation is just up the road at Mt. Bachelor where skiers and snowboarders can experience some of the best powder in the state. If you are not fond of the lifts, there are miles of groomed Nordic trails and tons of snowy back-country areas to explore.\n\t\n\tAt dawn or dusk try casting for rainbow trout as they sip at mayflies and caddisflies. Grab your raft and float with your feet dangling into the cool water during the heat of the summer. Take a hike and explore one of the river trails as they gently wind through canyons created by the untamed river. Watch deer forage for food just as the sun creeps below the rim of the canyon. Listen as coyotes perform their haunting call, announcing the sunset and the coming darkness. Smell the sweet fragrance of sage and juniper as the dew drips off its branches. Sit quietly in the evening and let the stars put on a show of their own. All of this plus a quiet, quaint campground where your family can stay in a yurt, or camp in your own tent or RV.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 23 full-hookup sites
\n\t
\n\t\tMore than 50 tent campsites
\n\t
\n\t\tSeven yurts (two pet-friendly)
\n\t
\n\t\tTwo seasonal group camping area
\n\t
\n\t\tTwo seasonal group picnic areas
\n\t
\n\t\tSeasonal hiker/biker camp
\n\t
\n\t\tSolar shower building and flush toilets
\n\t
\n\t\tFirewood and ice sales (in season)
\n
\n\n\tUniversal Access\n\tFour campsites and one yurt are accessible to campers with disabilities.
\n",
      "park_name": "Tumalo State Park",
      "park_id": 34,
      "park_longitude": -121.331195
   },
   {
      "park_latitude": 45.125555,
      "park_narrative": "
\n\tUkiah-Dale Forest State Scenic Corridor along Highway 395 follows the North Fork of the John Day River and Camas Creek. Winding through a stately ponderosa pine, Douglas fir and western larch forest the corridor provides a pleasant scenic drive and access to a popular fishing spot. Near Ukiah, amidst old-growth pines and larch, the Ukiah-Dale Campground provides a perfect location to stay and relax next to the soothing waters of Camas Creek.

\n
\n\tSpring brings an abundance of wildflowers -- including camas, a traditionally important food source for the native Americans. Camas Creek and the John Day River offer anglers excellent fishing for trout, steelhead and salmon.The Bridge Creek Elk Wildlife Area is nearby, providing hunters with plenty of big game hunting opportunities. The surrounding national forest provides an abundance of mushrooms and berries.\n\t\n\tQuiet, relaxing and far from the high-speed demands of metropolitan life, Ukiah-Dale can provide you with a wonderfully relaxed feeling. In the nearby town of Ukiah, re-stock your groceries, gasoline or fishing tackle. Take a break and discover this unique hideaway.

\n
\n\tCampground info

\n
\n\t
\n\t\t27 primitive sites with water nearby
\n\t
\n\t\tPaved parking at all sites (can accommodate self-contained RVs)
\n\t
\n\t\tRestrooms with flush toilets
\n\t
\n\t\tFirewood for sale
\n
\n",
      "park_name": "Ukiah-Dale Forest State Scenic Corridor",
      "park_id": 15,
      "park_longitude": -118.970555
   },
   {
      "park_latitude": 43.662606,
      "park_narrative": "
\n\tUmpqua Lighthouse State Park is located less than a mile from the famous Salmon Harbor on Winchester Bay. The campground and developed day use areas are centered around beautiful Lake Marie. Access to this small freshwater lake is provided for angling and non-motorized boating. There is also a small sandy beach set aside for swimming or just relaxing.

\n
\n\tThe small overnight campground offers RV and tent campsites, along with two beautiful one-room log cabins. These warm and cozy cabins sleep four comfortably. They also have covered porches which overlook picturesque Lake Marie. Rustic and deluxe yurts are also available in the campground . Showers and restrooms are centrally located. This beautiful and quiet campground has yet to be discovered by crowds of camping enthusiasts.

\n
\n\tThe park is centered in the stretch of towering sand dunes protected by the Oregon Dunes National Recreation Area. These dunes, many of which reach heights of 500 feet or more, are ideal for the off-road enthusiast, or for the person who enjoys the magnificent wonders of nature. For more information about the dunes and the recreational opportunities offered, contact the Oregon Dunes National Recreation Area visitor center in nearby Reedsport.

\n
\n\tThe Umpqua River Lighthouse towers above the entrance to Winchester Bay. The 65-foot tower contains a distinctive lens which emits a red and white flash. The lighthouse and adjacent museum are operated and maintained by the Douglas County Parks Department.  For information about museum and lighthouse tours, call (541) 271-4631.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 10 full hookup sites
\n\t
\n\t\tApproximately nine electrical sites with water
\n\t
\n\t\tMore than 20 tent sites with water nearby
\n\t
\n\t\tTwo rustic yurts (one is pet-friendly - #53)
\n\t
\n\t\tSix deluxe yurts (two are pet-friendly - #16 & #18)
\n\t
\n\t\tTwo rustic log cabins (one is pet-friendly - #46)
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tHot showers and flush toilets
\n
\n\n\tUniversal Access\n\tOne deluxe yurt is accessible to campers with disabilities.
\n",
      "park_name": "Umpqua Lighthouse State Park",
      "park_id": 83,
      "park_longitude": -124.194405
   },
   {
      "park_latitude": 43.6513888,
      "park_narrative": "\n\n
\n\tThis small park contains a couple of picnic tables, a vault-style restroom and a short boat ramp leading into the Umpqua River. There's a small amount of room for trailer parking, but the parking lot is better suited to passenger vehicles.

\n",
      "park_name": "Umpqua State Scenic Corridor",
      "park_id": 181,
      "park_longitude": -123.90472
   },
   {
      "park_latitude": 44.37138888,
      "park_narrative": "\n\n
\n\tUnity Forest State Scenic Corridor is home to a wide variety of wildlife. Elk, mule deer, antelope, cougar, bobcat and black bear can be seen along this stretch. The forest is heavily treed with ponderosa pine.

\n",
      "park_name": "Unity Forest State Scenic Corridor",
      "park_id": 6,
      "park_longitude": -118.111944
   },
   {
      "park_latitude": 44.4952777,
      "park_narrative": "
\n\tThe high desert surroundings of this park offer a unique experience to its guests. The fragrant smell of juniper lingers in the air and thrills the senses. The cool grass of the park is a vibrant contrast to the sagebrush and cheatgrass of the bordering lands. The Burnt River comes to rest behind the Unity Dam before continuing its path down the valley. Relax on the shores or enjoy water sports. There's a boat ramp to accommodate the water skier as well as the angler. A peacefulness will engulf you at Unity Lake State Recreation Area whatever you choose to do.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 35 electrical sites with water (first come, first serve basis - no reservations for campsites)
\n\t
\n\t\tTwo cabins
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tADA-accessible RV dump station
\n\t
\n\t\tFirewood and ice sales
\n
\n\n\tUniversal Access\n\tTwo campsites are accessible to campers with disabilities.
\n",
      "park_name": "Unity Lake State Recreation Site",
      "park_id": 7,
      "park_longitude": -118.183333
   },
   {
      "park_latitude": 42.4114,
      "park_narrative": "
\n\tA pleasant green oasis awaits you in southern Oregon's Rogue Valley. Valley of the Rogue Park has both a day-use picnic area and an overnight campground along three miles of shoreline on the Rogue River. A meeting hall is available for camping groups. An easy, self-guided interpretive walking trail provides a relaxing 1.25 mile stroll along the river's edge.

\n
\n\tCamp and play along the river made famous by novelist and avid fisherman Zane Grey. The campground is also a great place to stay while taking in the local culture, history, and recreation opportunities in the area. Stay with us while you take trips to Crater Lake National Park, the Oregon Caves National Monument, historic Jacksonville, Ashland's Shakespeare Festival, or the Britt Music Festival. The park is ideally located to give you all of this, plus friendly local shops, museums, and sights of interest. The Rogue Valley awaits your arrival.

\n
\n\tCampground info

\n
\n\t
\n\t\tMore than 85 full-hookup sites
\n\t
\n\t\tApproximately 59 electrical sites with water
\n\t
\n\t\t15 tent sites with water nearby
\n\t
\n\t\tEight yurts (four pet-friendly)
\n\t
\n\t\tThree group tent camping areas
\n\t
\n\t\tMeeting hall
\n\t
\n\t\tFlush toilets and hot showers
\n\t
\n\t\tLaundry facilities
\n\t
\n\t\tFirewood for sale
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tCampsite E7 is accessible to campers with disabilities.
\n",
      "park_name": "Valley of the Rogue State Park",
      "park_id": 76,
      "park_longitude": -123.13047
   },
   {
      "park_latitude": 45.697365,
      "park_narrative": "
\n\t                                Viento Campground is OPEN for the 2015 camping season.

\n
\n\tViento campground is now on the reservation system.  Please click green 'Reserve Online' link in the upper left or call (800) 452-5687 for reservations.

\n
\n\tAppropriately enough for a park in the blustery Columbia River Gorge, the park's name, pronounced vee-EN-toe, is Spanish for wind. Just an odd coincidence, actually. In this case, the Viento comes from the first letters of three railroad tycoons - Villard, Endicott, and Tollman -who put the first railroad in the area.

\n
\n\tWhere a railroad station once stood is now the home of one of the Gorge's best kept secrets: Viento is a great place to camp! With modern campsites, Viento almost always has a spot available when other campgrounds in the area are full.

\n
\n\tViento is next to a working railroad line and crossing. Visitors and campers can expect to hear train horns throughout the day and night. Interstate 84 also borders the park. Please call the park office at (541) 374-8811, for more information.

\n
\n\tViento has a day-use area with easy access to the Columbia River and some of the best windsurfing in the Gorge. There's a great picnic area right next to a wonderful, babbling creek.

\n
\n\tA one-mile, fully handicapped accessible trail from Viento to the Starvation Creek waterfall takes you along a section of the Historic Columbia River Highway. Now a hiking trail, there hasn't been auto traffic here in more than 50 years. If you get a chance to visit, imagine an old Ford Model T twisting around the corners! Historic Columbia River Highway and State Trail bicycle and hiking map

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 55 electrical sites with water
\n\t
\n\t\tMore than 15 tent sites with water nearby
\n\t
\n\t\tFlush toilets/showers
\n\t
\n\t\tInterpretive programs
\n
\n\n\tUniversal Access\n\tOne campsite accessible to campers with disabilities.
\n\n\t 
\n\n\tPlease secure your valuable when enjoying our parks.  Thank you!
\n",
      "park_name": "Viento State Park",
      "park_id": 123,
      "park_longitude": -121.665851
   },
   {
      "park_latitude": 45.703021,
      "park_narrative": "
\n\tThe family of Vinzenz Lausmann gave 126 acres of rugged scenic land to the State of Oregon in his memory. This park adjoins two other state parks tract near Mitchell Point located about 5 miles west of Hood River on Interstate 84. A plaque honoring Mr. Lausmann is at the foot of the park, where a trail leads the visitor up the steep faces of fir, alder and maple which define the Columbia River Gorge in this area. The views of the Gorge from this trail are spectacular.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Vinzenz Lausmann Memorial State Natural Area",
      "park_id": 124,
      "park_longitude": -121.61863
   },
   {
      "park_latitude": 44.415442,
      "park_narrative": "\n\n
\n\tW.B. Nelson provides a small freshwater lake and fishing dock. Bass and stocked pan-sized trout are the most common fish. The area is known for abundant waterfowl. Adjacent to the Alsea River, there's a scenic wetland area.

\n",
      "park_name": "W. B. Nelson State Recreation Site",
      "park_id": 92,
      "park_longitude": -124.035118
   },
   {
      "park_latitude": 45.622777,
      "park_narrative": "
\n\tThis day-use site is located along the Wallowa River and is a popular fishing and wildlife viewing area. Steelhead fishing is good during the spring and fall. The canyon rises steeply on both sides of the road and is frequented by deer, elk and bear. The slopes of the canyon are forested primarily with pine. Flowers are abundant in the spring. The Wallowa River is clear, cold and popular with fly fishing enthusiasts because it can be waded in many locations.

\n",
      "park_name": "Wallowa Lake Highway Forest State Scenic Corridor",
      "park_id": 17,
      "park_longitude": -117.684166
   },
   {
      "park_latitude": 45.284626,
      "park_narrative": "
\n\tWallowa Lake area has activities for everyone in the family.  If you're interested in a campground surrounded on three sides by 9,000' tall snow-capped mountains and a large clear lake, this is the area for you.  To fully enjoy this popular fishing and boating site, check out the Wallowa Lake Marina link www.wallowalakemarina.com.

\n
\n\tOutside the park area within walking distance you can enjoy wilderness trails at the Wallowa Lake trailhead, horseback riding, go-karts, canoeing, miniature golf or ride a tramway to the top of Mt. Howard, elevation 8,256 ft (a rise of 4,000 ft).\n\t\n\tThere are gift shops nearby and a thriving artist community which does world-class bronze castings. Tours are available through the foundries and the showroom displays will keep you interested for hours. Wallowa Lake also serves as a gateway to visit Hells Canyon, the deepest gorge in North America.

\n
\n\tCampground info

\n
\n\t
\n\t\t121 Full-hookup sites (2 ADA)
\n\t
\n\t\t89 Tent sites with water nearby
\n\t
\n\t\tYURTS- 2 Hard-sided (ADA)
\n\t
\n\t\tGroup Tent camping
\n\t
\n\t\tGroup Picnic areas
\n\t
\n\t\tHot showers and flush toilets (ADA available)
\n\t
\n\t\tRV dump station
\n
\n\n\t 
\n
\n\t 

\n",
      "park_name": "Wallowa Lake State Park",
      "park_id": 20,
      "park_longitude": -117.203484
   },
   {
      "park_latitude": 45.605143,
      "park_narrative": "
\n\tThis rest area is located in a canyon alongside the Wallowa River. Fishing is the activity of choice in the clear, cool medium-sized river. There is abundant wildlife on the pine and fir tree-laden slopes above the river. Flowers are abundant in the spring and add to the beauty of the river as it rushes ever downward.

\n",
      "park_name": "Wallowa River Wayside",
      "park_id": 18,
      "park_longitude": -117.629165
   },
   {
      "park_latitude": 44.8101,
      "park_narrative": "
\n\tPark rangers are ready at the Whale Watching Center to answer your questions and help you spot gray whales. Located along the seawall in scenic Depoe Bay, the center is a perfect spot for you watch whales as they blow, dive, spyhop and breach.

\n
\n\tWhale watching takes place almost year-round on the Oregon Coast. The whales migrate past on their way to and from the waters off Alaska and Mexico. We watch whales in the winter from mid-December through January. Spring watching begins in March with the peak near the end of the month and finishes in June with mothers and babies traveling north. Summer brings whales that feed along our coast from July to mid-November. The center is home to the Whale Watching Spoken Here  volunteer program, which sponsors the winter and spring break Whale Watching Weeks. Visit Whale Watching Spoken Here for  2014-15 volunteer registration and training schedule.\n\t\n\t2014-2015 Whale Watching Weeks\n\tWinter - December 27th - 31st 2014

\n
\n\tSpring - March 21nd - 28th 2015

\n",
      "park_name": "Whale Watching Center",
      "park_id": 183,
      "park_longitude": -124.0623
   },
   {
      "park_latitude": 45.241666,
      "park_narrative": "
\n\tOne of Oregon's secret hideaways is located just east of Tygh Valley along Highway 216. The White River plunges 90' over a basalt shelf. The park offers excellent viewpoints of the White River falls. A rugged quarter-mile trail takes hikers down deep within the canyon to the historic hydroelectric power plant at the base of the raw, churning power of the falls. The power plant supplied electricity to Wasco and Sherman Counties from 1910 until the completion of The Dalles Dam in 1960.\n\t\n\tThe park is a popular picnicking, hiking and fishing retreat for visitors to the Deschutes River corridor. Opening early each spring when the desert flowers are in bloom and closing after the leaves turn in the fall, this park offers all of the intrigue of history since time began. The chasm of the falls tells a geological story of violence and power; the old grist pond tells the story of people learning to use that power. The hydroelectric plant at the bottom tells the story of human ingenuity and persistence as we turned the Pacific Northwest's abundant natural energy into electricity.

\n",
      "park_name": "White River Falls State Park",
      "park_id": 28,
      "park_longitude": -121.094444
   },
   {
      "park_latitude": 45.079727,
      "park_narrative": "
\n\tWillamette Mission is one of the most significant and beautiful historic sites in the Willamette Valley. The park is the site of the first mission for Native Americans in the west, founded in 1834 by Reverend Jason Lee. The Methodist Mission was the first American settlement after the fur trading forts in the Oregon Territory.  The original buildings are represented by framed outlines called ghost structures and can be seen with a short jaunt on the Mission Trail. Walk a little further and the landing for the Wheatland Ferry -- the first to carry a wagon and ox team across the Willamette River in 1844 -- is there, welcoming visitors to ride. 

\n
\n\tThe other 'big feature' of the park is the Nation's Largest Black Cottonwood - it's been around for over 250 years.  It on the bank of the mile-long oxbow lake - Mission Lake, along with an array of grassy meadows, flowering shrubs, trees and outstanding bird and wildlife viewing. 

\n
\n\tThe park offers many daytime opportunities for trail enthusiasts, boaters, anglers and picnic groups. It's known for the trails - From rugged but sandy equestrian multi-use trails, to soft-landing jogging, history and nature trails, to sure-footed paved trails.  Sixteen miles in all - sure to find your suit!  Willamette Mission picnic areas are filbert and walnut orchards for family fall picking. For those that enjoy water, plan your spring or early summer trip fishing the docks or canoeing Mission Lake or boating the Willamette River.

\n
\n\tWillamette Mission State Park is perfect for your next picnic! The excellent picnic facilities are reservable for large groups. There are picnic shelters, electricity, restrooms, water faucets, picnic tables, sunny areas and trees for shade, plus ample room for parking. You can even rent a large barbecue at the park.\n\tThe park also has areas with reservations for volleyball, horseshoes, softball and soccer.

\n
\n\tThe park staff love a challenge! Plan on Willamette Mission as a part of your picnic or group activity.

\n
\n\tCampground info

\n
\n\t
\n\t\tBeaver Island group site, primitive
\n\t
\n\t\tReservable for large groups, (up to 100 tents)
\n\t
\n\t\tIndividual camping not available
\n
\n
\n\t 

\n",
      "park_name": "Willamette Mission State Park",
      "park_id": 99,
      "park_longitude": -123.030663
   },
   {
      "park_latitude": 43.91807,
      "park_narrative": "
\n\tVisit the Willamette River Water Trail interactive recreation map for vehicle access and parking, boat launches and camping locations. 

\n
\n\tThe Willamette River and its middle and coast forks extend more than 255 miles from Cottage Grove in the southern Willamette Valley stretching northward to Portland where the river flows into the Columbia River. The Multnomah Channel branches off just miles before the confluence and meanders around Sauvie Island, before it joins the Columbia. The Willamette River Greenway lands dotting the banks of the river are low-key open spaces. A few have boat launches and vault toilets, and others – nothing. Some preserve native trees, plants and animals. Others protect scenic river views, historical sites and places where you can pull your canoe to shore, fish or walk along the river. The Willamette River is a nationally recognized water trail.

\n
\n\tThe Willamette River Recreation Guide includes information on boating safety, river section maps and plant and animal life you may see along the river. For hunting information, see our FAQs.

\n",
      "park_name": "Willamette River Greenway",
      "park_id": 194,
      "park_longitude": -122.815856
   },
   {
      "park_latitude": 45.52,
      "park_narrative": "
\n\tWith the exception of portions of the eastern United States and Texas, the United States is divided into a grid of six-mile squares called Townships and Ranges, commonly known as the rectangular survey system. The Willamette Meridian is one of 37 Principal Meridians in the United States, each of which is named, that define the rectangular survey system.\n\t\n\tThe Willamette Stone is the "Initial Point" or Point of Beginning of the Willamette Meridian. All land surveys and property descriptions in Oregon and Washington are referenced to this point. Established in 1851 under the direction of John B. Preston, the first Surveyor General of the Oregon Territory, the surveys completed from this location promoted settlement of the Northwest and began the transfer of land from government ownership to private ownership.\n\t\n\tAfter a short walk down a hill in the park, you can see, touch and read about this important marker.

\n",
      "park_name": "Willamette Stone State Heritage Site",
      "park_id": 180,
      "park_longitude": -122.7425
   },
   {
      "park_latitude": 43.599044,
      "park_narrative": "
\n\tDespite its close proximity to Highway 101, Tugman State Park is relatively unknown -- a private hideaway on the wondrous south coast. Situated on Eel Lake near the community of Lakeside, Tugman offers campsites with electric/water hookups tucked away in a mature stand of shore pines. The day-use area has a restroom and gazebo-style shelter surrounded by broad green lawns.\n\t\n\tThere's plenty of space for large and small groups to enjoy themselves. The waters of Eel Lake are outstanding for fishing, swimming, canoeing, sailing and boating. A trail around the south end of the lake allows hikers to get away from the developed area of the park and explore the lakes many inlets. Maybe you'll catch glimpses of osprey, crane, eagle, deer and other forest creatures as you walk through forests of spruce, cedar, fir, and alder.\n\t\n\tThe famous Oregon Dunes Recreation area is less than a mile away. Tugman is centrally located for visitors wishing to explore the Oregon coast from Reedsport to Coos Bay.\n\t\n\tEel Lake is brimming with fishing opportunities. The brush-lined shore, steep drop-off and underwater structure makes it the perfect lake for a bass boat and bass fishing. The lake has a good population of largemouth bass (some running up to five pounds), and other fish species include crappie, rainbow trout (which are stocked), steelhead, and coho salmon. All coho, even those under 15 inches must be released. There is a fully-accessible fishing dock at the day use area near the boat ramp. Trout and bass are often caught from the dock.

\n
\n\tCampground info

\n
\n\t
\n\t\tApproximately 94 electrical sites with water
\n\t
\n\t\t16 yurts (6 are pet-friendly - A,B,M,N,O,P- call 1-800-452-5687, 8 a.m. - 5 p.m., Monday through Friday, except holidays to reserve pet friendly yurts.)
\n\t
\n\t\tHot showers and flush toilets
\n\t
\n\t\tHiker/biker camp
\n\t
\n\t\tRV dump station
\n
\n\n\tUniversal Access\n\tTwo campsites  and 11 yurts are accessible to campers with disabilities.
\n",
      "park_name": "William M. Tugman State Park",
      "park_id": 69,
      "park_longitude": -124.180247
   },
   {
      "park_latitude": 42.007019,
      "park_narrative": "
\n\tWinchuck provides a parking area and access to the Winchuck River and ocean beach for fishing, exploring, clamming, strolling, photographing seascapes and observing marine life.

\n
\n\tThere is a multi-agency effort to restore a 1.2-acre estuary at the mouth of the Winchuck River.  The estuary was carved from an upland portion of the 6.8-acre Winchuck State Recreation Site.\n\t\n\tBesides benefiting many aquatic species with an enhanced habitat, the project will improve the Winchuck site by opening a larger area of the beach and improving viewpoints.  Trail improvements and more landscaping are planned as soon as weather permits.

\n",
      "park_name": "Winchuck State Recreation Site",
      "park_id": 57,
      "park_longitude": -124.21161
   },
   {
      "park_latitude": 42.6952777,
      "park_narrative": "
\n\tNote: The Wolf Creek Inn is temporarily closed for construction. The grounds are open, including picnicking, a portable restroom, and an electric vehicle charging station. There is no water service. The Inn will re-open in 2016. To sign up for a mailing list to be notified of a specific opening date, send an email to wolfcreek.inn@oregon.gov. We’re also starting a search for a new concessionaire in late 2015.\n\t\n\tImagine yourself as a traveler along a section of the Applegate Trail in the late 1800s. You have just arrived by stage coach at the Wolf Creek Inn. This is a long-sought-after refuge from a not-so-comfortable portage over mountains and across valleys. After paying 75 cents for a room, bath, and meals, you're ready to relax. You sit down to a good meal and some easy conversation with the innkeepers. Afterward, the men sidle off to the tap room for some quaffs of beer while the ladies adjourn to the parlor. The conversation drifts from tales of inspirational beauty to frightful experiences of the trail.\n\t\n\tThe rooms are no longer 75 cents, but the refuge is still here preserved in its original state. Take a step back in time and visit the inn, which is on the National Register of Historic Places. In front of the tavern, you'll find interpretive panels depicting life on the Applegate Trail. The inn still provides lodging and meals to the weary traveler.\n\t\n\tThe inn was built around 1883 for Henry Smith, a local merchant-entrepreneur. Wolf Creek Tavern, as it was known then, was exceptionally well crafted by local sawyers. It served local traffic to mines and stage travelers connecting between Roseburg and Redding prior to the completion of the Oregon and California railroad through the Siskiyou Mountains in 1887.\n\t\n\tWolf Creek Inn is the oldest continuously operated hotel in the Pacific Northwest. It is here that Jack London completed his novel Valley Of The Moon. As an important stop on the 16 day stagecoach journey from San Francisco to Portland, the Wolf Creek Inn has housed practically every important person found in the Northwest during the early history of Oregon.\n\t\n\tBack in the early days of movies, the Inn became a refuge for beleaguered actors seeking an escape from demanding Hollywood studios. Clark Gable was a good friend of the innkeeper in the 1930s and stopped by several times while fishing the Rogue River just a few miles west of the Inn. Other visitors that have signed the guest register include Carole Lombard and Orson Wells.\n\t\n\tBetween 1975 and 1979, the Inn was acquired by the State of Oregon and restored. Wolf Creek Tavern is listed in the National Register of Historic Places. It is among the best preserved and oldest active travelers inns in Oregon.

\n",
      "park_name": "Wolf Creek Inn State Heritage Site",
      "park_id": 74,
      "park_longitude": -123.395
   },
   {
      "park_latitude": 45.703021,
      "park_narrative": "\n\n
\n\tThe Wygant trail -- six miles west of Hood River -- was a gift to Oregon honoring the memory of the Wygant family. This park adjoins two other state parks near Mitchell Point 5 miles west of Hood River on Interstate 84. A trail strikes through the park in a dense, hilly wilderness area that was once the old Oregon Trail and later the Historic Columbia River Highway. The first mile of this trail is on pavement that hasn't had an automobile on it for 50 years (it still has the yellow divider stripe). As it moves into the wilderness, Wygant trail penetrates a dense forest hillside along a gurgling creek. It is an ideal spot for backpackers who are looking for a little solitude.

\n
\n\t 

\n
\n\tPlease secure your valuable when enjoying our parks.  Thank you!

\n",
      "park_name": "Wygant State Natural Area",
      "park_id": 125,
      "park_longitude": -121.61863
   },
   {
      "park_latitude": 44.307536,
      "park_narrative": "\n\n
\n\tSouth of Yachats, the road makes a one-mile loop, exposing one of the most scenic viewpoints on the coast: the Yachats Bay and the Pacific Ocean. Park along the loop and enjoy access to the beach, tidepools, blowholes, summer sunsets and whale watching.

\n",
      "park_name": "Yachats Ocean Road State Natural Site",
      "park_id": 93,
      "park_longitude": -124.100726
   },
   {
      "park_latitude": 44.310012,
      "park_narrative": "\n\n
\n\tIn the heart of Yachats, turn west on 2nd Street. The road makes a small loop, offering a serene view of the Yachats river as it meets the Pacific Ocean. Park and see the wild waves and gray whale migration. Rock and salmon fishing and tidepools bring people back to this park again and again. Plenty of resting benches and picnic tables.

\n",
      "park_name": "Yachats State Recreation Area",
      "park_id": 94,
      "park_longitude": -124.105872
   },
   {
      "park_latitude": 44.626423,
      "park_narrative": "
\n\tCURRENT LIGHTHOUSE HOURS: Open Daily, 12 PM to 4 PM

\n
\n\tYaquina Bay State Park is located in Newport at the north end of Yaquina Bay near its outlet to the Pacific Ocean. The bluff is forested with spruce and pine, but the real star is the historic lighthouse. The lighthouse -- later used as a Coast Guard Lifeboat Station -- has been restored and is open to the public. Attractions nearby include the historic Newport bayfront, Hatfield Marine Science Center and the Oregon Coast Aquarium.

\n",
      "park_name": "Yaquina Bay State Recreation Site",
      "park_id": 148,
      "park_longitude": -124.061618
   }
<<<<<<< HEAD
]
=======
]
>>>>>>> 138bad00fb492f492bc1529c6ec268d0d7c2745c
